[Killed] BooleanLiteral
index.js:1:48
-export default function ansiRegex({onlyFirst = false} = {}) {
+export default function ansiRegex({onlyFirst = true} = {}) {
 	// Valid string terminator sequences are BEL, ESC\, and 0x9c
 	const ST = '(?:\\u0007|\\u001B\\u005C|\\u009C)';
killedBy: All tests
statusReason: > ansi-regex@6.1.0 test
> ava




  √ match ansi code in a string (569ms)

[Killed] BlockStatement
index.js:1:61
-export default function ansiRegex({onlyFirst = false} = {}) {
-	// Valid string terminator sequences are BEL, ESC\, and 0x9c
-	const ST = '(?:\\u0007|\\u001B\\u005C|\\u009C)';
-	const pattern = [
-		`[\\u001B\\u009B][[\\]()#;?]*(?:(?:(?:(?:;[-a-zA-Z\\d\\/#&.:=?%@~_]+)*|[a-zA-Z\\d]+(?:;[-a-zA-Z\\d\\/#&.:=?%@~_]*)*)?${ST})`,
-		'(?:(?:\\d{1,4}(?:;\\d{0,4})*)?[\\dA-PR-TZcf-nq-uy=><~]))',
-	].join('|');
-
-	return new RegExp(pattern, onlyFirst ? undefined : 'g');
-}
+export default function ansiRegex({onlyFirst = false} = {}) {}
 
killedBy: All tests
statusReason: > ansi-regex@6.1.0 test
> ava




  × match ansi code in a string `t.regex()` must be called with a regular expression

[Killed] ArrayDeclaration
index.js:4:18
 export default function ansiRegex({onlyFirst = false} = {}) {
 	// Valid string terminator sequences are BEL, ESC\, and 0x9c
 	const ST = '(?:\\u0007|\\u001B\\u005C|\\u009C)';
-	const pattern = [
-		`[\\u001B\\u009B][[\\]()#;?]*(?:(?:(?:(?:;[-a-zA-Z\\d\\/#&.:=?%@~_]+)*|[a-zA-Z\\d]+(?:;[-a-zA-Z\\d\\/#&.:=?%@~_]*)*)?${ST})`,
-		'(?:(?:\\d{1,4}(?:;\\d{0,4})*)?[\\dA-PR-TZcf-nq-uy=><~]))',
-	].join('|');
+	const pattern = [].join('|');
 
 	return new RegExp(pattern, onlyFirst ? undefined : 'g');
killedBy: All tests
statusReason: > ansi-regex@6.1.0 test
> ava




  √ match ansi code in a string (3.3s)

[Killed] StringLiteral
index.js:6:3
 	const ST = '(?:\\u0007|\\u001B\\u005C|\\u009C)';
 	const pattern = [
 		`[\\u001B\\u009B][[\\]()#;?]*(?:(?:(?:(?:;[-a-zA-Z\\d\\/#&.:=?%@~_]+)*|[a-zA-Z\\d]+(?:;[-a-zA-Z\\d\\/#&.:=?%@~_]*)*)?${ST})`,
-		'(?:(?:\\d{1,4}(?:;\\d{0,4})*)?[\\dA-PR-TZcf-nq-uy=><~]))',
+		"",
 	].join('|');
 
killedBy: All tests
statusReason: > ansi-regex@6.1.0 test
> ava




  × match ansi code in a string Error thrown in test

[Killed] StringLiteral
index.js:9:53
 		'(?:(?:\\d{1,4}(?:;\\d{0,4})*)?[\\dA-PR-TZcf-nq-uy=><~]))',
 	].join('|');
 
-	return new RegExp(pattern, onlyFirst ? undefined : 'g');
+	return new RegExp(pattern, onlyFirst ? undefined : "");
 }
 
killedBy: All tests
statusReason: > ansi-regex@6.1.0 test
> ava




  √ match ansi code in a string (152ms)
