[Timeout] EqualityOperator
src/utils/parseTokenList.js:13:37
   const list = [];
 
   // gather tokens
-  for (let i = 0, len = str.length; i < len; i++) {
+  for (let i = 0, len = str.length; i <= len; i++) {
     switch (str.charCodeAt(i)) {
       case 0x20 /*   */:

[Timeout] EqualityOperator
src/utils/parseTokenList.js:13:37
   const list = [];
 
   // gather tokens
-  for (let i = 0, len = str.length; i < len; i++) {
+  for (let i = 0, len = str.length; i >= len; i++) {
     switch (str.charCodeAt(i)) {
       case 0x20 /*   */:

[Timeout] ConditionalExpression
src/utils/parseTokenList.js:15:7
   // gather tokens
   for (let i = 0, len = str.length; i < len; i++) {
     switch (str.charCodeAt(i)) {
-      case 0x20 /*   */:
-        if (start === end) {
-          end = i + 1;
-          start = end;
-        }
-        break;
+      case 0x20 /*   */:
       case 0x2c /* , */:
         if (start !== end) {

[Timeout] EqualityOperator
src/utils/parseTokenList.js:16:13
   for (let i = 0, len = str.length; i < len; i++) {
     switch (str.charCodeAt(i)) {
       case 0x20 /*   */:
-        if (start === end) {
+        if (start !== end) {
           end = i + 1;
           start = end;

[Timeout] ConditionalExpression
src/utils/parseTokenList.js:16:13
   for (let i = 0, len = str.length; i < len; i++) {
     switch (str.charCodeAt(i)) {
       case 0x20 /*   */:
-        if (start === end) {
+        if (true) {
           end = i + 1;
           start = end;

[Timeout] ArithmeticOperator
src/utils/parseTokenList.js:17:17
     switch (str.charCodeAt(i)) {
       case 0x20 /*   */:
         if (start === end) {
-          end = i + 1;
+          end = i - 1;
           start = end;
         }

[Timeout] ConditionalExpression
src/utils/parseTokenList.js:21:7
           start = end;
         }
         break;
-      case 0x2c /* , */:
-        if (start !== end) {
-          list.push(str.slice(start, end));
-        }
-        end = i + 1;
-        start = end;
-        break;
+      case 0x2c /* , */:
       default:
         end = i + 1;

[Killed] EqualityOperator
src/utils/parseTokenList.js:22:13
         }
         break;
       case 0x2c /* , */:
-        if (start !== end) {
+        if (start === end) {
           list.push(str.slice(start, end));
         }
killedBy: connect framework: middleware etag should work and generate weak etag should return the "304" code for the "GET" request to the bundle file with etag and "if-none-match" header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 304
Received: 200

[Timeout] BlockStatement
src/utils/parseTokenList.js:22:28
         }
         break;
       case 0x2c /* , */:
-        if (start !== end) {
-          list.push(str.slice(start, end));
-        }
+        if (start !== end) {}
         end = i + 1;
         start = end;

[Timeout] MethodExpression
src/utils/parseTokenList.js:23:21
         break;
       case 0x2c /* , */:
         if (start !== end) {
-          list.push(str.slice(start, end));
+          list.push(str);
         }
         end = i + 1;

[Timeout] ArithmeticOperator
src/utils/parseTokenList.js:25:15
         if (start !== end) {
           list.push(str.slice(start, end));
         }
-        end = i + 1;
+        end = i - 1;
         start = end;
         break;

[Timeout] ConditionalExpression
src/utils/parseTokenList.js:28:7
         end = i + 1;
         start = end;
         break;
-      default:
-        end = i + 1;
-        break;
+      default:
     }
   }

[Killed] ArithmeticOperator
src/utils/parseTokenList.js:29:15
         start = end;
         break;
       default:
-        end = i + 1;
+        end = i - 1;
         break;
     }
killedBy: connect framework: middleware etag should work and generate weak etag should return the "304" code for the "GET" request to the bundle file with etag and "if-none-match" header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 304
Received: 200

[Killed] EqualityOperator
src/utils/parseTokenList.js:35:7
   }
 
   // final token
-  if (start !== end) {
+  if (start === end) {
     list.push(str.slice(start, end));
   }
killedBy: connect framework: middleware etag should work and generate weak etag should return the "304" code for the "GET" request to the bundle file with etag and "if-none-match" header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 304
Received: 200

[Timeout] ConditionalExpression
src/utils/parseTokenList.js:35:7
   }
 
   // final token
-  if (start !== end) {
+  if (false) {
     list.push(str.slice(start, end));
   }
