[Killed] ArrowFunction
index.js:209:11
 			enumerable: false,
 		},
 		rgbToAnsi: {
-			value: (red, green, blue) => styles.ansi256ToAnsi(styles.rgbToAnsi256(red, green, blue)),
+			value: () => undefined,
 			enumerable: false,
 		},
killedBy: All tests
statusReason: > ansi-styles@6.2.1 test
> ava




  ✔ return ANSI escape codes

[Survived] BooleanLiteral
index.js:210:16
 		},
 		rgbToAnsi: {
 			value: (red, green, blue) => styles.ansi256ToAnsi(styles.rgbToAnsi256(red, green, blue)),
-			enumerable: false,
+			enumerable: true,
 		},
 		hexToAnsi: {

[Killed] ArrowFunction
index.js:213:11
 			enumerable: false,
 		},
 		hexToAnsi: {
-			value: hex => styles.ansi256ToAnsi(styles.hexToAnsi256(hex)),
+			value: () => undefined,
 			enumerable: false,
 		},
killedBy: All tests
statusReason: > ansi-styles@6.2.1 test
> ava




  ✔ return ANSI escape codes

[Survived] BooleanLiteral
index.js:214:16
 		},
 		hexToAnsi: {
 			value: hex => styles.ansi256ToAnsi(styles.hexToAnsi256(hex)),
-			enumerable: false,
+			enumerable: true,
 		},
 	});
