[Killed] BlockStatement
source/utilities.js:2:63
 // TODO: When targeting Node.js 16, use `String.prototype.replaceAll`.
-export function stringReplaceAll(string, substring, replacer) {
-	let index = string.indexOf(substring);
-	if (index === -1) {
-		return string;
-	}
-
-	const substringLength = substring.length;
-	let endIndex = 0;
-	let returnValue = '';
-	do {
-		returnValue += string.slice(endIndex, index) + substring + replacer;
-		endIndex = index + substringLength;
-		index = string.indexOf(substring, endIndex);
-	} while (index !== -1);
-
-	returnValue += string.slice(endIndex);
-	return returnValue;
-}
+export function stringReplaceAll(string, substring, replacer) {}
 
 export function stringEncaseCRLFWithFirstIndex(string, prefix, postfix, index) {
killedBy: All tests
statusReason: > chalk@5.4.1 test
> c8 ava




TERM: [none]

[Killed] BlockStatement
source/utilities.js:4:20
 // TODO: When targeting Node.js 16, use `String.prototype.replaceAll`.
 export function stringReplaceAll(string, substring, replacer) {
 	let index = string.indexOf(substring);
-	if (index === -1) {
-		return string;
-	}
+	if (index === -1) {}
 
 	const substringLength = substring.length;
killedBy: All tests
statusReason: > chalk@5.4.1 test
> c8 ava




  √ no-color-support » colors can be forced by using chalk.level

[Killed] ConditionalExpression
source/utilities.js:4:6
 // TODO: When targeting Node.js 16, use `String.prototype.replaceAll`.
 export function stringReplaceAll(string, substring, replacer) {
 	let index = string.indexOf(substring);
-	if (index === -1) {
+	if (false) {
 		return string;
 	}
killedBy: All tests
statusReason: > chalk@5.4.1 test
> c8 ava




TERM: [none]

[Timeout] BlockStatement
source/utilities.js:11:5
 	const substringLength = substring.length;
 	let endIndex = 0;
 	let returnValue = '';
-	do {
-		returnValue += string.slice(endIndex, index) + substring + replacer;
-		endIndex = index + substringLength;
-		index = string.indexOf(substring, endIndex);
-	} while (index !== -1);
+	do {} while (index !== -1);
 
 	returnValue += string.slice(endIndex);

[Killed] AssignmentOperator
source/utilities.js:12:3
 	let endIndex = 0;
 	let returnValue = '';
 	do {
-		returnValue += string.slice(endIndex, index) + substring + replacer;
+		returnValue -= string.slice(endIndex, index) + substring + replacer;
 		endIndex = index + substringLength;
 		index = string.indexOf(substring, endIndex);
killedBy: All tests
statusReason: > chalk@5.4.1 test
> c8 ava




TERM: [none]

[Killed] ArithmeticOperator
source/utilities.js:12:18
 	let endIndex = 0;
 	let returnValue = '';
 	do {
-		returnValue += string.slice(endIndex, index) + substring + replacer;
+		returnValue += string.slice(endIndex, index) - substring + replacer;
 		endIndex = index + substringLength;
 		index = string.indexOf(substring, endIndex);
killedBy: All tests
statusReason: > chalk@5.4.1 test
> c8 ava




TERM: [none]

[Timeout] ArithmeticOperator
source/utilities.js:13:14
 	let returnValue = '';
 	do {
 		returnValue += string.slice(endIndex, index) + substring + replacer;
-		endIndex = index + substringLength;
+		endIndex = index - substringLength;
 		index = string.indexOf(substring, endIndex);
 	} while (index !== -1);

[Killed] EqualityOperator
source/utilities.js:15:11
 		returnValue += string.slice(endIndex, index) + substring + replacer;
 		endIndex = index + substringLength;
 		index = string.indexOf(substring, endIndex);
-	} while (index !== -1);
+	} while (index === -1);
 
 	returnValue += string.slice(endIndex);
killedBy: All tests
statusReason: > chalk@5.4.1 test
> c8 ava




TERM: [none]

[Killed] ConditionalExpression
source/utilities.js:15:11
 		returnValue += string.slice(endIndex, index) + substring + replacer;
 		endIndex = index + substringLength;
 		index = string.indexOf(substring, endIndex);
-	} while (index !== -1);
+	} while (false);
 
 	returnValue += string.slice(endIndex);
killedBy: All tests
statusReason: > chalk@5.4.1 test
> c8 ava




  √ instance » create an isolated context where colors can be disabled (by level)

[Killed] MethodExpression
source/utilities.js:17:17
 		index = string.indexOf(substring, endIndex);
 	} while (index !== -1);
 
-	returnValue += string.slice(endIndex);
+	returnValue += string;
 	return returnValue;
 }
killedBy: All tests
statusReason: > chalk@5.4.1 test
> c8 ava




  √ no-color-support » colors can be forced by using chalk.level

[Killed] AssignmentOperator
source/utilities.js:17:2
 		index = string.indexOf(substring, endIndex);
 	} while (index !== -1);
 
-	returnValue += string.slice(endIndex);
+	returnValue -= string.slice(endIndex);
 	return returnValue;
 }
killedBy: All tests
statusReason: > chalk@5.4.1 test
> c8 ava




TERM: [none]
platform: win32

[Killed] BlockStatement
source/utilities.js:21:80
 	return returnValue;
 }
 
-export function stringEncaseCRLFWithFirstIndex(string, prefix, postfix, index) {
-	let endIndex = 0;
-	let returnValue = '';
-	do {
-		const gotCR = string[index - 1] === '\r';
-		returnValue += string.slice(endIndex, (gotCR ? index - 1 : index)) + prefix + (gotCR ? '\r\n' : '\n') + postfix;
-		endIndex = index + 1;
-		index = string.indexOf('\n', endIndex);
-	} while (index !== -1);
-
-	returnValue += string.slice(endIndex);
-	return returnValue;
-}
+export function stringEncaseCRLFWithFirstIndex(string, prefix, postfix, index) {}
 
killedBy: All tests
statusReason: > chalk@5.4.1 test
> c8 ava




  √ visible » visible: normal output when level > 0

[Killed] StringLiteral
source/utilities.js:23:20
 
 export function stringEncaseCRLFWithFirstIndex(string, prefix, postfix, index) {
 	let endIndex = 0;
-	let returnValue = '';
+	let returnValue = "Stryker was here!";
 	do {
 		const gotCR = string[index - 1] === '\r';
killedBy: All tests
statusReason: > chalk@5.4.1 test
> c8 ava




  √ instance » create an isolated context where colors can be disabled (by level)

[Timeout] BlockStatement
source/utilities.js:24:5
 export function stringEncaseCRLFWithFirstIndex(string, prefix, postfix, index) {
 	let endIndex = 0;
 	let returnValue = '';
-	do {
-		const gotCR = string[index - 1] === '\r';
-		returnValue += string.slice(endIndex, (gotCR ? index - 1 : index)) + prefix + (gotCR ? '\r\n' : '\n') + postfix;
-		endIndex = index + 1;
-		index = string.indexOf('\n', endIndex);
-	} while (index !== -1);
+	do {} while (index !== -1);
 
 	returnValue += string.slice(endIndex);

[Killed] ArithmeticOperator
source/utilities.js:25:24
 	let endIndex = 0;
 	let returnValue = '';
 	do {
-		const gotCR = string[index - 1] === '\r';
+		const gotCR = string[index + 1] === '\r';
 		returnValue += string.slice(endIndex, (gotCR ? index - 1 : index)) + prefix + (gotCR ? '\r\n' : '\n') + postfix;
 		endIndex = index + 1;
killedBy: All tests
statusReason: > chalk@5.4.1 test
> c8 ava




  √ instance » create an isolated context where colors can be disabled (by level)

[Killed] EqualityOperator
source/utilities.js:25:17
 	let endIndex = 0;
 	let returnValue = '';
 	do {
-		const gotCR = string[index - 1] === '\r';
+		const gotCR = string[index - 1] !== '\r';
 		returnValue += string.slice(endIndex, (gotCR ? index - 1 : index)) + prefix + (gotCR ? '\r\n' : '\n') + postfix;
 		endIndex = index + 1;
killedBy: All tests
statusReason: > chalk@5.4.1 test
> c8 ava




TERM: [none]

[Killed] AssignmentOperator
source/utilities.js:26:3
 	let returnValue = '';
 	do {
 		const gotCR = string[index - 1] === '\r';
-		returnValue += string.slice(endIndex, (gotCR ? index - 1 : index)) + prefix + (gotCR ? '\r\n' : '\n') + postfix;
+		returnValue -= string.slice(endIndex, gotCR ? index - 1 : index) + prefix + (gotCR ? '\r\n' : '\n') + postfix;
 		endIndex = index + 1;
 		index = string.indexOf('\n', endIndex);
killedBy: All tests
statusReason: > chalk@5.4.1 test
> c8 ava




  √ instance » create an isolated context where colors can be disabled (by level)

[Killed] ArithmeticOperator
source/utilities.js:26:50
 	let returnValue = '';
 	do {
 		const gotCR = string[index - 1] === '\r';
-		returnValue += string.slice(endIndex, (gotCR ? index - 1 : index)) + prefix + (gotCR ? '\r\n' : '\n') + postfix;
+		returnValue += string.slice(endIndex, (gotCR ? index + 1 : index)) + prefix + (gotCR ? '\r\n' : '\n') + postfix;
 		endIndex = index + 1;
 		index = string.indexOf('\n', endIndex);
killedBy: All tests
statusReason: > chalk@5.4.1 test
> c8 ava




TERM: [none]

[Timeout] ArithmeticOperator
source/utilities.js:27:14
 	do {
 		const gotCR = string[index - 1] === '\r';
 		returnValue += string.slice(endIndex, (gotCR ? index - 1 : index)) + prefix + (gotCR ? '\r\n' : '\n') + postfix;
-		endIndex = index + 1;
+		endIndex = index - 1;
 		index = string.indexOf('\n', endIndex);
 	} while (index !== -1);

[Timeout] EqualityOperator
source/utilities.js:29:11
 		returnValue += string.slice(endIndex, (gotCR ? index - 1 : index)) + prefix + (gotCR ? '\r\n' : '\n') + postfix;
 		endIndex = index + 1;
 		index = string.indexOf('\n', endIndex);
-	} while (index !== -1);
+	} while (index === -1);
 
 	returnValue += string.slice(endIndex);

[Timeout] UnaryOperator
source/utilities.js:29:21
 		returnValue += string.slice(endIndex, (gotCR ? index - 1 : index)) + prefix + (gotCR ? '\r\n' : '\n') + postfix;
 		endIndex = index + 1;
 		index = string.indexOf('\n', endIndex);
-	} while (index !== -1);
+	} while (index !== +1);
 
 	returnValue += string.slice(endIndex);
