[Killed] ArrowFunction
source/vendor/ansi-styles/index.js:7:21
 
 const wrapAnsi256 = (offset = 0) => code => `\u001B[${38 + offset};5;${code}m`;
 
-const wrapAnsi16m = (offset = 0) => (red, green, blue) => `\u001B[${38 + offset};2;${red};${green};${blue}m`;
+const wrapAnsi16m = () => undefined;
 
 const styles = {
killedBy: All tests
statusReason: > chalk@5.4.1 test
> c8 ava




TERM: [none]

[Survived] ArrayDeclaration
source/vendor/ansi-styles/index.js:29:9
 		yellow: [33, 39],
 		blue: [34, 39],
 		magenta: [35, 39],
-		cyan: [36, 39],
+		cyan: [],
 		white: [37, 39],
 

[Killed] ArrayDeclaration
source/vendor/ansi-styles/index.js:35:9
 		// Bright color
 		blackBright: [90, 39],
 		gray: [90, 39], // Alias of `blackBright`
-		grey: [90, 39], // Alias of `blackBright`
+		grey: [], // Alias of `blackBright`
 		redBright: [91, 39],
 		greenBright: [92, 39],
killedBy: All tests
statusReason: > chalk@5.4.1 test
> c8 ava




  √ instance » create an isolated context where colors can be disabled (by level)

[Survived] ArrayDeclaration
source/vendor/ansi-styles/index.js:37:16
 		gray: [90, 39], // Alias of `blackBright`
 		grey: [90, 39], // Alias of `blackBright`
 		redBright: [91, 39],
-		greenBright: [92, 39],
+		greenBright: [],
 		yellowBright: [93, 39],
 		blueBright: [94, 39],

[Timeout] ArrayDeclaration
source/vendor/ansi-styles/index.js:39:15
 		redBright: [91, 39],
 		greenBright: [92, 39],
 		yellowBright: [93, 39],
-		blueBright: [94, 39],
+		blueBright: [],
 		magentaBright: [95, 39],
 		cyanBright: [96, 39],

[Killed] ObjectLiteral
source/vendor/ansi-styles/index.js:44:11
 		cyanBright: [96, 39],
 		whiteBright: [97, 39],
 	},
-	bgColor: {
-		bgBlack: [40, 49],
-		bgRed: [41, 49],
-		bgGreen: [42, 49],
-		bgYellow: [43, 49],
-		bgBlue: [44, 49],
-		bgMagenta: [45, 49],
-		bgCyan: [46, 49],
-		bgWhite: [47, 49],
-
-		// Bright color
-		bgBlackBright: [100, 49],
-		bgGray: [100, 49], // Alias of `bgBlackBright`
-		bgGrey: [100, 49], // Alias of `bgBlackBright`
-		bgRedBright: [101, 49],
-		bgGreenBright: [102, 49],
-		bgYellowBright: [103, 49],
-		bgBlueBright: [104, 49],
-		bgMagentaBright: [105, 49],
-		bgCyanBright: [106, 49],
-		bgWhiteBright: [107, 49],
-	},
+	bgColor: {},
 };
 
killedBy: All tests
statusReason: > chalk@5.4.1 test
> c8 ava




TERM: [none]

[Killed] ArrayDeclaration
source/vendor/ansi-styles/index.js:49:11
 		bgRed: [41, 49],
 		bgGreen: [42, 49],
 		bgYellow: [43, 49],
-		bgBlue: [44, 49],
+		bgBlue: [],
 		bgMagenta: [45, 49],
 		bgCyan: [46, 49],
killedBy: All tests
statusReason: > chalk@5.4.1 test
> c8 ava




TERM: [none]

[Timeout] ArrayDeclaration
source/vendor/ansi-styles/index.js:60:19
 		bgGrey: [100, 49], // Alias of `bgBlackBright`
 		bgRedBright: [101, 49],
 		bgGreenBright: [102, 49],
-		bgYellowBright: [103, 49],
+		bgYellowBright: [],
 		bgBlueBright: [104, 49],
 		bgMagentaBright: [105, 49],

[Killed] ObjectLiteral
source/vendor/ansi-styles/index.js:111:17
 
 	// From https://github.com/Qix-/color-convert/blob/3f0e0d4e92e235796ccb17f6e85c72094a651f49/conversions.js
 	Object.defineProperties(styles, {
-		rgbToAnsi256: {
-			value(red, green, blue) {
-				// We use the extended greyscale palette here, with the exception of
-				// black and white. normal palette only has 4 greyscale shades.
-				if (red === green && green === blue) {
-					if (red < 8) {
-						return 16;
-					}
-
-					if (red > 248) {
-						return 231;
-					}
-
-					return Math.round(((red - 8) / 247) * 24) + 232;
-				}
-
-				return 16
-					+ (36 * Math.round(red / 255 * 5))
-					+ (6 * Math.round(green / 255 * 5))
-					+ Math.round(blue / 255 * 5);
-			},
-			enumerable: false,
-		},
+		rgbToAnsi256: {},
 		hexToRgb: {
 			value(hex) {
killedBy: All tests
statusReason: > chalk@5.4.1 test
> c8 ava




  √ visible » visible: normal output when level > 0

[Killed] EqualityOperator
source/vendor/ansi-styles/index.js:115:9
 			value(red, green, blue) {
 				// We use the extended greyscale palette here, with the exception of
 				// black and white. normal palette only has 4 greyscale shades.
-				if (red === green && green === blue) {
+				if (red !== green && green === blue) {
 					if (red < 8) {
 						return 16;
killedBy: All tests
statusReason: > chalk@5.4.1 test
> c8 ava




  √ visible » visible: normal output when level > 0

[Killed] ConditionalExpression
source/vendor/ansi-styles/index.js:115:9
 			value(red, green, blue) {
 				// We use the extended greyscale palette here, with the exception of
 				// black and white. normal palette only has 4 greyscale shades.
-				if (red === green && green === blue) {
+				if (true && green === blue) {
 					if (red < 8) {
 						return 16;
killedBy: All tests
statusReason: > chalk@5.4.1 test
> c8 ava




TERM: [none]

[Survived] EqualityOperator
source/vendor/ansi-styles/index.js:116:10
 				// We use the extended greyscale palette here, with the exception of
 				// black and white. normal palette only has 4 greyscale shades.
 				if (red === green && green === blue) {
-					if (red < 8) {
+					if (red <= 8) {
 						return 16;
 					}

[Survived] ConditionalExpression
source/vendor/ansi-styles/index.js:120:10
 						return 16;
 					}
 
-					if (red > 248) {
+					if (false) {
 						return 231;
 					}

[Timeout] ArithmeticOperator
source/vendor/ansi-styles/index.js:124:26
 						return 231;
 					}
 
-					return Math.round(((red - 8) / 247) * 24) + 232;
+					return Math.round(((red + 8) / 247) * 24) + 232;
 				}
 

[Timeout] ArithmeticOperator
source/vendor/ansi-styles/index.js:127:12
 					return Math.round(((red - 8) / 247) * 24) + 232;
 				}
 
-				return 16
-					+ (36 * Math.round(red / 255 * 5))
-					+ (6 * Math.round(green / 255 * 5))
+				return 16 + 36 * Math.round(red / 255 * 5) - 6 * Math.round(green / 255 * 5)
 					+ Math.round(blue / 255 * 5);
 			},

[Killed] ArithmeticOperator
source/vendor/ansi-styles/index.js:128:25
 				}
 
 				return 16
-					+ (36 * Math.round(red / 255 * 5))
+					+ (36 * Math.round(red / 255 / 5))
 					+ (6 * Math.round(green / 255 * 5))
 					+ Math.round(blue / 255 * 5);
killedBy: All tests
statusReason: > chalk@5.4.1 test
> c8 ava




TERM: [none]

[Survived] BlockStatement
source/vendor/ansi-styles/index.js:143:35
 
 				let [colorString] = matches;
 
-				if (colorString.length === 3) {
-					colorString = [...colorString].map(character => character + character).join('');
-				}
+				if (colorString.length === 3) {}
 
 				const integer = Number.parseInt(colorString, 16);

[Timeout] BlockStatement
source/vendor/ansi-styles/index.js:165:19
 		},
 		ansi256ToAnsi: {
 			value(code) {
-				if (code < 8) {
-					return 30 + code;
-				}
+				if (code < 8) {}
 
 				if (code < 16) {

[Timeout] ConditionalExpression
source/vendor/ansi-styles/index.js:169:9
 					return 30 + code;
 				}
 
-				if (code < 16) {
+				if (false) {
 					return 90 + (code - 8);
 				}

[Timeout] ConditionalExpression
source/vendor/ansi-styles/index.js:177:9
 				let green;
 				let blue;
 
-				if (code >= 232) {
+				if (false) {
 					red = (((code - 232) * 10) + 8) / 255;
 					green = red;

[Timeout] ArithmeticOperator
source/vendor/ansi-styles/index.js:178:14
 				let blue;
 
 				if (code >= 232) {
-					red = (((code - 232) * 10) + 8) / 255;
+					red = (((code - 232) / 10) + 8) / 255;
 					green = red;
 					blue = red;

[Timeout] ConditionalExpression
source/vendor/ansi-styles/index.js:200:9
 				// eslint-disable-next-line no-bitwise
 				let result = 30 + ((Math.round(blue) << 2) | (Math.round(green) << 1) | Math.round(red));
 
-				if (value === 2) {
+				if (false) {
 					result += 60;
 				}

[Timeout] EqualityOperator
source/vendor/ansi-styles/index.js:200:9
 				// eslint-disable-next-line no-bitwise
 				let result = 30 + ((Math.round(blue) << 2) | (Math.round(green) << 1) | Math.round(red));
 
-				if (value === 2) {
+				if (value !== 2) {
 					result += 60;
 				}
