[Survived] BlockStatement
source/vendor/supports-color/browser.js:3:22
 /* eslint-env browser */
 
-const level = (() => {
-	if (!('navigator' in globalThis)) {
-		return 0;
-	}
-
-	if (globalThis.navigator.userAgentData) {
-		const brand = navigator.userAgentData.brands.find(({brand}) => brand === 'Chromium');
-		if (brand && brand.version > 93) {
-			return 3;
-		}
-	}
-
-	if (/\b(Chrome|Chromium)\//.test(globalThis.navigator.userAgent)) {
-		return 1;
-	}
-
-	return 0;
-})();
+const level = (() => {})();
 
 const colorSupport = level !== 0 && {

[Timeout] ConditionalExpression
source/vendor/supports-color/browser.js:4:6
 /* eslint-env browser */
 
 const level = (() => {
-	if (!('navigator' in globalThis)) {
+	if (false) {
 		return 0;
 	}

[Timeout] BlockStatement
source/vendor/supports-color/browser.js:8:42
 		return 0;
 	}
 
-	if (globalThis.navigator.userAgentData) {
-		const brand = navigator.userAgentData.brands.find(({brand}) => brand === 'Chromium');
-		if (brand && brand.version > 93) {
-			return 3;
-		}
-	}
+	if (globalThis.navigator.userAgentData) {}
 
 	if (/\b(Chrome|Chromium)\//.test(globalThis.navigator.userAgent)) {

[Survived] ConditionalExpression
source/vendor/supports-color/browser.js:9:66
 	}
 
 	if (globalThis.navigator.userAgentData) {
-		const brand = navigator.userAgentData.brands.find(({brand}) => brand === 'Chromium');
+		const brand = navigator.userAgentData.brands.find(({brand}) => true);
 		if (brand && brand.version > 93) {
 			return 3;

[Timeout] BlockStatement
source/vendor/supports-color/browser.js:10:36
 
 	if (globalThis.navigator.userAgentData) {
 		const brand = navigator.userAgentData.brands.find(({brand}) => brand === 'Chromium');
-		if (brand && brand.version > 93) {
-			return 3;
-		}
+		if (brand && brand.version > 93) {}
 	}
 

[Survived] LogicalOperator
source/vendor/supports-color/browser.js:10:7
 
 	if (globalThis.navigator.userAgentData) {
 		const brand = navigator.userAgentData.brands.find(({brand}) => brand === 'Chromium');
-		if (brand && brand.version > 93) {
+		if (brand || brand.version > 93) {
 			return 3;
 		}

[Survived] BlockStatement
source/vendor/supports-color/browser.js:15:68
 		}
 	}
 
-	if (/\b(Chrome|Chromium)\//.test(globalThis.navigator.userAgent)) {
-		return 1;
-	}
+	if (/\b(Chrome|Chromium)\//.test(globalThis.navigator.userAgent)) {}
 
 	return 0;

[Timeout] ConditionalExpression
source/vendor/supports-color/browser.js:22:22
 	return 0;
 })();
 
-const colorSupport = level !== 0 && {
-	level,
-	hasBasic: true,
-	has256: level >= 2,
-	has16m: level >= 3,
-};
+const colorSupport = false;
 
 const supportsColor = {

[Timeout] LogicalOperator
source/vendor/supports-color/browser.js:22:22
 	return 0;
 })();
 
-const colorSupport = level !== 0 && {
-	level,
-	hasBasic: true,
-	has256: level >= 2,
-	has16m: level >= 3,
-};
+const colorSupport = level !== 0 || {
+  level,
+  hasBasic: true,
+  has256: level >= 2,
+  has16m: level >= 3
+};
 
 const supportsColor = {

[Survived] ConditionalExpression
source/vendor/supports-color/browser.js:26:10
 	level,
 	hasBasic: true,
 	has256: level >= 2,
-	has16m: level >= 3,
+	has16m: false,
 };
 
