[Survived] ConditionalExpression
source/vendor/supports-color/index.js:11:9
 	const prefix = flag.startsWith('-') ? '' : (flag.length === 1 ? '-' : '--');
 	const position = argv.indexOf(prefix + flag);
 	const terminatorPosition = argv.indexOf('--');
-	return position !== -1 && (terminatorPosition === -1 || position < terminatorPosition);
+	return true;
 }
 

[Survived] ConditionalExpression
source/vendor/supports-color/index.js:11:9
 	const prefix = flag.startsWith('-') ? '' : (flag.length === 1 ? '-' : '--');
 	const position = argv.indexOf(prefix + flag);
 	const terminatorPosition = argv.indexOf('--');
-	return position !== -1 && (terminatorPosition === -1 || position < terminatorPosition);
+	return true && (terminatorPosition === -1 || position < terminatorPosition);
 }
 

[Timeout] LogicalOperator
source/vendor/supports-color/index.js:18:2
 
 let flagForceColor;
 if (
-	hasFlag('no-color')
-	|| hasFlag('no-colors')
-	|| hasFlag('color=false')
-	|| hasFlag('color=never')
+	(hasFlag('no-color') || hasFlag('no-colors') || hasFlag('color=false')) && hasFlag('color=never')
 ) {
 	flagForceColor = 0;

[Survived] LogicalOperator
source/vendor/supports-color/index.js:18:2
 
 let flagForceColor;
 if (
-	hasFlag('no-color')
-	|| hasFlag('no-colors')
-	|| hasFlag('color=false')
+	(hasFlag('no-color') || hasFlag('no-colors')) && hasFlag('color=false')
 	|| hasFlag('color=never')
 ) {

[Timeout] StringLiteral
source/vendor/supports-color/index.js:21:13
 	hasFlag('no-color')
 	|| hasFlag('no-colors')
 	|| hasFlag('color=false')
-	|| hasFlag('color=never')
+	|| hasFlag("")
 ) {
 	flagForceColor = 0;

[Timeout] LogicalOperator
source/vendor/supports-color/index.js:25:2
 ) {
 	flagForceColor = 0;
 } else if (
-	hasFlag('color')
-	|| hasFlag('colors')
+	hasFlag('color') && hasFlag('colors')
 	|| hasFlag('color=true')
 	|| hasFlag('color=always')

[Survived] BlockStatement
source/vendor/supports-color/index.js:33:26
 	flagForceColor = 1;
 }
 
-function envForceColor() {
-	if ('FORCE_COLOR' in env) {
-		if (env.FORCE_COLOR === 'true') {
-			return 1;
-		}
-
-		if (env.FORCE_COLOR === 'false') {
-			return 0;
-		}
-
-		return env.FORCE_COLOR.length === 0 ? 1 : Math.min(Number.parseInt(env.FORCE_COLOR, 10), 3);
-	}
-}
+function envForceColor() {}
 
 function translateLevel(level) {

[Killed] ConditionalExpression
source/vendor/supports-color/index.js:34:6
 }
 
 function envForceColor() {
-	if ('FORCE_COLOR' in env) {
+	if (true) {
 		if (env.FORCE_COLOR === 'true') {
 			return 1;
killedBy: All tests
statusReason: > chalk@5.4.1 test
> c8 ava




  Uncaught exception in test\instance.js

[Survived] ConditionalExpression
source/vendor/supports-color/index.js:34:6
 }
 
 function envForceColor() {
-	if ('FORCE_COLOR' in env) {
+	if (false) {
 		if (env.FORCE_COLOR === 'true') {
 			return 1;

[Survived] ConditionalExpression
source/vendor/supports-color/index.js:35:7
 
 function envForceColor() {
 	if ('FORCE_COLOR' in env) {
-		if (env.FORCE_COLOR === 'true') {
+		if (true) {
 			return 1;
 		}

[Survived] ConditionalExpression
source/vendor/supports-color/index.js:35:7
 
 function envForceColor() {
 	if ('FORCE_COLOR' in env) {
-		if (env.FORCE_COLOR === 'true') {
+		if (false) {
 			return 1;
 		}

[Survived] EqualityOperator
source/vendor/supports-color/index.js:43:10
 			return 0;
 		}
 
-		return env.FORCE_COLOR.length === 0 ? 1 : Math.min(Number.parseInt(env.FORCE_COLOR, 10), 3);
+		return env.FORCE_COLOR.length !== 0 ? 1 : Math.min(Number.parseInt(env.FORCE_COLOR, 10), 3);
 	}
 }

[Survived] ConditionalExpression
source/vendor/supports-color/index.js:43:10
 			return 0;
 		}
 
-		return env.FORCE_COLOR.length === 0 ? 1 : Math.min(Number.parseInt(env.FORCE_COLOR, 10), 3);
+		return false ? 1 : Math.min(Number.parseInt(env.FORCE_COLOR, 10), 3);
 	}
 }

[Survived] BlockStatement
source/vendor/supports-color/index.js:48:19
 }
 
 function translateLevel(level) {
-	if (level === 0) {
-		return false;
-	}
+	if (level === 0) {}
 
 	return {

[Survived] ObjectLiteral
source/vendor/supports-color/index.js:52:9
 		return false;
 	}
 
-	return {
-		level,
-		hasBasic: true,
-		has256: level >= 2,
-		has16m: level >= 3,
-	};
+	return {};
 }
 

[Survived] BlockStatement
source/vendor/supports-color/index.js:72:18
 		return 0;
 	}
 
-	if (sniffFlags) {
-		if (hasFlag('color=16m')
-			|| hasFlag('color=full')
-			|| hasFlag('color=truecolor')) {
-			return 3;
-		}
-
-		if (hasFlag('color=256')) {
-			return 2;
-		}
-	}
+	if (sniffFlags) {}
 
 	// Check for Azure DevOps pipelines.

[Survived] LogicalOperator
source/vendor/supports-color/index.js:73:7
 	}
 
 	if (sniffFlags) {
-		if (hasFlag('color=16m')
-			|| hasFlag('color=full')
-			|| hasFlag('color=truecolor')) {
+		if ((hasFlag('color=16m') || hasFlag('color=full')) && hasFlag('color=truecolor')) {
 			return 3;
 		}

[Killed] ConditionalExpression
source/vendor/supports-color/index.js:79:7
 			return 3;
 		}
 
-		if (hasFlag('color=256')) {
+		if (true) {
 			return 2;
 		}
killedBy: All tests
statusReason: > chalk@5.4.1 test
> c8 ava




  √ no-color-support » colors can be forced by using chalk.level

[Killed] ConditionalExpression
source/vendor/supports-color/index.js:86:6
 
 	// Check for Azure DevOps pipelines.
 	// Has to be above the `!streamIsTTY` check.
-	if ('TF_BUILD' in env && 'AGENT_NAME' in env) {
+	if (true) {
 		return 1;
 	}
killedBy: All tests
statusReason: > chalk@5.4.1 test
> c8 ava




TERM: [none]

[Survived] ConditionalExpression
source/vendor/supports-color/index.js:94:14
 		return 0;
 	}
 
-	const min = forceColor || 0;
+	const min = true;
 
 	if (env.TERM === 'dumb') {

[Survived] ConditionalExpression
source/vendor/supports-color/index.js:96:6
 
 	const min = forceColor || 0;
 
-	if (env.TERM === 'dumb') {
+	if (true) {
 		return min;
 	}

[Timeout] ConditionalExpression
source/vendor/supports-color/index.js:100:6
 		return min;
 	}
 
-	if (process.platform === 'win32') {
+	if (true) {
 		// Windows 10 build 10586 is the first Windows release that supports 256 colors.
 		// Windows 10 build 14931 is the first release that supports 16m/TrueColor.

[Survived] EqualityOperator
source/vendor/supports-color/index.js:100:6
 		return min;
 	}
 
-	if (process.platform === 'win32') {
+	if (process.platform !== 'win32') {
 		// Windows 10 build 10586 is the first Windows release that supports 256 colors.
 		// Windows 10 build 14931 is the first release that supports 16m/TrueColor.

[Survived] EqualityOperator
source/vendor/supports-color/index.js:105:4
 		// Windows 10 build 14931 is the first release that supports 16m/TrueColor.
 		const osRelease = os.release().split('.');
 		if (
-			Number(osRelease[0]) >= 10
+			Number(osRelease[0]) > 10
 			&& Number(osRelease[2]) >= 10_586
 		) {

[Survived] ConditionalExpression
source/vendor/supports-color/index.js:105:4
 		// Windows 10 build 14931 is the first release that supports 16m/TrueColor.
 		const osRelease = os.release().split('.');
 		if (
-			Number(osRelease[0]) >= 10
-			&& Number(osRelease[2]) >= 10_586
+			false
 		) {
 			return Number(osRelease[2]) >= 14_931 ? 3 : 2;

[Survived] EqualityOperator
source/vendor/supports-color/index.js:106:7
 		const osRelease = os.release().split('.');
 		if (
 			Number(osRelease[0]) >= 10
-			&& Number(osRelease[2]) >= 10_586
+			&& Number(osRelease[2]) > 10_586
 		) {
 			return Number(osRelease[2]) >= 14_931 ? 3 : 2;

[Survived] EqualityOperator
source/vendor/supports-color/index.js:108:11
 			Number(osRelease[0]) >= 10
 			&& Number(osRelease[2]) >= 10_586
 		) {
-			return Number(osRelease[2]) >= 14_931 ? 3 : 2;
+			return Number(osRelease[2]) < 14_931 ? 3 : 2;
 		}
 

[Survived] ConditionalExpression
source/vendor/supports-color/index.js:108:11
 			Number(osRelease[0]) >= 10
 			&& Number(osRelease[2]) >= 10_586
 		) {
-			return Number(osRelease[2]) >= 14_931 ? 3 : 2;
+			return true ? 3 : 2;
 		}
 

[Timeout] ConditionalExpression
source/vendor/supports-color/index.js:115:7
 	}
 
 	if ('CI' in env) {
-		if (['GITHUB_ACTIONS', 'GITEA_ACTIONS', 'CIRCLECI'].some(key => key in env)) {
+		if (true) {
 			return 3;
 		}

[Survived] EqualityOperator
source/vendor/supports-color/index.js:119:94
 			return 3;
 		}
 
-		if (['TRAVIS', 'APPVEYOR', 'GITLAB_CI', 'BUILDKITE', 'DRONE'].some(sign => sign in env) || env.CI_NAME === 'codeship') {
+		if (['TRAVIS', 'APPVEYOR', 'GITLAB_CI', 'BUILDKITE', 'DRONE'].some(sign => sign in env) || env.CI_NAME !== 'codeship') {
 			return 1;
 		}

[Survived] ConditionalExpression
source/vendor/supports-color/index.js:119:7
 			return 3;
 		}
 
-		if (['TRAVIS', 'APPVEYOR', 'GITLAB_CI', 'BUILDKITE', 'DRONE'].some(sign => sign in env) || env.CI_NAME === 'codeship') {
+		if (true) {
 			return 1;
 		}

[Survived] BlockStatement
source/vendor/supports-color/index.js:126:33
 		return min;
 	}
 
-	if ('TEAMCITY_VERSION' in env) {
-		return /^(9\.(0*[1-9]\d*)\.|\d{2,}\.)/.test(env.TEAMCITY_VERSION) ? 1 : 0;
-	}
+	if ('TEAMCITY_VERSION' in env) {}
 
 	if (env.COLORTERM === 'truecolor') {

[Timeout] BlockStatement
source/vendor/supports-color/index.js:130:37
 		return /^(9\.(0*[1-9]\d*)\.|\d{2,}\.)/.test(env.TEAMCITY_VERSION) ? 1 : 0;
 	}
 
-	if (env.COLORTERM === 'truecolor') {
-		return 3;
-	}
+	if (env.COLORTERM === 'truecolor') {}
 
 	if (env.TERM === 'xterm-kitty') {

[Timeout] ConditionalExpression
source/vendor/supports-color/index.js:130:6
 		return /^(9\.(0*[1-9]\d*)\.|\d{2,}\.)/.test(env.TEAMCITY_VERSION) ? 1 : 0;
 	}
 
-	if (env.COLORTERM === 'truecolor') {
+	if (false) {
 		return 3;
 	}

[Timeout] ConditionalExpression
source/vendor/supports-color/index.js:134:6
 		return 3;
 	}
 
-	if (env.TERM === 'xterm-kitty') {
+	if (false) {
 		return 3;
 	}

[Survived] BlockStatement
source/vendor/supports-color/index.js:138:29
 		return 3;
 	}
 
-	if ('TERM_PROGRAM' in env) {
-		const version = Number.parseInt((env.TERM_PROGRAM_VERSION || '').split('.')[0], 10);
-
-		switch (env.TERM_PROGRAM) {
-			case 'iTerm.app': {
-				return version >= 3 ? 3 : 2;
-			}
-
-			case 'Apple_Terminal': {
-				return 2;
-			}
-			// No default
-		}
-	}
+	if ('TERM_PROGRAM' in env) {}
 
 	if (/-256(color)?$/i.test(env.TERM)) {

[Survived] ConditionalExpression
source/vendor/supports-color/index.js:143:12
 
 		switch (env.TERM_PROGRAM) {
 			case 'iTerm.app': {
-				return version >= 3 ? 3 : 2;
+				return false ? 3 : 2;
 			}
 

[Survived] ConditionalExpression
source/vendor/supports-color/index.js:157:6
 		return 2;
 	}
 
-	if (/^screen|^xterm|^vt100|^vt220|^rxvt|color|ansi|cygwin|linux/i.test(env.TERM)) {
+	if (true) {
 		return 1;
 	}

[Survived] ConditionalExpression
source/vendor/supports-color/index.js:161:6
 		return 1;
 	}
 
-	if ('COLORTERM' in env) {
+	if (true) {
 		return 1;
 	}
