[Killed] BooleanLiteral
lib/command.js:27:32
     /** @type {Option[]} */
     this.options = [];
     this.parent = null;
-    this._allowUnknownOption = false;
+    this._allowUnknownOption = true;
     this._allowExcessArguments = false;
     /** @type {Argument[]} */
killedBy: when option-argument for short optional is -1e-3.0 then consumed=false
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "commander.unknownOption"
Received: "commander.excessArguments"

[Killed] BooleanLiteral
lib/command.js:28:34
     this.options = [];
     this.parent = null;
     this._allowUnknownOption = false;
-    this._allowExcessArguments = false;
+    this._allowExcessArguments = true;
     /** @type {Argument[]} */
     this.registeredArguments = [];
killedBy: allowExcessArguments when action handler: true when specify excess program argument then error by default
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Survived] ArrayDeclaration
lib/command.js:35:26
     /** @type {string[]} */
     this.args = []; // cli args with options removed
     this.rawArgs = [];
-    this.processedArgs = []; // like .args but after custom processing and collecting variadic
+    this.processedArgs = ["Stryker was here"]; // like .args but after custom processing and collecting variadic
     this._scriptPath = null;
     this._name = name || '';

[Killed] BooleanLiteral
lib/command.js:40:38
     this._name = name || '';
     this._optionValues = {};
     this._optionValueSources = {}; // default, env, cli etc
-    this._storeOptionsAsProperties = false;
+    this._storeOptionsAsProperties = true;
     this._actionHandler = null;
     this._executableHandler = false;
killedBy: when .action called then command passed to action
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {}
+ Command {
+   "_actionHandler": [Function listener],

[Killed] BooleanLiteral
lib/command.js:42:31
     this._optionValueSources = {}; // default, env, cli etc
     this._storeOptionsAsProperties = false;
     this._actionHandler = null;
-    this._executableHandler = false;
+    this._executableHandler = true;
     this._executableFile = null; // custom name for executable
     this._executableDir = null; // custom search directory for subcommands
killedBy: default action command when default subcommand and no command then call default
statusReason: Error: 'test-default' does not exist
 - if 'default' is not meant to be an executable command, remove description parameter from '.command()' and use '.description()' instead
 - if the default executable name is not suitable, use the executableFile option to supply a custom name or path
 - searched for local subcommand relative to directory 'C:\projects\TCC\commander.js\.stryker-tmp\sandbox-3JgW2O

[Killed] ArrayDeclaration
lib/command.js:47:21
     this._executableDir = null; // custom search directory for subcommands
     this._defaultCommandName = null;
     this._exitCallback = null;
-    this._aliases = [];
+    this._aliases = ["Stryker was here"];
     this._combineFlagAndOptionalValue = true;
     this._description = '';
killedBy: default executable command when default subcommand and no command then call default
statusReason: Error: Command failed: node C:\projects\TCC\commander.js\.stryker-tmp\sandbox-3JgW2O\tests\fixtures\pm
C:\projects\TCC\commander.js\.stryker-tmp\sandbox-3JgW2O\lib\command.js:954
          throw new Error(stryMutAct_9fa48("352") ? `` : (stryCov_9fa48("352"), `cannot add command '${newCmd}' as already have command '${existingCmd}'`));
          ^

Error: cannot add command 'search|Stryker was h

[Killed] BooleanLiteral
lib/command.js:56:32
     this._passThroughOptions = false;
     this._lifeCycleHooks = {}; // a hash of arrays
     /** @type {(boolean | string)} */
-    this._showHelpAfterError = false;
+    this._showHelpAfterError = true;
     this._showSuggestionAfterError = true;
     this._savedState = null; // used in save/restoreStateBeforeParse
killedBy: when cli of a and commands ["ab"] then suggest ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: null

[Survived] BooleanLiteral
lib/command.js:57:38
     this._lifeCycleHooks = {}; // a hash of arrays
     /** @type {(boolean | string)} */
     this._showHelpAfterError = false;
-    this._showSuggestionAfterError = true;
+    this._showSuggestionAfterError = false;
     this._savedState = null; // used in save/restoreStateBeforeParse
 

[Killed] ArrowFunction
lib/command.js:62:17
 
     // see configureOutput() for docs
     this._outputConfiguration = {
-      writeOut: (str) => process.stdout.write(str),
+      writeOut: () => undefined,
       writeErr: (str) => process.stderr.write(str),
       outputError: (str, write) => write(str),
killedBy: when call help(cb) then display cb output and exit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "reformatted help"

Number of calls: 0

[Killed] ArrowFunction
lib/command.js:63:17
     // see configureOutput() for docs
     this._outputConfiguration = {
       writeOut: (str) => process.stdout.write(str),
-      writeErr: (str) => process.stderr.write(str),
+      writeErr: () => undefined,
       outputError: (str, write) => write(str),
       getOutHelpWidth: () =>
killedBy: when call .help with { error: true } then output on stderr
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Usage:  [options]·
Options:
  -h, --help  display help for command
"

Number of calls: 0

[Killed] ArrowFunction
lib/command.js:64:20
     this._outputConfiguration = {
       writeOut: (str) => process.stdout.write(str),
       writeErr: (str) => process.stderr.write(str),
-      outputError: (str, write) => write(str),
+      outputError: () => undefined,
       getOutHelpWidth: () =>
         process.stdout.isTTY ? process.stdout.columns : undefined,
killedBy: .exitOverride and error details when specify unknown program option then throw CommanderError
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ArrowFunction
lib/command.js:65:24
       writeOut: (str) => process.stdout.write(str),
       writeErr: (str) => process.stderr.write(str),
       outputError: (str, write) => write(str),
-      getOutHelpWidth: () =>
-        process.stdout.isTTY ? process.stdout.columns : undefined,
+      getOutHelpWidth: () => undefined,
       getErrHelpWidth: () =>
         process.stderr.isTTY ? process.stderr.columns : undefined,
killedBy: when default getOutHelpWidth then help helpWidth from stdout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 123
Received: 80

[Killed] ArrowFunction
lib/command.js:67:24
       outputError: (str, write) => write(str),
       getOutHelpWidth: () =>
         process.stdout.isTTY ? process.stdout.columns : undefined,
-      getErrHelpWidth: () =>
-        process.stderr.isTTY ? process.stderr.columns : undefined,
+      getErrHelpWidth: () => undefined,
       getOutHasColors: () =>
         useColor() ?? (process.stdout.isTTY && process.stdout.hasColors?.()),
killedBy: when default getErrHelpWidth then help error helpWidth from stderr
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 123
Received: 80

[Survived] ArrowFunction
lib/command.js:69:24
         process.stdout.isTTY ? process.stdout.columns : undefined,
       getErrHelpWidth: () =>
         process.stderr.isTTY ? process.stderr.columns : undefined,
-      getOutHasColors: () =>
-        useColor() ?? (process.stdout.isTTY && process.stdout.hasColors?.()),
+      getOutHasColors: () => undefined,
       getErrHasColors: () =>
         useColor() ?? (process.stderr.isTTY && process.stderr.hasColors?.()),

[Survived] LogicalOperator
lib/command.js:70:9
       getErrHelpWidth: () =>
         process.stderr.isTTY ? process.stderr.columns : undefined,
       getOutHasColors: () =>
-        useColor() ?? (process.stdout.isTTY && process.stdout.hasColors?.()),
+        useColor() && process.stdout.isTTY && process.stdout.hasColors?.(),
       getErrHasColors: () =>
         useColor() ?? (process.stderr.isTTY && process.stderr.hasColors?.()),

[NoCoverage] OptionalChaining
lib/command.js:70:48
       getErrHelpWidth: () =>
         process.stderr.isTTY ? process.stderr.columns : undefined,
       getOutHasColors: () =>
-        useColor() ?? (process.stdout.isTTY && process.stdout.hasColors?.()),
+        useColor() ?? (process.stdout.isTTY && process.stdout.hasColors()),
       getErrHasColors: () =>
         useColor() ?? (process.stderr.isTTY && process.stderr.hasColors?.()),

[Survived] ArrowFunction
lib/command.js:71:24
         process.stderr.isTTY ? process.stderr.columns : undefined,
       getOutHasColors: () =>
         useColor() ?? (process.stdout.isTTY && process.stdout.hasColors?.()),
-      getErrHasColors: () =>
-        useColor() ?? (process.stderr.isTTY && process.stderr.hasColors?.()),
+      getErrHasColors: () => undefined,
       stripColor: (str) => stripColor(str),
     };

[NoCoverage] OptionalChaining
lib/command.js:72:48
       getOutHasColors: () =>
         useColor() ?? (process.stdout.isTTY && process.stdout.hasColors?.()),
       getErrHasColors: () =>
-        useColor() ?? (process.stderr.isTTY && process.stderr.hasColors?.()),
+        useColor() ?? (process.stderr.isTTY && process.stderr.hasColors()),
       stripColor: (str) => stripColor(str),
     };

[Survived] LogicalOperator
lib/command.js:72:9
       getOutHasColors: () =>
         useColor() ?? (process.stdout.isTTY && process.stdout.hasColors?.()),
       getErrHasColors: () =>
-        useColor() ?? (process.stderr.isTTY && process.stderr.hasColors?.()),
+        useColor() && process.stderr.isTTY && process.stderr.hasColors?.(),
       stripColor: (str) => stripColor(str),
     };

[Killed] ArrowFunction
lib/command.js:73:19
         useColor() ?? (process.stdout.isTTY && process.stdout.hasColors?.()),
       getErrHasColors: () =>
         useColor() ?? (process.stderr.isTTY && process.stderr.hasColors?.()),
-      stripColor: (str) => stripColor(str),
+      stripColor: () => undefined,
     };
 
killedBy: Option.helpGroup when add one option with helpGroup then help contains group
statusReason: Error: expect(received).toMatch(expected)

Matcher error: received value must be a string

Received has value: undefined

[Killed] BooleanLiteral
lib/command.js:76:20
       stripColor: (str) => stripColor(str),
     };
 
-    this._hidden = false;
+    this._hidden = true;
     /** @type {(Option | null | undefined)} */
     this._helpOption = undefined; // Lazy created on demand. May be null if help option is disabled.
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

@@ -2,8 +2,7 @@

  Options:

[Killed] ConditionalExpression
lib/command.js:124:30
   _getCommandAndAncestors() {
     const result = [];
     // eslint-disable-next-line @typescript-eslint/no-this-alias
-    for (let command = this; command; command = command.parent) {
+    for (let command = this; false; command = command.parent) {
       result.push(command);
     }
killedBy: when digit option defined and option-argument is -.1 then negative not consumed
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "commander.unknownOption"
Received: ""

[Killed] BlockStatement
lib/command.js:124:65
   _getCommandAndAncestors() {
     const result = [];
     // eslint-disable-next-line @typescript-eslint/no-this-alias
-    for (let command = this; command; command = command.parent) {
-      result.push(command);
-    }
+    for (let command = this; command; command = command.parent) {}
     return result;
   }
killedBy: when digit option defined and option-argument is -.1 then negative not consumed
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "commander.unknownOption"
Received: ""

[Killed] ConditionalExpression
lib/command.js:158:9
   command(nameAndArgs, actionOptsOrExecDesc, execOpts) {
     let desc = actionOptsOrExecDesc;
     let opts = execOpts;
-    if (typeof desc === 'object' && desc !== null) {
+    if (true) {
       opts = desc;
       desc = null;
killedBy: default executable command when default subcommand and no command then call default
statusReason: Error: Command failed: node C:\projects\TCC\commander.js\.stryker-tmp\sandbox-3JgW2O\tests\fixtures\pm
Usage: pm [options] [command]

Options:
  -V, --version     output the version number
  -h, --help        display help for command

Commands:

[Killed] ConditionalExpression
lib/command.js:158:9
   command(nameAndArgs, actionOptsOrExecDesc, execOpts) {
     let desc = actionOptsOrExecDesc;
     let opts = execOpts;
-    if (typeof desc === 'object' && desc !== null) {
+    if (true && desc !== null) {
       opts = desc;
       desc = null;
killedBy: default executable command when default subcommand and no command then call default
statusReason: Error: Command failed: node C:\projects\TCC\commander.js\.stryker-tmp\sandbox-3JgW2O\tests\fixtures\pm
Usage: pm [options] [command]

Options:
  -V, --version     output the version number
  -h, --help        display help for command

Commands:

[Killed] ConditionalExpression
lib/command.js:166:9
     const [, name, args] = nameAndArgs.match(/([^ ]+) *(.*)/);
 
     const cmd = this.createCommand(name);
-    if (desc) {
+    if (false) {
       cmd.description(desc);
       cmd._executableHandler = true;
killedBy: .exitOverride and error details when executableSubcommand succeeds then call exitOverride
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
lib/command.js:166:9
     const [, name, args] = nameAndArgs.match(/([^ ]+) *(.*)/);
 
     const cmd = this.createCommand(name);
-    if (desc) {
+    if (true) {
       cmd.description(desc);
       cmd._executableHandler = true;
killedBy: .exitOverride and error details when specify command without required argument then throw CommanderError
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BooleanLiteral
lib/command.js:168:32
     const cmd = this.createCommand(name);
     if (desc) {
       cmd.description(desc);
-      cmd._executableHandler = true;
+      cmd._executableHandler = false;
     }
     if (opts.isDefault) this._defaultCommandName = cmd._name;
killedBy: .exitOverride and error details when executableSubcommand succeeds then call exitOverride
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] LogicalOperator
lib/command.js:171:22
       cmd._executableHandler = true;
     }
     if (opts.isDefault) this._defaultCommandName = cmd._name;
-    cmd._hidden = !!(opts.noHelp || opts.hidden); // noHelp is deprecated old name for hidden
+    cmd._hidden = !!(opts.noHelp && opts.hidden); // noHelp is deprecated old name for hidden
     cmd._executableFile = opts.executableFile || null; // Custom name for executable file, set missing to null to match constructor
     if (args) cmd.arguments(args);
killedBy: when command hidden then not suggested as candidate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "secret"

[Killed] BooleanLiteral
lib/command.js:171:20
       cmd._executableHandler = true;
     }
     if (opts.isDefault) this._defaultCommandName = cmd._name;
-    cmd._hidden = !!(opts.noHelp || opts.hidden); // noHelp is deprecated old name for hidden
+    cmd._hidden = !opts.noHelp || opts.hidden; // noHelp is deprecated old name for hidden
     cmd._executableFile = opts.executableFile || null; // Custom name for executable file, set missing to null to match constructor
     if (args) cmd.arguments(args);
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 2

  Usage: test [options] [command]

  Options:

[Killed] ConditionalExpression
lib/command.js:172:27
     }
     if (opts.isDefault) this._defaultCommandName = cmd._name;
     cmd._hidden = !!(opts.noHelp || opts.hidden); // noHelp is deprecated old name for hidden
-    cmd._executableFile = opts.executableFile || null; // Custom name for executable file, set missing to null to match constructor
+    cmd._executableFile = false; // Custom name for executable file, set missing to null to match constructor
     if (args) cmd.arguments(args);
     this._registerCommand(cmd);
killedBy: when commands added using .addCommand and .command then internals similar
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "_executableFile:null"
Received: "_executableFile:false"

[Killed] ConditionalExpression
lib/command.js:172:27
     }
     if (opts.isDefault) this._defaultCommandName = cmd._name;
     cmd._hidden = !!(opts.noHelp || opts.hidden); // noHelp is deprecated old name for hidden
-    cmd._executableFile = opts.executableFile || null; // Custom name for executable file, set missing to null to match constructor
+    cmd._executableFile = true; // Custom name for executable file, set missing to null to match constructor
     if (args) cmd.arguments(args);
     this._registerCommand(cmd);
killedBy: default executable command when default subcommand and no command then call default
statusReason: Error: Command failed: node C:\projects\TCC\commander.js\.stryker-tmp\sandbox-3JgW2O\tests\fixtures\pm
node:internal/errors:540
      throw error;
      ^

TypeError [ERR_INVALID_ARG_TYPE]: The "paths[1]" argument must be of type string. Received type boolean (true)

[Killed] ConditionalExpression
lib/command.js:178:9
     cmd.parent = this;
     cmd.copyInheritedSettings(this);
 
-    if (desc) return this;
+    if (false) return this;
     return cmd;
   }
killedBy: default executable command when default subcommand and no command then call default
statusReason: Error: Command failed: node C:\projects\TCC\commander.js\.stryker-tmp\sandbox-3JgW2O\tests\fixtures\pm
Usage: pm [options] [command]

Options:
  -V, --version     output the version number
  -h, --help        display help for command

Commands:

[Killed] BlockStatement
lib/command.js:215:32
    * @return {(Command | object)} `this` command for chaining, or stored configuration
    */
 
-  configureHelp(configuration) {
-    if (configuration === undefined) return this._helpConfiguration;
-
-    this._helpConfiguration = configuration;
-    return this;
-  }
+  configureHelp(configuration) {}
 
   /**
killedBy: program with passThrough when help option (without command-argument) then help called
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
lib/command.js:216:9
    */
 
   configureHelp(configuration) {
-    if (configuration === undefined) return this._helpConfiguration;
+    if (true) return this._helpConfiguration;
 
     this._helpConfiguration = configuration;
killedBy: program with passThrough when help option (without command-argument) then help called
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
lib/command.js:216:9
    */
 
   configureHelp(configuration) {
-    if (configuration === undefined) return this._helpConfiguration;
+    if (false) return this._helpConfiguration;
 
     this._helpConfiguration = configuration;
killedBy: program with passThrough when help option (without command-argument) then help called
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
lib/command.js:246:9
    */
 
   configureOutput(configuration) {
-    if (configuration === undefined) return this._outputConfiguration;
+    if (false) return this._outputConfiguration;
 
     this._outputConfiguration = Object.assign(
killedBy: when set configureOutput then get configureOutput
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 63

- Object {
+ Command {
+   "_actionHandler": null,

[Killed] BlockStatement
lib/command.js:262:42
    * @param {(boolean|string)} [displayHelp]
    * @return {Command} `this` command for chaining
    */
-  showHelpAfterError(displayHelp = true) {
-    if (typeof displayHelp !== 'string') displayHelp = !!displayHelp;
-    this._showHelpAfterError = displayHelp;
-    return this;
-  }
+  showHelpAfterError(displayHelp = true) {}
 
   /**
killedBy: showHelpAfterError with message when missing command-argument then shows help
statusReason: TypeError: Cannot read properties of undefined (reading 'configureOutput')

[Killed] BooleanLiteral
lib/command.js:262:36
    * @param {(boolean|string)} [displayHelp]
    * @return {Command} `this` command for chaining
    */
-  showHelpAfterError(displayHelp = true) {
+  showHelpAfterError(displayHelp = false) {
     if (typeof displayHelp !== 'string') displayHelp = !!displayHelp;
     this._showHelpAfterError = displayHelp;
killedBy: when showHelpAfterError() and error and then shows full help
statusReason: Error: expect(jest.fn()).toHaveBeenLastCalledWith(...expected)

Expected: "Usage: program [options]·
Options:
  -h, --help  display help for command
"
Received: "error: unknown option '--unknown-option'
"

[Killed] ConditionalExpression
lib/command.js:263:9
    * @return {Command} `this` command for chaining
    */
   showHelpAfterError(displayHelp = true) {
-    if (typeof displayHelp !== 'string') displayHelp = !!displayHelp;
+    if (true) displayHelp = !!displayHelp;
     this._showHelpAfterError = displayHelp;
     return this;
killedBy: showHelpAfterError with message when missing command-argument then shows help
statusReason: Error: expect(jest.fn()).toHaveBeenLastCalledWith(...expected)

Expected: "See --help
"
Received
       2: "
"
->     3: "Usage: program [options] <file>·

[Killed] BooleanLiteral
lib/command.js:263:56
    * @return {Command} `this` command for chaining
    */
   showHelpAfterError(displayHelp = true) {
-    if (typeof displayHelp !== 'string') displayHelp = !!displayHelp;
+    if (typeof displayHelp !== 'string') displayHelp = !displayHelp;
     this._showHelpAfterError = displayHelp;
     return this;
killedBy: when showHelpAfterError() and error and then shows full help
statusReason: Error: expect(jest.fn()).toHaveBeenLastCalledWith(...expected)

Expected: "Usage: program [options]·
Options:
  -h, --help  display help for command
"
Received: "error: unknown option '--unknown-option'
"

[Killed] BooleanLiteral
lib/command.js:274:48
    * @param {boolean} [displaySuggestion]
    * @return {Command} `this` command for chaining
    */
-  showSuggestionAfterError(displaySuggestion = true) {
+  showSuggestionAfterError(displaySuggestion = false) {
     this._showSuggestionAfterError = !!displaySuggestion;
     return this;
killedBy: when cli of a and commands ["ab"] then suggest ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: null

[Killed] BlockStatement
lib/command.js:274:54
    * @param {boolean} [displaySuggestion]
    * @return {Command} `this` command for chaining
    */
-  showSuggestionAfterError(displaySuggestion = true) {
-    this._showSuggestionAfterError = !!displaySuggestion;
-    return this;
-  }
+  showSuggestionAfterError(displaySuggestion = true) {}
 
   /**
killedBy: when cli of yyy and commands ["zzz"] then suggest null because none similar
statusReason: TypeError: Cannot read properties of undefined (reading 'exitOverride')

[Killed] BooleanLiteral
lib/command.js:275:39
    * @return {Command} `this` command for chaining
    */
   showSuggestionAfterError(displaySuggestion = true) {
-    this._showSuggestionAfterError = !!displaySuggestion;
+    this._showSuggestionAfterError = !displaySuggestion;
     return this;
   }
killedBy: when cli of a and commands ["ab"] then suggest ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: null

[Killed] ConditionalExpression
lib/command.js:290:9
    */
 
   addCommand(cmd, opts) {
-    if (!cmd._name) {
+    if (true) {
       throw new Error(`Command passed to .addCommand() must have a name
 - specify the name in Command constructor or using .name()`);
killedBy: when .addCommand name conflicts with existing name then throw
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "cannot add command"
Received message:   "Command passed to .addCommand() must have a name
- specify the name in Command constructor or using .name()"

      405 |         } else {
      406 |           stryCov_9fa48("182");

[Killed] BlockStatement
lib/command.js:290:21
    */
 
   addCommand(cmd, opts) {
-    if (!cmd._name) {
-      throw new Error(`Command passed to .addCommand() must have a name
-- specify the name in Command constructor or using .name()`);
-    }
+    if (!cmd._name) {}
 
     opts = opts || {};
killedBy: when command without name passed to .addCommand then throw
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Survived] ConditionalExpression
lib/command.js:296:9
     }
 
     opts = opts || {};
-    if (opts.isDefault) this._defaultCommandName = cmd._name;
+    if (true) this._defaultCommandName = cmd._name;
     if (opts.noHelp || opts.hidden) cmd._hidden = true; // modifying passed command due to existing implementation
 

[Killed] BooleanLiteral
lib/command.js:297:51
 
     opts = opts || {};
     if (opts.isDefault) this._defaultCommandName = cmd._name;
-    if (opts.noHelp || opts.hidden) cmd._hidden = true; // modifying passed command due to existing implementation
+    if (opts.noHelp || opts.hidden) cmd._hidden = false; // modifying passed command due to existing implementation
 
     this._registerCommand(cmd);
killedBy: when addCommand with hidden:true then not displayed in helpInformation
statusReason: Error: expect(received).not.toMatch(expected)

Expected substring: not "secret"
Received string:        "Usage:  [options] [command]

Options:
  -h, --help      display help for command

[Killed] ConditionalExpression
lib/command.js:297:9
 
     opts = opts || {};
     if (opts.isDefault) this._defaultCommandName = cmd._name;
-    if (opts.noHelp || opts.hidden) cmd._hidden = true; // modifying passed command due to existing implementation
+    if (false) cmd._hidden = true; // modifying passed command due to existing implementation
 
     this._registerCommand(cmd);
killedBy: when addCommand with hidden:true then not displayed in helpInformation
statusReason: Error: expect(received).not.toMatch(expected)

Expected substring: not "secret"
Received string:        "Usage:  [options] [command]

Options:
  -h, --help      display help for command

[Killed] BlockStatement
lib/command.js:339:41
    */
   argument(name, description, parseArg, defaultValue) {
     const argument = this.createArgument(name, description);
-    if (typeof parseArg === 'function') {
-      argument.default(defaultValue).argParser(parseArg);
-    } else {
+    if (typeof parseArg === 'function') {} else {
       argument.default(parseArg);
     }
killedBy: .exitOverride and error details when custom processing for argument throws InvalidArgumentError then catch CommanderError
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: CommanderError

Received value has no prototype
Received value: undefined

[Killed] ConditionalExpression
lib/command.js:339:9
    */
   argument(name, description, parseArg, defaultValue) {
     const argument = this.createArgument(name, description);
-    if (typeof parseArg === 'function') {
+    if (true) {
       argument.default(defaultValue).argParser(parseArg);
     } else {
killedBy: when argument described with default then included in helpInformation
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Arguments:\n +file +input source \(default: "test.txt"\)/
Received string:  "Usage:  [file]·
Arguments:
  file  input source
"

[Killed] BlockStatement
lib/command.js:341:12
     const argument = this.createArgument(name, description);
     if (typeof parseArg === 'function') {
       argument.default(defaultValue).argParser(parseArg);
-    } else {
-      argument.default(parseArg);
-    }
+    } else {}
     this.addArgument(argument);
     return this;
killedBy: when argument described with default then included in helpInformation
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Arguments:\n +file +input source \(default: "test.txt"\)/
Received string:  "Usage:  [file]·
Arguments:
  file  input source
"

[Survived] MethodExpression
lib/command.js:361:5
    */
 
   arguments(names) {
-    names
-      .trim()
+    names
       .split(/ +/)
       .forEach((detail) => {
