[Killed] BlockStatement
lib/command.js:562:43
       // The .action callback takes an extra parameter which is the command or options.
       const expectedArgsCount = this.registeredArguments.length;
       const actionArgs = args.slice(0, expectedArgsCount);
-      if (this._storeOptionsAsProperties) {
-        actionArgs[expectedArgsCount] = this; // backwards compatible "options"
-      } else {
+      if (this._storeOptionsAsProperties) {} else {
         actionArgs[expectedArgsCount] = this.opts();
       }
killedBy: when storeOptionsAsProperties() then command+command passed to action
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "value",

[Killed] ConditionalExpression
lib/command.js:562:11
       // The .action callback takes an extra parameter which is the command or options.
       const expectedArgsCount = this.registeredArguments.length;
       const actionArgs = args.slice(0, expectedArgsCount);
-      if (this._storeOptionsAsProperties) {
+      if (false) {
         actionArgs[expectedArgsCount] = this; // backwards compatible "options"
       } else {
killedBy: when storeOptionsAsProperties() then command+command passed to action
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "value",
- Command {
-   "_actionHandler": [Function listener],

[Killed] BlockStatement
lib/command.js:564:14
       const actionArgs = args.slice(0, expectedArgsCount);
       if (this._storeOptionsAsProperties) {
         actionArgs[expectedArgsCount] = this; // backwards compatible "options"
-      } else {
-        actionArgs[expectedArgsCount] = this.opts();
-      }
+      } else {}
       actionArgs.push(this);
 
killedBy: command with conflicting options should call action if there are no explicit conflicting options set
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
+ Command {
+   "_actionHandler": [Function listener],

[Killed] BlockStatement
lib/command.js:600:66
    * @private
    */
 
-  _callParseArg(target, value, previous, invalidArgumentMessage) {
-    try {
-      return target.parseArg(value, previous);
-    } catch (err) {
-      if (err.code === 'commander.invalidArgument') {
-        const message = `${invalidArgumentMessage} ${err.message}`;
-        this.error(message, { exitCode: err.exitCode, code: err.code });
-      }
-      throw err;
-    }
-  }
+  _callParseArg(target, value, previous, invalidArgumentMessage) {}
 
   /**
killedBy: when argument specified then callback called with value
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "1", undefined

Number of calls: 0

[Killed] BlockStatement
lib/command.js:601:9
    */
 
   _callParseArg(target, value, previous, invalidArgumentMessage) {
-    try {
-      return target.parseArg(value, previous);
-    } catch (err) {
+    try {} catch (err) {
       if (err.code === 'commander.invalidArgument') {
         const message = `${invalidArgumentMessage} ${err.message}`;
killedBy: .exitOverride and error details when option argument not in choices then throw CommanderError
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: CommanderError

Received value has no prototype
Received value: undefined

[Killed] BlockStatement
lib/command.js:603:19
   _callParseArg(target, value, previous, invalidArgumentMessage) {
     try {
       return target.parseArg(value, previous);
-    } catch (err) {
-      if (err.code === 'commander.invalidArgument') {
-        const message = `${invalidArgumentMessage} ${err.message}`;
-        this.error(message, { exitCode: err.exitCode, code: err.code });
-      }
-      throw err;
-    }
+    } catch (err) {}
   }
 
killedBy: .exitOverride and error details when option argument not in choices then throw CommanderError
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: CommanderError

Received value has no prototype
Received value: undefined

[Killed] ConditionalExpression
lib/command.js:604:11
     try {
       return target.parseArg(value, previous);
     } catch (err) {
-      if (err.code === 'commander.invalidArgument') {
+      if (true) {
         const message = `${invalidArgumentMessage} ${err.message}`;
         this.error(message, { exitCode: err.exitCode, code: err.code });
killedBy: when custom processing for argument throws plain error then not CommanderError caught
statusReason: Error: expect(received).not.toBeInstanceOf(expected)

Expected constructor: not CommanderError

[Killed] EqualityOperator
lib/command.js:604:11
     try {
       return target.parseArg(value, previous);
     } catch (err) {
-      if (err.code === 'commander.invalidArgument') {
+      if (err.code !== 'commander.invalidArgument') {
         const message = `${invalidArgumentMessage} ${err.message}`;
         this.error(message, { exitCode: err.exitCode, code: err.code });
killedBy: .exitOverride and error details when option argument not in choices then throw CommanderError
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "error: option '--colour <shade>' argument 'green' is invalid. Allowed choices are red, blue."
Received: "Allowed choices are red, blue."

[Killed] StringLiteral
lib/command.js:605:25
       return target.parseArg(value, previous);
     } catch (err) {
       if (err.code === 'commander.invalidArgument') {
-        const message = `${invalidArgumentMessage} ${err.message}`;
+        const message = ``;
         this.error(message, { exitCode: err.exitCode, code: err.code });
       }
killedBy: .exitOverride and error details when option argument not in choices then throw CommanderError
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "error: option '--colour <shade>' argument 'green' is invalid. Allowed choices are red, blue."
Received: ""

[Killed] ObjectLiteral
lib/command.js:606:29
     } catch (err) {
       if (err.code === 'commander.invalidArgument') {
         const message = `${invalidArgumentMessage} ${err.message}`;
-        this.error(message, { exitCode: err.exitCode, code: err.code });
+        this.error(message, {});
       }
       throw err;
killedBy: .exitOverride and error details when option argument not in choices then throw CommanderError
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "commander.invalidArgument"
Received: "commander.error"

[Killed] ConditionalExpression
lib/command.js:622:7
 
   _registerOption(option) {
     const matchingOption =
-      (option.short && this._findOption(option.short)) ||
-      (option.long && this._findOption(option.long));
+      false;
     if (matchingOption) {
       const matchingFlag =
killedBy: .option() when short option flag conflicts then throws
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cannot add option"

Received function did not throw

[Killed] ConditionalExpression
lib/command.js:622:8
 
   _registerOption(option) {
     const matchingOption =
-      (option.short && this._findOption(option.short)) ||
+      (false) ||
       (option.long && this._findOption(option.long));
     if (matchingOption) {
killedBy: .option() when short option flag conflicts then throws
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cannot add option"

Received function did not throw

[Killed] ConditionalExpression
lib/command.js:623:8
   _registerOption(option) {
     const matchingOption =
       (option.short && this._findOption(option.short)) ||
-      (option.long && this._findOption(option.long));
+      (false);
     if (matchingOption) {
       const matchingFlag =
killedBy: .option() when long option flag conflicts then throws
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cannot add option"

Received function did not throw

[Killed] BlockStatement
lib/command.js:624:25
     const matchingOption =
       (option.short && this._findOption(option.short)) ||
       (option.long && this._findOption(option.long));
-    if (matchingOption) {
-      const matchingFlag =
-        option.long && this._findOption(option.long)
-          ? option.long
-          : option.short;
-      throw new Error(`Cannot add option '${option.flags}'${this._name && ` to command '${this._name}'`} due to conflicting flag '${matchingFlag}'
--  already used by option '${matchingOption.flags}'`);
-    }
+    if (matchingOption) {}
 
     this._initOptionGroup(option);
killedBy: .option() when short option flag conflicts then throws
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cannot add option"

Received function did not throw

[Killed] ConditionalExpression
lib/command.js:624:9
     const matchingOption =
       (option.short && this._findOption(option.short)) ||
       (option.long && this._findOption(option.long));
-    if (matchingOption) {
+    if (false) {
       const matchingFlag =
         option.long && this._findOption(option.long)
killedBy: .option() when short option flag conflicts then throws
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cannot add option"

Received function did not throw

[Survived] ConditionalExpression
lib/command.js:626:9
       (option.long && this._findOption(option.long));
     if (matchingOption) {
       const matchingFlag =
-        option.long && this._findOption(option.long)
+        false
           ? option.long
           : option.short;

[Survived] LogicalOperator
lib/command.js:626:9
       (option.long && this._findOption(option.long));
     if (matchingOption) {
       const matchingFlag =
-        option.long && this._findOption(option.long)
+        option.long || this._findOption(option.long)
           ? option.long
           : option.short;

[Survived] ConditionalExpression
lib/command.js:629:61
         option.long && this._findOption(option.long)
           ? option.long
           : option.short;
-      throw new Error(`Cannot add option '${option.flags}'${this._name && ` to command '${this._name}'`} due to conflicting flag '${matchingFlag}'
+      throw new Error(`Cannot add option '${option.flags}'${true} due to conflicting flag '${matchingFlag}'
 -  already used by option '${matchingOption.flags}'`);
     }

[Survived] ConditionalExpression
lib/command.js:629:61
         option.long && this._findOption(option.long)
           ? option.long
           : option.short;
-      throw new Error(`Cannot add option '${option.flags}'${this._name && ` to command '${this._name}'`} due to conflicting flag '${matchingFlag}'
+      throw new Error(`Cannot add option '${option.flags}'${false} due to conflicting flag '${matchingFlag}'
 -  already used by option '${matchingOption.flags}'`);
     }

[Killed] ArrayDeclaration
lib/command.js:647:14
 
   _registerCommand(command) {
     const knownBy = (cmd) => {
-      return [cmd.name()].concat(cmd.aliases());
+      return [].concat(cmd.aliases());
     };
 
killedBy: when command name conflicts with existing name then throw
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "cannot add command"

Received function did not throw

[Killed] ArrowFunction
lib/command.js:650:47
       return [cmd.name()].concat(cmd.aliases());
     };
 
-    const alreadyUsed = knownBy(command).find((name) =>
-      this._findCommand(name),
+    const alreadyUsed = knownBy(command).find(() => undefined,
     );
     if (alreadyUsed) {
killedBy: when command name conflicts with existing name then throw
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "cannot add command"

Received function did not throw

[Killed] ConditionalExpression
lib/command.js:653:9
     const alreadyUsed = knownBy(command).find((name) =>
       this._findCommand(name),
     );
-    if (alreadyUsed) {
+    if (false) {
       const existingCmd = knownBy(this._findCommand(alreadyUsed)).join('|');
       const newCmd = knownBy(command).join('|');
killedBy: when command name conflicts with existing name then throw
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "cannot add command"

Received function did not throw

[Killed] BlockStatement
lib/command.js:653:22
     const alreadyUsed = knownBy(command).find((name) =>
       this._findCommand(name),
     );
-    if (alreadyUsed) {
-      const existingCmd = knownBy(this._findCommand(alreadyUsed)).join('|');
-      const newCmd = knownBy(command).join('|');
-      throw new Error(
-        `cannot add command '${newCmd}' as already have command '${existingCmd}'`,
-      );
-    }
+    if (alreadyUsed) {}
 
     this._initCommandGroup(command);
killedBy: when command name conflicts with existing name then throw
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "cannot add command"

Received function did not throw

[Survived] StringLiteral
lib/command.js:655:44
     );
     if (alreadyUsed) {
       const existingCmd = knownBy(this._findCommand(alreadyUsed)).join('|');
-      const newCmd = knownBy(command).join('|');
+      const newCmd = knownBy(command).join("");
       throw new Error(
         `cannot add command '${newCmd}' as already have command '${existingCmd}'`,

[Killed] StringLiteral
lib/command.js:657:9
       const existingCmd = knownBy(this._findCommand(alreadyUsed)).join('|');
       const newCmd = knownBy(command).join('|');
       throw new Error(
-        `cannot add command '${newCmd}' as already have command '${existingCmd}'`,
+        ``,
       );
     }
killedBy: when command name conflicts with existing name then throw
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "cannot add command"
Received message:   ""

      952 |           const existingCmd = knownBy(this._findCommand(alreadyUsed)).join(stryMutAct_9fa48("350") ? "" : (stryCov_9fa48("350"), '|'));
      953 |           const newCmd = knownBy(command).join(stryMutAct_9fa48("351") ? "" : (stryCov_9fa48("351"), '|'));
    > 954 |           th

[Killed] ConditionalExpression
lib/command.js:678:9
     const name = option.attributeName();
 
     // store default value
-    if (option.negate) {
+    if (true) {
       // --no-foo is special and defaults foo to true, unless a --foo option is already defined
       const positiveLongFlag = option.long.replace(/^--no-/, '--');
killedBy: when digit option defined and option-argument is -.1 then negative not consumed
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] BlockStatement
lib/command.js:678:24
     const name = option.attributeName();
 
     // store default value
-    if (option.negate) {
-      // --no-foo is special and defaults foo to true, unless a --foo option is already defined
-      const positiveLongFlag = option.long.replace(/^--no-/, '--');
-      if (!this._findOption(positiveLongFlag)) {
-        this.setOptionValueWithSource(
-          name,
-          option.defaultValue === undefined ? true : option.defaultValue,
-          'default',
-        );
-      }
-    } else if (option.defaultValue !== undefined) {
+    if (option.negate) {} else if (option.defaultValue !== undefined) {
       this.setOptionValueWithSource(name, option.defaultValue, 'default');
     }
killedBy: .parse() called multiple times when use negated options then option values reset
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Object {
-   "bar": true,
    "foo": false,

[Survived] Regex
lib/command.js:680:52
     // store default value
     if (option.negate) {
       // --no-foo is special and defaults foo to true, unless a --foo option is already defined
-      const positiveLongFlag = option.long.replace(/^--no-/, '--');
+      const positiveLongFlag = option.long.replace(/--no-/, '--');
       if (!this._findOption(positiveLongFlag)) {
         this.setOptionValueWithSource(

[Killed] BooleanLiteral
lib/command.js:681:11
     if (option.negate) {
       // --no-foo is special and defaults foo to true, unless a --foo option is already defined
       const positiveLongFlag = option.long.replace(/^--no-/, '--');
-      if (!this._findOption(positiveLongFlag)) {
+      if (this._findOption(positiveLongFlag)) {
         this.setOptionValueWithSource(
           name,
killedBy: boolean option combo with no default when boolean combo not specified then value is undefined
statusReason: Error: expect(received).toBeUndefined()

Received: true

[Killed] ConditionalExpression
lib/command.js:681:11
     if (option.negate) {
       // --no-foo is special and defaults foo to true, unless a --foo option is already defined
       const positiveLongFlag = option.long.replace(/^--no-/, '--');
-      if (!this._findOption(positiveLongFlag)) {
+      if (true) {
         this.setOptionValueWithSource(
           name,
killedBy: boolean flag and negatable when env undefined and no cli then option undefined
statusReason: Error: expect(received).toBeUndefined()

Received: true

[Killed] EqualityOperator
lib/command.js:684:11
       if (!this._findOption(positiveLongFlag)) {
         this.setOptionValueWithSource(
           name,
-          option.defaultValue === undefined ? true : option.defaultValue,
+          option.defaultValue !== undefined ? true : option.defaultValue,
           'default',
         );
killedBy: boolean no-flag when env undefined and no cli then option true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
lib/command.js:684:11
       if (!this._findOption(positiveLongFlag)) {
         this.setOptionValueWithSource(
           name,
-          option.defaultValue === undefined ? true : option.defaultValue,
+          false ? true : option.defaultValue,
           'default',
         );
killedBy: boolean no-flag when env undefined and no cli then option true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
lib/command.js:688:16
           'default',
         );
       }
-    } else if (option.defaultValue !== undefined) {
+    } else if (option.defaultValue === undefined) {
       this.setOptionValueWithSource(name, option.defaultValue, 'default');
     }
killedBy: command with conflicting options should allow default value with a conflicting option
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "debug": true,
+   "json": undefined,

[Killed] ConditionalExpression
lib/command.js:688:16
           'default',
         );
       }
-    } else if (option.defaultValue !== undefined) {
+    } else if (false) {
       this.setOptionValueWithSource(name, option.defaultValue, 'default');
     }
killedBy: command with conflicting options should allow default value with a conflicting option
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "debug": true,
    "silent": true,

[Killed] StringLiteral
lib/command.js:689:64
         );
       }
     } else if (option.defaultValue !== undefined) {
-      this.setOptionValueWithSource(name, option.defaultValue, 'default');
+      this.setOptionValueWithSource(name, option.defaultValue, "");
     }
 
killedBy: .parse() called multiple times when use options with option-argument and default then option values and sources reset
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "default"
Received: ""

[Killed] EqualityOperator
lib/command.js:696:11
     const handleOptionValue = (val, invalidValueMessage, valueSource) => {
       // val is null for optional option used without an optional-argument.
       // val is undefined for boolean and negated option.
-      if (val == null && option.presetArg !== undefined) {
+      if (val != null && option.presetArg !== undefined) {
         val = option.presetArg;
       }
killedBy: command with conflicting options should report correct error for negated option with preset when negated is configured
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "error: option '--no-dual2' cannot be used with option '--red'"
Received message:   "error: option '--dual2 <str>' cannot be used with option '--red'"

      769 |         } else {
      770 |           stryCov_9fa48("305");
    > 771 |           this._exitCallback(new CommanderError(exitCode, code, message));

[Killed] ConditionalExpression
lib/command.js:696:26
     const handleOptionValue = (val, invalidValueMessage, valueSource) => {
       // val is null for optional option used without an optional-argument.
       // val is undefined for boolean and negated option.
-      if (val == null && option.presetArg !== undefined) {
+      if (val == null && true) {
         val = option.presetArg;
       }
killedBy: variadic option with optional value when variadic used as boolean flag then value true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: [undefined]

[Killed] ConditionalExpression
lib/command.js:702:11
 
       // custom processing
       const oldValue = this.getOptionValue(name);
-      if (val !== null && option.parseArg) {
+      if (false) {
         val = this._callParseArg(option, val, oldValue, invalidValueMessage);
       } else if (val !== null && option.variadic) {
killedBy: variadic option with required value when variadic with coercion then coercion sets value
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1000
Received: ["1e2", "1e3"]

[Killed] LogicalOperator
lib/command.js:702:11
 
       // custom processing
       const oldValue = this.getOptionValue(name);
-      if (val !== null && option.parseArg) {
+      if (val !== null || option.parseArg) {
         val = this._callParseArg(option, val, oldValue, invalidValueMessage);
       } else if (val !== null && option.variadic) {
killedBy: when boolean option with string preset used then value is preset
statusReason: TypeError: target.parseArg is not a function

[Killed] EqualityOperator
lib/command.js:704:18
       const oldValue = this.getOptionValue(name);
       if (val !== null && option.parseArg) {
         val = this._callParseArg(option, val, oldValue, invalidValueMessage);
-      } else if (val !== null && option.variadic) {
+      } else if (val === null && option.variadic) {
         val = option._concatValue(val, oldValue);
       }
killedBy: when optional with preset and variadic used then preset is concatenated
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["one", "two", "three"]
Received: "three"

[Killed] ConditionalExpression
lib/command.js:704:18
       const oldValue = this.getOptionValue(name);
       if (val !== null && option.parseArg) {
         val = this._callParseArg(option, val, oldValue, invalidValueMessage);
-      } else if (val !== null && option.variadic) {
+      } else if (false) {
         val = option._concatValue(val, oldValue);
       }
killedBy: .parse() called multiple times when use variadic option then option values reset
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

  Object {
-   "var": Array [
-     "a",

[Killed] ConditionalExpression
lib/command.js:709:11
       }
 
       // Fill-in appropriate missing values. Long winded but easy to follow.
-      if (val == null) {
+      if (true) {
         if (option.negate) {
           val = false;
killedBy: .parse() called multiple times when use options with option-argument then option values and sources reset
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "foo": "FOO",
+   "foo": "",

[Killed] BlockStatement
lib/command.js:710:28
 
       // Fill-in appropriate missing values. Long winded but easy to follow.
       if (val == null) {
-        if (option.negate) {
-          val = false;
-        } else if (option.isBoolean() || option.optional) {
+        if (option.negate) {} else if (option.isBoolean() || option.optional) {
           val = true;
         } else {
killedBy: boolean no-flag when env defined and no cli then option false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] ConditionalExpression
lib/command.js:710:13
 
       // Fill-in appropriate missing values. Long winded but easy to follow.
       if (val == null) {
-        if (option.negate) {
+        if (false) {
           val = false;
         } else if (option.isBoolean() || option.optional) {
killedBy: when imply from negative option then negative implied
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "foo": false,
-   "implied": "NEGATIVE",

[Killed] BooleanLiteral
lib/command.js:711:17
       // Fill-in appropriate missing values. Long winded but easy to follow.
       if (val == null) {
         if (option.negate) {
-          val = false;
+          val = true;
         } else if (option.isBoolean() || option.optional) {
           val = true;
killedBy: boolean no-flag when env defined and no cli then option false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
lib/command.js:712:20
       if (val == null) {
         if (option.negate) {
           val = false;
-        } else if (option.isBoolean() || option.optional) {
+        } else if (false) {
           val = true;
         } else {
killedBy: command with conflicting options should call action if there are no explicit conflicting options set
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "json": true,
+   "json": "",

[Killed] LogicalOperator
lib/command.js:712:20
       if (val == null) {
         if (option.negate) {
           val = false;
-        } else if (option.isBoolean() || option.optional) {
+        } else if (option.isBoolean() && option.optional) {
           val = true;
         } else {
killedBy: when option-argument for short optional is -1e-3.0 then consumed=false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: ""

[Killed] BooleanLiteral
lib/command.js:713:17
         if (option.negate) {
           val = false;
         } else if (option.isBoolean() || option.optional) {
-          val = true;
+          val = false;
         } else {
           val = ''; // not normal, parseArg might have failed or be a mock function for testing
killedBy: when option-argument for short optional is -1e-3.0 then consumed=false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
lib/command.js:714:16
           val = false;
         } else if (option.isBoolean() || option.optional) {
           val = true;
-        } else {
-          val = ''; // not normal, parseArg might have failed or be a mock function for testing
-        }
+        } else {}
       }
       this.setOptionValueWithSource(name, val, valueSource);
killedBy: env only processed when applies when env and cli defined then only parse value for cli
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] StringLiteral
lib/command.js:722:35
     };
 
     this.on('option:' + oname, (val) => {
-      const invalidValueMessage = `error: option '${option.flags}' argument '${val}' is invalid.`;
+      const invalidValueMessage = ``;
       handleOptionValue(val, invalidValueMessage, 'cli');
     });
killedBy: .exitOverride and error details when option argument not in choices then throw CommanderError
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "error: option '--colour <shade>' argument 'green' is invalid. Allowed choices are red, blue."
Received: " Allowed choices are red, blue."

[Killed] ConditionalExpression
lib/command.js:726:9
       handleOptionValue(val, invalidValueMessage, 'cli');
     });
 
-    if (option.envVar) {
+    if (false) {
       this.on('optionEnv:' + oname, (val) => {
         const invalidValueMessage = `error: option '${option.flags}' value '${val}' from env '${option.envVar}' is invalid.`;
killedBy: command with conflicting options should report the env variable as the conflicting option source, when conflicting option is set
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "error: option '-j, --json' cannot be used with environment variable 'SILENT'"

Received function did not throw

[Killed] BlockStatement
lib/command.js:726:24
       handleOptionValue(val, invalidValueMessage, 'cli');
     });
 
-    if (option.envVar) {
-      this.on('optionEnv:' + oname, (val) => {
-        const invalidValueMessage = `error: option '${option.flags}' value '${val}' from env '${option.envVar}' is invalid.`;
-        handleOptionValue(val, invalidValueMessage, 'env');
-      });
-    }
+    if (option.envVar) {}
 
     return this;
killedBy: command with conflicting options should report the env variable as the conflicting option source, when conflicting option is set
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "error: option '-j, --json' cannot be used with environment variable 'SILENT'"

Received function did not throw
