[Killed] BlockStatement
lib/command.js:727:46
     });
 
     if (option.envVar) {
-      this.on('optionEnv:' + oname, (val) => {
-        const invalidValueMessage = `error: option '${option.flags}' value '${val}' from env '${option.envVar}' is invalid.`;
-        handleOptionValue(val, invalidValueMessage, 'env');
-      });
+      this.on('optionEnv:' + oname, (val) => {});
     }
 
killedBy: command with conflicting options should report the env variable as the conflicting option source, when conflicting option is set
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "error: option '-j, --json' cannot be used with environment variable 'SILENT'"

Received function did not throw

[Survived] StringLiteral
lib/command.js:728:37
 
     if (option.envVar) {
       this.on('optionEnv:' + oname, (val) => {
-        const invalidValueMessage = `error: option '${option.flags}' value '${val}' from env '${option.envVar}' is invalid.`;
+        const invalidValueMessage = ``;
         handleOptionValue(val, invalidValueMessage, 'env');
       });

[Killed] ConditionalExpression
lib/command.js:743:9
    * @private
    */
   _optionEx(config, flags, description, fn, defaultValue) {
-    if (typeof flags === 'object' && flags instanceof Option) {
+    if (false) {
       throw new Error(
         'To add an Option object use addOption() instead of option() or requiredOption()',
killedBy: when pass Option to .option() then throw
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "To add an Option object use addOption() instead of option() or requiredOption()"
Received message:   "flags.includes is not a function"

      64 |       this.flags = flags;
      65 |       this.description = stryMutAct_9fa48("2069") ? description && '' : stryMutAct_9fa48("2068") ? false : stryMutAct_9fa48("2067") ? true : (stryCov_9

[Killed] EqualityOperator
lib/command.js:743:9
    * @private
    */
   _optionEx(config, flags, description, fn, defaultValue) {
-    if (typeof flags === 'object' && flags instanceof Option) {
+    if (typeof flags !== 'object' && flags instanceof Option) {
       throw new Error(
         'To add an Option object use addOption() instead of option() or requiredOption()',
killedBy: when pass Option to .option() then throw
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "To add an Option object use addOption() instead of option() or requiredOption()"
Received message:   "flags.includes is not a function"

      64 |       this.flags = flags;
      65 |       this.description = stryMutAct_9fa48("2069") ? description && '' : stryMutAct_9fa48("2068") ? false : stryMutAct_9fa48("2067") ? true : (stryCov_9

[Killed] BlockStatement
lib/command.js:750:35
     }
     const option = this.createOption(flags, description);
     option.makeOptionMandatory(!!config.mandatory);
-    if (typeof fn === 'function') {
-      option.default(defaultValue).argParser(fn);
-    } else if (fn instanceof RegExp) {
+    if (typeof fn === 'function') {} else if (fn instanceof RegExp) {
       // deprecated
       const regex = fn;
killedBy: variadic option with required value when variadic with coercion then coercion sets value
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1000
Received: ["1e2", "1e3"]

[Killed] ConditionalExpression
lib/command.js:750:9
     }
     const option = this.createOption(flags, description);
     option.makeOptionMandatory(!!config.mandatory);
-    if (typeof fn === 'function') {
+    if (true) {
       option.default(defaultValue).argParser(fn);
     } else if (fn instanceof RegExp) {
killedBy: .parse() called multiple times when use options with option-argument and default then option values and sources reset
statusReason: TypeError: target.parseArg is not a function

[Killed] ConditionalExpression
lib/command.js:752:16
     option.makeOptionMandatory(!!config.mandatory);
     if (typeof fn === 'function') {
       option.default(defaultValue).argParser(fn);
-    } else if (fn instanceof RegExp) {
+    } else if (true) {
       // deprecated
       const regex = fn;
killedBy: when option-argument for short optional is -.1 then consumed=true
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ""
Received: undefined

[Killed] ConditionalExpression
lib/command.js:752:16
     option.makeOptionMandatory(!!config.mandatory);
     if (typeof fn === 'function') {
       option.default(defaultValue).argParser(fn);
-    } else if (fn instanceof RegExp) {
+    } else if (false) {
       // deprecated
       const regex = fn;
killedBy: option with regular expression instead of custom processing function when option not given then value is default
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "mild"
Received: /mild|tasty/

[Killed] BlockStatement
lib/command.js:755:26
     } else if (fn instanceof RegExp) {
       // deprecated
       const regex = fn;
-      fn = (val, def) => {
-        const m = regex.exec(val);
-        return m ? m[0] : def;
-      };
+      fn = (val, def) => {};
       option.default(defaultValue).argParser(fn);
     } else {
killedBy: option with regular expression instead of custom processing function when argument matches regexp then value is as specified
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "tasty"
Received: ""

[Killed] BlockStatement
lib/command.js:760:12
         return m ? m[0] : def;
       };
       option.default(defaultValue).argParser(fn);
-    } else {
-      option.default(fn);
-    }
+    } else {}
 
     return this.addOption(option);
killedBy: .parse() called multiple times when use options with option-argument and default then option values and sources reset
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Object {
-   "bar": "default-BAR",
    "foo": "FOO",

[Killed] BlockStatement
lib/command.js:806:62
    * @return {Command} `this` command for chaining
    */
 
-  requiredOption(flags, description, parseArg, defaultValue) {
-    return this._optionEx(
-      { mandatory: true },
-      flags,
-      description,
-      parseArg,
-      defaultValue,
-    );
-  }
+  requiredOption(flags, description, parseArg, defaultValue) {}
 
   /**
killedBy: showHelpAfterError with message when missing mandatory option then shows help
statusReason: TypeError: Cannot read properties of undefined (reading 'code')

[Killed] BooleanLiteral
lib/command.js:808:20
 
   requiredOption(flags, description, parseArg, defaultValue) {
     return this._optionEx(
-      { mandatory: true },
+      { mandatory: false },
       flags,
       description,
killedBy: .exitOverride and error details when mandatory program option missing then throw CommanderError
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: CommanderError

Received value has no prototype
Received value: undefined

[Killed] BlockStatement
lib/command.js:827:47
    * @param {boolean} [combine] - if `true` or omitted, an optional value can be specified directly after the flag.
    * @return {Command} `this` command for chaining
    */
-  combineFlagAndOptionalValue(combine = true) {
-    this._combineFlagAndOptionalValue = !!combine;
-    return this;
-  }
+  combineFlagAndOptionalValue(combine = true) {}
 
   /**
killedBy: copyInheritedSettings property tests when copyInheritedSettings then copies combineFlagAndOptionalValue()
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] BooleanLiteral
lib/command.js:827:41
    * @param {boolean} [combine] - if `true` or omitted, an optional value can be specified directly after the flag.
    * @return {Command} `this` command for chaining
    */
-  combineFlagAndOptionalValue(combine = true) {
+  combineFlagAndOptionalValue(combine = false) {
     this._combineFlagAndOptionalValue = !!combine;
     return this;
killedBy: Utility Conventions when program has combo optional and combineFlagAndOptionalValue() then treat as value
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 2

  Object {
-   "ddd": "b",
+   "bbb": true,

[Killed] BooleanLiteral
lib/command.js:828:42
    * @return {Command} `this` command for chaining
    */
   combineFlagAndOptionalValue(combine = true) {
-    this._combineFlagAndOptionalValue = !!combine;
+    this._combineFlagAndOptionalValue = !combine;
     return this;
   }
killedBy: copyInheritedSettings property tests when copyInheritedSettings then copies combineFlagAndOptionalValue()
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] BlockStatement
lib/command.js:838:43
    * @param {boolean} [allowUnknown] - if `true` or omitted, no error will be thrown for unknown options.
    * @return {Command} `this` command for chaining
    */
-  allowUnknownOption(allowUnknown = true) {
-    this._allowUnknownOption = !!allowUnknown;
-    return this;
-  }
+  allowUnknownOption(allowUnknown = true) {}
 
   /**
killedBy: program with allowUnknownOption when passThroughOptions and unknown option then arguments from unknown passed through
statusReason: TypeError: Cannot read properties of undefined (reading 'option')

[Killed] BlockStatement
lib/command.js:849:44
    * @param {boolean} [allowExcess] - if `true` or omitted, no error will be thrown for excess arguments.
    * @return {Command} `this` command for chaining
    */
-  allowExcessArguments(allowExcess = true) {
-    this._allowExcessArguments = !!allowExcess;
-    return this;
-  }
+  allowExcessArguments(allowExcess = true) {}
 
   /**
killedBy: copyInheritedSettings property tests when copyInheritedSettings then copies allowExcessArguments()
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
lib/command.js:862:46
    * @param {boolean} [positional]
    * @return {Command} `this` command for chaining
    */
-  enablePositionalOptions(positional = true) {
-    this._enablePositionalOptions = !!positional;
-    return this;
-  }
+  enablePositionalOptions(positional = true) {}
 
   /**
killedBy: Command methods that should return this for chaining when call .enablePositionalOptions() then returns this
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: undefined

[Killed] BooleanLiteral
lib/command.js:862:40
    * @param {boolean} [positional]
    * @return {Command} `this` command for chaining
    */
-  enablePositionalOptions(positional = true) {
+  enablePositionalOptions(positional = false) {
     this._enablePositionalOptions = !!positional;
     return this;
killedBy: copyInheritedSettings property tests when copyInheritedSettings then copies enablePositionalOptions()
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BooleanLiteral
lib/command.js:863:38
    * @return {Command} `this` command for chaining
    */
   enablePositionalOptions(positional = true) {
-    this._enablePositionalOptions = !!positional;
+    this._enablePositionalOptions = !positional;
     return this;
   }
killedBy: copyInheritedSettings property tests when copyInheritedSettings then copies enablePositionalOptions()
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
lib/command.js:886:32
    * @private
    */
 
-  _checkForBrokenPassThrough() {
-    if (
-      this.parent &&
-      this._passThroughOptions &&
-      !this.parent._enablePositionalOptions
-    ) {
-      throw new Error(
-        `passThroughOptions cannot be used for '${this._name}' without turning on enablePositionalOptions for parent command(s)`,
-      );
-    }
-  }
+  _checkForBrokenPassThrough() {}
 
   /**
killedBy: broken passThrough when program not positional and turn on passThroughOptions in subcommand then error
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
lib/command.js:888:7
 
   _checkForBrokenPassThrough() {
     if (
-      this.parent &&
-      this._passThroughOptions &&
-      !this.parent._enablePositionalOptions
+      true
     ) {
       throw new Error(
killedBy: program with passThrough when option before command-argument then option parsed
statusReason: Error: passThroughOptions cannot be used for '' without turning on enablePositionalOptions for parent command(s)

[Killed] ConditionalExpression
lib/command.js:888:7
 
   _checkForBrokenPassThrough() {
     if (
-      this.parent &&
-      this._passThroughOptions &&
+      true &&
       !this.parent._enablePositionalOptions
     ) {
killedBy: program with passThrough when option before command-argument then option parsed
statusReason: TypeError: Cannot read properties of null (reading '_enablePositionalOptions')

[Killed] BooleanLiteral
lib/command.js:890:7
     if (
       this.parent &&
       this._passThroughOptions &&
-      !this.parent._enablePositionalOptions
+      this.parent._enablePositionalOptions
     ) {
       throw new Error(
killedBy: subcommand with passThrough when option before command-argument then option parsed
statusReason: Error: passThroughOptions cannot be used for 'sub' without turning on enablePositionalOptions for parent command(s)

[Killed] BlockStatement
lib/command.js:891:7
       this.parent &&
       this._passThroughOptions &&
       !this.parent._enablePositionalOptions
-    ) {
-      throw new Error(
-        `passThroughOptions cannot be used for '${this._name}' without turning on enablePositionalOptions for parent command(s)`,
-      );
-    }
+    ) {}
   }
 
killedBy: broken passThrough when program not positional and turn on passThroughOptions in subcommand then error
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] BooleanLiteral
lib/command.js:906:48
    * @return {Command} `this` command for chaining
    */
 
-  storeOptionsAsProperties(storeAsProperties = true) {
+  storeOptionsAsProperties(storeAsProperties = false) {
     if (this.options.length) {
       throw new Error('call .storeOptionsAsProperties() before adding options');
killedBy: copyInheritedSettings property tests when copyInheritedSettings then copies storeOptionsAsProperties()
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
lib/command.js:906:54
    * @return {Command} `this` command for chaining
    */
 
-  storeOptionsAsProperties(storeAsProperties = true) {
-    if (this.options.length) {
-      throw new Error('call .storeOptionsAsProperties() before adding options');
-    }
-    if (Object.keys(this._optionValues).length) {
-      throw new Error(
-        'call .storeOptionsAsProperties() before setting option values',
-      );
-    }
-    this._storeOptionsAsProperties = !!storeAsProperties;
-    return this;
-  }
+  storeOptionsAsProperties(storeAsProperties = true) {}
 
   /**
killedBy: storeOptionsAsProperties is true when option specified on CLI then value returned by getOptionValue
statusReason: TypeError: Cannot read properties of undefined (reading 'option')

[Killed] ConditionalExpression
lib/command.js:907:9
    */
 
   storeOptionsAsProperties(storeAsProperties = true) {
-    if (this.options.length) {
+    if (true) {
       throw new Error('call .storeOptionsAsProperties() before adding options');
     }
killedBy: copyInheritedSettings property tests when copyInheritedSettings then copies storeOptionsAsProperties()
statusReason: Error: call .storeOptionsAsProperties() before adding options

[Survived] ConditionalExpression
lib/command.js:907:9
    */
 
   storeOptionsAsProperties(storeAsProperties = true) {
-    if (this.options.length) {
+    if (false) {
       throw new Error('call .storeOptionsAsProperties() before adding options');
     }

[Killed] ConditionalExpression
lib/command.js:910:9
     if (this.options.length) {
       throw new Error('call .storeOptionsAsProperties() before adding options');
     }
-    if (Object.keys(this._optionValues).length) {
+    if (true) {
       throw new Error(
         'call .storeOptionsAsProperties() before setting option values',
killedBy: copyInheritedSettings property tests when copyInheritedSettings then copies storeOptionsAsProperties()
statusReason: Error: call .storeOptionsAsProperties() before setting option values

[Killed] BlockStatement
lib/command.js:910:49
     if (this.options.length) {
       throw new Error('call .storeOptionsAsProperties() before adding options');
     }
-    if (Object.keys(this._optionValues).length) {
-      throw new Error(
-        'call .storeOptionsAsProperties() before setting option values',
-      );
-    }
+    if (Object.keys(this._optionValues).length) {}
     this._storeOptionsAsProperties = !!storeAsProperties;
     return this;
killedBy: when storeOptionsAsProperties() after setting option value then throw
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] BooleanLiteral
lib/command.js:915:38
         'call .storeOptionsAsProperties() before setting option values',
       );
     }
-    this._storeOptionsAsProperties = !!storeAsProperties;
+    this._storeOptionsAsProperties = !storeAsProperties;
     return this;
   }
killedBy: copyInheritedSettings property tests when copyInheritedSettings then copies storeOptionsAsProperties()
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
lib/command.js:927:41
    */
 
   getOptionValue(key) {
-    if (this._storeOptionsAsProperties) {
-      return this[key];
-    }
+    if (this._storeOptionsAsProperties) {}
     return this._optionValues[key];
   }
killedBy: storeOptionsAsProperties is true when option specified on CLI then value returned by getOptionValue
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "blue"
Received: undefined

[Killed] ConditionalExpression
lib/command.js:927:9
    */
 
   getOptionValue(key) {
-    if (this._storeOptionsAsProperties) {
+    if (false) {
       return this[key];
     }
killedBy: storeOptionsAsProperties is true when option specified on CLI then value returned by getOptionValue
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "blue"
Received: undefined

[Killed] BlockStatement
lib/command.js:941:30
    * @return {Command} `this` command for chaining
    */
 
-  setOptionValue(key, value) {
-    return this.setOptionValueWithSource(key, value, undefined);
-  }
+  setOptionValue(key, value) {}
 
   /**
killedBy: option declared as: -f, --foo <required-arg> when env defined and value source is unspecified then option unchanged
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "client"
Received: "env"

[Killed] BlockStatement
lib/command.js:955:41
    */
 
   setOptionValueWithSource(key, value, source) {
-    if (this._storeOptionsAsProperties) {
-      this[key] = value;
-    } else {
+    if (this._storeOptionsAsProperties) {} else {
       this._optionValues[key] = value;
     }
killedBy: storeOptionsAsProperties is true when option specified on CLI then value returned by getOptionValue
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "blue"
Received: undefined

[Killed] ConditionalExpression
lib/command.js:955:9
    */
 
   setOptionValueWithSource(key, value, source) {
-    if (this._storeOptionsAsProperties) {
+    if (false) {
       this[key] = value;
     } else {
killedBy: storeOptionsAsProperties is true when option specified on CLI then value returned by getOptionValue
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "blue"
Received: undefined

[Killed] BlockStatement
lib/command.js:972:29
    * @return {string}
    */
 
-  getOptionValueSource(key) {
-    return this._optionValueSources[key];
-  }
+  getOptionValueSource(key) {}
 
   /**
killedBy: when setOptionValueWithSource then source returned by getOptionValueSource
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "config"
Received: undefined

[Killed] BlockStatement
lib/command.js:984:40
    * @return {string}
    */
 
-  getOptionValueSourceWithGlobals(key) {
-    // global overwrites local, like optsWithGlobals
-    let source;
-    this._getCommandAndAncestors().forEach((cmd) => {
-      if (cmd.getOptionValueSource(key) !== undefined) {
-        source = cmd.getOptionValueSource(key);
-      }
-    });
-    return source;
-  }
+  getOptionValueSourceWithGlobals(key) {}
 
   /**
killedBy: getOptionValueSourceWithGlobals when option used with simple command then source is defined
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "cli"
Received: undefined

[Killed] BlockStatement
lib/command.js:987:53
   getOptionValueSourceWithGlobals(key) {
     // global overwrites local, like optsWithGlobals
     let source;
-    this._getCommandAndAncestors().forEach((cmd) => {
-      if (cmd.getOptionValueSource(key) !== undefined) {
-        source = cmd.getOptionValueSource(key);
-      }
-    });
+    this._getCommandAndAncestors().forEach((cmd) => {});
     return source;
   }
killedBy: getOptionValueSourceWithGlobals when option used with simple command then source is defined
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "cli"
Received: undefined

[Killed] EqualityOperator
lib/command.js:988:11
     // global overwrites local, like optsWithGlobals
     let source;
     this._getCommandAndAncestors().forEach((cmd) => {
-      if (cmd.getOptionValueSource(key) !== undefined) {
+      if (cmd.getOptionValueSource(key) === undefined) {
         source = cmd.getOptionValueSource(key);
       }
killedBy: getOptionValueSourceWithGlobals when option used with simple command then source is defined
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "cli"
Received: undefined

[Killed] ConditionalExpression
lib/command.js:988:11
     // global overwrites local, like optsWithGlobals
     let source;
     this._getCommandAndAncestors().forEach((cmd) => {
-      if (cmd.getOptionValueSource(key) !== undefined) {
+      if (true) {
         source = cmd.getOptionValueSource(key);
       }
killedBy: getOptionValueSourceWithGlobals when option used with subcommand then source is defined
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "cli"
Received: undefined

[Killed] EqualityOperator
lib/command.js:1003:9
    */
 
   _prepareUserArgs(argv, parseOptions) {
-    if (argv !== undefined && !Array.isArray(argv)) {
+    if (argv === undefined && !Array.isArray(argv)) {
       throw new Error('first parameter to parse must be array or undefined');
     }
killedBy: .parse() args from when no args then use process.argv and app/script/args
statusReason: Error: first parameter to parse must be array or undefined

[Killed] ConditionalExpression
lib/command.js:1003:9
    */
 
   _prepareUserArgs(argv, parseOptions) {
-    if (argv !== undefined && !Array.isArray(argv)) {
+    if (true && !Array.isArray(argv)) {
       throw new Error('first parameter to parse must be array or undefined');
     }
killedBy: .parse() args from when no args then use process.argv and app/script/args
statusReason: Error: first parameter to parse must be array or undefined

[Killed] EqualityOperator
lib/command.js:1009:9
     parseOptions = parseOptions || {};
 
     // auto-detect argument conventions if nothing supplied
-    if (argv === undefined && parseOptions.from === undefined) {
+    if (argv !== undefined && parseOptions.from === undefined) {
       if (process.versions?.electron) {
         parseOptions.from = 'electron';
killedBy: .parse() args from when no args and electron properties and not default app then use process.argv and app/args
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "user",
- ]

[Killed] EqualityOperator
lib/command.js:1009:31
     parseOptions = parseOptions || {};
 
     // auto-detect argument conventions if nothing supplied
-    if (argv === undefined && parseOptions.from === undefined) {
+    if (argv === undefined && parseOptions.from !== undefined) {
       if (process.versions?.electron) {
         parseOptions.from = 'electron';
killedBy: .parse() args from when no args and electron properties and not default app then use process.argv and app/args
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "user",
- ]

[Killed] BlockStatement
lib/command.js:1010:39
 
     // auto-detect argument conventions if nothing supplied
     if (argv === undefined && parseOptions.from === undefined) {
-      if (process.versions?.electron) {
-        parseOptions.from = 'electron';
-      }
+      if (process.versions?.electron) {}
       // check node specific options for scenarios where user CLI args follow executable without scriptname
       const execArgv = process.execArgv ?? [];
killedBy: .parse() args from when no args and electron properties and not default app then use process.argv and app/args
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "user",
- ]

[Killed] ConditionalExpression
lib/command.js:1010:11
 
     // auto-detect argument conventions if nothing supplied
     if (argv === undefined && parseOptions.from === undefined) {
-      if (process.versions?.electron) {
+      if (false) {
         parseOptions.from = 'electron';
       }
killedBy: .parse() args from when no args and electron properties and not default app then use process.argv and app/args
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "user",
- ]

[Killed] LogicalOperator
lib/command.js:1014:24
         parseOptions.from = 'electron';
       }
       // check node specific options for scenarios where user CLI args follow executable without scriptname
-      const execArgv = process.execArgv ?? [];
+      const execArgv = process.execArgv && [];
       if (
         execArgv.includes('-e') ||
killedBy: .parse() args from when node execArgv includes -e then app/args
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "user-arg",
- ]

[Killed] ConditionalExpression
lib/command.js:1016:9
       // check node specific options for scenarios where user CLI args follow executable without scriptname
       const execArgv = process.execArgv ?? [];
       if (
-        execArgv.includes('-e') ||
-        execArgv.includes('--eval') ||
-        execArgv.includes('-p') ||
-        execArgv.includes('--print')
+        false
       ) {
         parseOptions.from = 'eval'; // internal usage, not documented
killedBy: .parse() args from when node execArgv includes -e then app/args
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "user-arg",
- ]

[Killed] ConditionalExpression
lib/command.js:1016:9
       // check node specific options for scenarios where user CLI args follow executable without scriptname
       const execArgv = process.execArgv ?? [];
       if (
-        execArgv.includes('-e') ||
-        execArgv.includes('--eval') ||
-        execArgv.includes('-p') ||
+        false ||
         execArgv.includes('--print')
       ) {
killedBy: .parse() args from when node execArgv includes -e then app/args
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "user-arg",
- ]

[Killed] BlockStatement
lib/command.js:1020:9
         execArgv.includes('--eval') ||
         execArgv.includes('-p') ||
         execArgv.includes('--print')
-      ) {
-        parseOptions.from = 'eval'; // internal usage, not documented
-      }
+      ) {}
     }
 
killedBy: .parse() args from when node execArgv includes -e then app/args
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "user-arg",
- ]

[Killed] StringLiteral
lib/command.js:1021:29
         execArgv.includes('-p') ||
         execArgv.includes('--print')
       ) {
-        parseOptions.from = 'eval'; // internal usage, not documented
+        parseOptions.from = ""; // internal usage, not documented
       }
     }
killedBy: .parse() args from when node execArgv includes -e then app/args
statusReason: Error: unexpected parse option { from: '' }

[Killed] ConditionalExpression
lib/command.js:1026:9
     }
 
     // default to using process.argv
-    if (argv === undefined) {
+    if (false) {
       argv = process.argv;
     }
killedBy: .parse() args from when no args then use process.argv and app/script/args
statusReason: TypeError: Cannot read properties of undefined (reading 'slice')

[Killed] BlockStatement
lib/command.js:1026:29
     }
 
     // default to using process.argv
-    if (argv === undefined) {
-      argv = process.argv;
-    }
+    if (argv === undefined) {}
     this.rawArgs = argv.slice();
 
killedBy: .parse() args from when no args then use process.argv and app/script/args
statusReason: TypeError: Cannot read properties of undefined (reading 'slice')
