[Killed] MethodExpression
lib/command.js:1029:20
     if (argv === undefined) {
       argv = process.argv;
     }
-    this.rawArgs = argv.slice();
+    this.rawArgs = argv;
 
     // extract the user args and scriptPath
killedBy: parse parameter is treated as readonly, per TypeScript declaration when parse called and parsed args later changed then parameter does not change
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   "node",
-   "--debug",

[Killed] ConditionalExpression
lib/command.js:1039:7
         this._scriptPath = argv[1];
         userArgs = argv.slice(2);
         break;
-      case 'electron':
-        // @ts-ignore: because defaultApp is an unknown property
-        if (process.defaultApp) {
-          this._scriptPath = argv[1];
-          userArgs = argv.slice(2);
-        } else {
-          userArgs = argv.slice(1);
-        }
-        break;
+      case 'electron':
       case 'user':
         userArgs = argv.slice(0);
killedBy: .parse() args from when no args and electron properties and not default app then use process.argv and app/args
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
+   "node",
    "user",

[Killed] ConditionalExpression
lib/command.js:1041:13
         break;
       case 'electron':
         // @ts-ignore: because defaultApp is an unknown property
-        if (process.defaultApp) {
+        if (true) {
           this._scriptPath = argv[1];
           userArgs = argv.slice(2);
killedBy: .parse() args from when no args and electron properties and not default app then use process.argv and app/args
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "user",
- ]

[Killed] ConditionalExpression
lib/command.js:1041:13
         break;
       case 'electron':
         // @ts-ignore: because defaultApp is an unknown property
-        if (process.defaultApp) {
+        if (false) {
           this._scriptPath = argv[1];
           userArgs = argv.slice(2);
killedBy: .parse() args from when args from "electron" and default app then app/script/args
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
+   "script",
    "user",

[Killed] MethodExpression
lib/command.js:1043:22
         // @ts-ignore: because defaultApp is an unknown property
         if (process.defaultApp) {
           this._scriptPath = argv[1];
-          userArgs = argv.slice(2);
+          userArgs = argv;
         } else {
           userArgs = argv.slice(1);
killedBy: .parse() args from when args from "electron" and default app then app/script/args
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 2

  Array [
+   "electron",
+   "script",

[Killed] BlockStatement
lib/command.js:1044:16
         if (process.defaultApp) {
           this._scriptPath = argv[1];
           userArgs = argv.slice(2);
-        } else {
-          userArgs = argv.slice(1);
-        }
+        } else {}
         break;
       case 'user':
killedBy: .parse() args from when no args and electron properties and not default app then use process.argv and app/args
statusReason: TypeError: Cannot read properties of undefined (reading 'slice')

[Killed] MethodExpression
lib/command.js:1045:22
           this._scriptPath = argv[1];
           userArgs = argv.slice(2);
         } else {
-          userArgs = argv.slice(1);
+          userArgs = argv;
         }
         break;
killedBy: .parse() args from when no args and electron properties and not default app then use process.argv and app/args
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
+   "node",
    "user",

[Survived] MethodExpression
lib/command.js:1049:20
         }
         break;
       case 'user':
-        userArgs = argv.slice(0);
+        userArgs = argv;
         break;
       case 'eval':

[Killed] ConditionalExpression
lib/command.js:1051:7
       case 'user':
         userArgs = argv.slice(0);
         break;
-      case 'eval':
-        userArgs = argv.slice(1);
-        break;
+      case 'eval':
       default:
         throw new Error(
killedBy: .parse() args from when node execArgv includes -e then app/args
statusReason: Error: unexpected parse option { from: 'eval' }

[Killed] MethodExpression
lib/command.js:1052:20
         userArgs = argv.slice(0);
         break;
       case 'eval':
-        userArgs = argv.slice(1);
+        userArgs = argv;
         break;
       default:
killedBy: .parse() args from when node execArgv includes -e then app/args
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
+   "node",
    "user-arg",

[Survived] ConditionalExpression
lib/command.js:1054:7
       case 'eval':
         userArgs = argv.slice(1);
         break;
-      default:
-        throw new Error(
-          `unexpected parse option { from: '${parseOptions.from}' }`,
-        );
+      default:
     }
 

[Survived] StringLiteral
lib/command.js:1056:11
         break;
       default:
         throw new Error(
-          `unexpected parse option { from: '${parseOptions.from}' }`,
+          ``,
         );
     }

[Killed] BooleanLiteral
lib/command.js:1061:9
     }
 
     // Find default name for program from arguments.
-    if (!this._name && this._scriptPath)
+    if (this._name && this._scriptPath)
       this.nameFromFilename(this._scriptPath);
     this._name = this._name || 'program';
killedBy: .parse() called multiple times when parse with different implied program name then name changes
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "script1"
Received: "program"

[Killed] ConditionalExpression
lib/command.js:1061:9
     }
 
     // Find default name for program from arguments.
-    if (!this._name && this._scriptPath)
+    if (false)
       this.nameFromFilename(this._scriptPath);
     this._name = this._name || 'program';
killedBy: .parse() called multiple times when parse with different implied program name then name changes
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "script1"
Received: "program"

[Killed] LogicalOperator
lib/command.js:1063:18
     // Find default name for program from arguments.
     if (!this._name && this._scriptPath)
       this.nameFromFilename(this._scriptPath);
-    this._name = this._name || 'program';
+    this._name = this._name && 'program';
 
     return userArgs;
killedBy: .parse() called multiple times when parse with different implied program name then name changes
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "script1"
Received: "program"

[Killed] ConditionalExpression
lib/command.js:1063:18
     // Find default name for program from arguments.
     if (!this._name && this._scriptPath)
       this.nameFromFilename(this._scriptPath);
-    this._name = this._name || 'program';
+    this._name = true;
 
     return userArgs;
killedBy: search for subcommand subcommand command name with matching local file when construct with name pm and script arg then spawn local pm-sub.js
statusReason: Error: 'true-sub' does not exist
 - if 'sub' is not meant to be an executable command, remove description parameter from '.command()' and use '.description()' instead
 - if the default executable name is not suitable, use the executableFile option to supply a custom name or path
 - searched for local subcommand relative to directory 'C:\projects\TCC\commander.js\.stryker-tmp\sandbox-3JgW2O\tests\f

[Killed] BlockStatement
lib/command.js:1091:29
    * @return {Command} `this` command for chaining
    */
 
-  parse(argv, parseOptions) {
-    this._prepareForParse();
-    const userArgs = this._prepareUserArgs(argv, parseOptions);
-    this._parseCommand([], userArgs);
-
-    return this;
-  }
+  parse(argv, parseOptions) {}
 
   /**
killedBy: .parse() args from when no args then use process.argv and app/script/args
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "user",
- ]

[Killed] BlockStatement
lib/command.js:1120:40
    * @return {Promise}
    */
 
-  async parseAsync(argv, parseOptions) {
-    this._prepareForParse();
-    const userArgs = this._prepareUserArgs(argv, parseOptions);
-    await this._parseCommand([], userArgs);
-
-    return this;
-  }
+  async parseAsync(argv, parseOptions) {}
 
   _prepareForParse() {
killedBy: return type when await .parseAsync then returns program
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: undefined

[Killed] BlockStatement
lib/command.js:1128:22
     return this;
   }
 
-  _prepareForParse() {
-    if (this._savedState === null) {
-      this.saveStateBeforeParse();
-    } else {
-      this.restoreStateBeforeParse();
-    }
-  }
+  _prepareForParse() {}
 
   /**
killedBy: .parse() called multiple times when use boolean options then option values reset
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Object {
+   "black": true,
    "white": true,

[Killed] ConditionalExpression
lib/command.js:1129:9
   }
 
   _prepareForParse() {
-    if (this._savedState === null) {
+    if (true) {
       this.saveStateBeforeParse();
     } else {
killedBy: .parse() called multiple times when use boolean options then option values reset
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Object {
+   "black": true,
    "white": true,

[Killed] BlockStatement
lib/command.js:1129:36
   }
 
   _prepareForParse() {
-    if (this._savedState === null) {
-      this.saveStateBeforeParse();
-    } else {
+    if (this._savedState === null) {} else {
       this.restoreStateBeforeParse();
     }
killedBy: .parse() called multiple times when use boolean options then option values reset
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Object {
+   "black": true,
    "white": true,

[Killed] BlockStatement
lib/command.js:1131:12
   _prepareForParse() {
     if (this._savedState === null) {
       this.saveStateBeforeParse();
-    } else {
-      this.restoreStateBeforeParse();
-    }
+    } else {}
   }
 
killedBy: .parse() called multiple times when use boolean options then option values reset
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Object {
+   "black": true,
    "white": true,

[Killed] BlockStatement
lib/command.js:1142:26
    *
    * This is called in a lazy way. Only commands used in parsing chain will have state saved.
    */
-  saveStateBeforeParse() {
-    this._savedState = {
-      // name is stable if supplied by author, but may be unspecified for root command and deduced during parsing
-      _name: this._name,
-      // option values before parse have default values (including false for negated options)
-      // shallow clones
-      _optionValues: { ...this._optionValues },
-      _optionValueSources: { ...this._optionValueSources },
-    };
-  }
+  saveStateBeforeParse() {}
 
   /**
killedBy: .parse() called multiple times when use boolean options then option values reset
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Object {
+   "black": true,
    "white": true,

[Killed] ObjectLiteral
lib/command.js:1143:24
    * This is called in a lazy way. Only commands used in parsing chain will have state saved.
    */
   saveStateBeforeParse() {
-    this._savedState = {
-      // name is stable if supplied by author, but may be unspecified for root command and deduced during parsing
-      _name: this._name,
-      // option values before parse have default values (including false for negated options)
-      // shallow clones
-      _optionValues: { ...this._optionValues },
-      _optionValueSources: { ...this._optionValueSources },
-    };
+    this._savedState = {};
   }
 
killedBy: .parse() called multiple times when use options with option-argument and default then option values and sources reset
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Object {
    "bar": "BAR",
-   "foo": "default-FOO",

[Killed] BlockStatement
lib/command.js:1159:29
    *
    * This is called in a lazy way. Only commands used in parsing chain will have state restored.
    */
-  restoreStateBeforeParse() {
-    if (this._storeOptionsAsProperties)
-      throw new Error(`Can not call parse again when storeOptionsAsProperties is true.
-- either make a new Command for each call to parse, or stop storing options as properties`);
-
-    // clear state from _prepareUserArgs
-    this._name = this._savedState._name;
-    this._scriptPath = null;
-    this.rawArgs = [];
-    // clear state from setOptionValueWithSource
-    this._optionValues = { ...this._savedState._optionValues };
-    this._optionValueSources = { ...this._savedState._optionValueSources };
-    // clear state from _parseCommand
-    this.args = [];
-    // clear state from _processArguments
-    this.processedArgs = [];
-  }
+  restoreStateBeforeParse() {}
 
   /**
killedBy: .parse() called multiple times when use boolean options then option values reset
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Object {
+   "black": true,
    "white": true,

[Killed] ConditionalExpression
lib/command.js:1160:9
    * This is called in a lazy way. Only commands used in parsing chain will have state restored.
    */
   restoreStateBeforeParse() {
-    if (this._storeOptionsAsProperties)
+    if (false)
       throw new Error(`Can not call parse again when storeOptionsAsProperties is true.
 - either make a new Command for each call to parse, or stop storing options as properties`);
killedBy: .parse() called multiple times when using storeOptionsAsProperties then throw on second parse
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
lib/command.js:1160:9
    * This is called in a lazy way. Only commands used in parsing chain will have state restored.
    */
   restoreStateBeforeParse() {
-    if (this._storeOptionsAsProperties)
+    if (true)
       throw new Error(`Can not call parse again when storeOptionsAsProperties is true.
 - either make a new Command for each call to parse, or stop storing options as properties`);
killedBy: .parse() called multiple times when use boolean options then option values reset
statusReason: Error: Can not call parse again when storeOptionsAsProperties is true.
- either make a new Command for each call to parse, or stop storing options as properties

[Survived] ArrayDeclaration
lib/command.js:1172:17
     this._optionValues = { ...this._savedState._optionValues };
     this._optionValueSources = { ...this._savedState._optionValueSources };
     // clear state from _parseCommand
-    this.args = [];
+    this.args = ["Stryker was here"];
     // clear state from _processArguments
     this.processedArgs = [];

[Survived] ArrayDeclaration
lib/command.js:1174:26
     // clear state from _parseCommand
     this.args = [];
     // clear state from _processArguments
-    this.processedArgs = [];
+    this.processedArgs = ["Stryker was here"];
   }
 

[Survived] BlockStatement
lib/command.js:1184:77
    * @param {string} executableDir
    * @param {string} subcommandName
    */
-  _checkForMissingExecutable(executableFile, executableDir, subcommandName) {
-    if (fs.existsSync(executableFile)) return;
-
-    const executableDirMessage = executableDir
-      ? `searched for local subcommand relative to directory '${executableDir}'`
-      : 'no directory for search for local subcommand, use .executableDir() to supply a custom directory';
-    const executableMissing = `'${executableFile}' does not exist
- - if '${subcommandName}' is not meant to be an executable command, remove description parameter from '.command()' and use '.description()' instead
- - if the default executable name is not suitable, use the executableFile option to supply a custom name or path
- - ${executableDirMessage}`;
-    throw new Error(executableMissing);
-  }
+  _checkForMissingExecutable(executableFile, executableDir, subcommandName) {}
 
   /**

[Killed] ConditionalExpression
lib/command.js:1185:9
    * @param {string} subcommandName
    */
   _checkForMissingExecutable(executableFile, executableDir, subcommandName) {
-    if (fs.existsSync(executableFile)) return;
+    if (false) return;
 
     const executableDirMessage = executableDir
killedBy: .exitOverride and error details when executableSubcommand succeeds then call exitOverride
statusReason: Error: 'C:\projects\TCC\commander.js\.stryker-tmp\sandbox-3JgW2O\tests\fixtures\pm-silent' does not exist
 - if 'silent' is not meant to be an executable command, remove description parameter from '.command()' and use '.description()' instead
 - if the default executable name is not suitable, use the executableFile option to supply a custom name or path
 - searched for local subcommand relative to

[Survived] ConditionalExpression
lib/command.js:1185:9
    * @param {string} subcommandName
    */
   _checkForMissingExecutable(executableFile, executableDir, subcommandName) {
-    if (fs.existsSync(executableFile)) return;
+    if (true) return;
 
     const executableDirMessage = executableDir

[NoCoverage] StringLiteral
lib/command.js:1188:9
     if (fs.existsSync(executableFile)) return;
 
     const executableDirMessage = executableDir
-      ? `searched for local subcommand relative to directory '${executableDir}'`
+      ? ``
       : 'no directory for search for local subcommand, use .executableDir() to supply a custom directory';
     const executableMissing = `'${executableFile}' does not exist

[NoCoverage] StringLiteral
lib/command.js:1190:31
     const executableDirMessage = executableDir
       ? `searched for local subcommand relative to directory '${executableDir}'`
       : 'no directory for search for local subcommand, use .executableDir() to supply a custom directory';
-    const executableMissing = `'${executableFile}' does not exist
- - if '${subcommandName}' is not meant to be an executable command, remove description parameter from '.command()' and use '.description()' instead
- - if the default executable name is not suitable, use the executableFile option to supply a custom name or path
- - ${executableDirMessage}`;
+    const executableMissing = ``;
     throw new Error(executableMissing);
   }

[Survived] MethodExpression
lib/command.js:1204:12
    */
 
   _executeSubCommand(subcommand, args) {
-    args = args.slice();
+    args = args;
     let launchWithNode = false; // Use node for source targets so do not need to get permissions correct, and on Windows.
     const sourceExt = ['.js', '.ts', '.tsx', '.mjs', '.cjs'];

[Survived] BooleanLiteral
lib/command.js:1205:26
 
   _executeSubCommand(subcommand, args) {
     args = args.slice();
-    let launchWithNode = false; // Use node for source targets so do not need to get permissions correct, and on Windows.
+    let launchWithNode = true; // Use node for source targets so do not need to get permissions correct, and on Windows.
     const sourceExt = ['.js', '.ts', '.tsx', '.mjs', '.cjs'];
 

[Killed] BlockStatement
lib/command.js:1208:42
     let launchWithNode = false; // Use node for source targets so do not need to get permissions correct, and on Windows.
     const sourceExt = ['.js', '.ts', '.tsx', '.mjs', '.cjs'];
 
-    function findFile(baseDir, baseName) {
-      // Look for specified file
-      const localBin = path.resolve(baseDir, baseName);
-      if (fs.existsSync(localBin)) return localBin;
-
-      // Stop looking if candidate already has an expected extension.
-      if (sourceExt.includes(path.extname(baseName))) return undefined;
-
-      // Try all the extensions.
-      const foundExt = sourceExt.find((ext) =>
-        fs.existsSync(`${localBin}${ext}`),
-      );
-      if (foundExt) return `${localBin}${foundExt}`;
-
-      return undefined;
-    }
+    function findFile(baseDir, baseName) {}
 
     // Not checking for help first. Unlikely to have mandatory and executable, and can't robustly test for help flags in external command.
killedBy: search for subcommand whether perform search for local files when script arg then search for local files
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
lib/command.js:1211:11
     function findFile(baseDir, baseName) {
       // Look for specified file
       const localBin = path.resolve(baseDir, baseName);
-      if (fs.existsSync(localBin)) return localBin;
+      if (false) return localBin;
 
       // Stop looking if candidate already has an expected extension.
killedBy: .exitOverride and error details when executableSubcommand succeeds then call exitOverride
statusReason: Error: 'pm-silent' does not exist
 - if 'silent' is not meant to be an executable command, remove description parameter from '.command()' and use '.description()' instead
 - if the default executable name is not suitable, use the executableFile option to supply a custom name or path
 - searched for local subcommand relative to directory 'C:\projects\TCC\commander.js\.stryker-tmp\sandbox-3JgW2O\tes

[Killed] ConditionalExpression
lib/command.js:1211:11
     function findFile(baseDir, baseName) {
       // Look for specified file
       const localBin = path.resolve(baseDir, baseName);
-      if (fs.existsSync(localBin)) return localBin;
+      if (true) return localBin;
 
       // Stop looking if candidate already has an expected extension.
killedBy: search for subcommand whether perform search for local files when script arg then search for local files
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
lib/command.js:1214:11
       if (fs.existsSync(localBin)) return localBin;
 
       // Stop looking if candidate already has an expected extension.
-      if (sourceExt.includes(path.extname(baseName))) return undefined;
+      if (true) return undefined;
 
       // Try all the extensions.
killedBy: search for subcommand subcommand command name with matching local file when construct with name pm and script arg then spawn local pm-sub.js
statusReason: Error: 'pm-sub' does not exist
 - if 'sub' is not meant to be an executable command, remove description parameter from '.command()' and use '.description()' instead
 - if the default executable name is not suitable, use the executableFile option to supply a custom name or path
 - searched for local subcommand relative to directory 'C:\projects\TCC\commander.js\.stryker-tmp\sandbox-3JgW2O\tests\fix

[Survived] ConditionalExpression
lib/command.js:1214:11
       if (fs.existsSync(localBin)) return localBin;
 
       // Stop looking if candidate already has an expected extension.
-      if (sourceExt.includes(path.extname(baseName))) return undefined;
+      if (false) return undefined;
 
       // Try all the extensions.

[Killed] ArrowFunction
lib/command.js:1217:39
       if (sourceExt.includes(path.extname(baseName))) return undefined;
 
       // Try all the extensions.
-      const foundExt = sourceExt.find((ext) =>
-        fs.existsSync(`${localBin}${ext}`),
+      const foundExt = sourceExt.find(() => undefined,
       );
       if (foundExt) return `${localBin}${foundExt}`;
killedBy: search for subcommand subcommand command name with matching local file when construct with name pm and script arg then spawn local pm-sub.js
statusReason: Error: 'pm-sub' does not exist
 - if 'sub' is not meant to be an executable command, remove description parameter from '.command()' and use '.description()' instead
 - if the default executable name is not suitable, use the executableFile option to supply a custom name or path
 - searched for local subcommand relative to directory 'C:\projects\TCC\commander.js\.stryker-tmp\sandbox-3JgW2O\tests\fix

[Killed] StringLiteral
lib/command.js:1218:23
 
       // Try all the extensions.
       const foundExt = sourceExt.find((ext) =>
-        fs.existsSync(`${localBin}${ext}`),
+        fs.existsSync(``),
       );
       if (foundExt) return `${localBin}${foundExt}`;
killedBy: search for subcommand subcommand command name with matching local file when construct with name pm and script arg then spawn local pm-sub.js
statusReason: Error: 'pm-sub' does not exist
 - if 'sub' is not meant to be an executable command, remove description parameter from '.command()' and use '.description()' instead
 - if the default executable name is not suitable, use the executableFile option to supply a custom name or path
 - searched for local subcommand relative to directory 'C:\projects\TCC\commander.js\.stryker-tmp\sandbox-3JgW2O\tests\fix

[Killed] ConditionalExpression
lib/command.js:1220:11
       const foundExt = sourceExt.find((ext) =>
         fs.existsSync(`${localBin}${ext}`),
       );
-      if (foundExt) return `${localBin}${foundExt}`;
+      if (true) return `${localBin}${foundExt}`;
 
       return undefined;
killedBy: search for subcommand subcommand command name with matching local file when name pm and script arg and only script-sub.js then fallback to spawn local script-sub.js
statusReason: Error: 'C:\projects\TCC\commander.js\.stryker-tmp\sandbox-3JgW2O\tests\fixtures\pm-subundefined' does not exist
 - if 'sub' is not meant to be an executable command, remove description parameter from '.command()' and use '.description()' instead
 - if the default executable name is not suitable, use the executableFile option to supply a custom name or path
 - searched for local subcommand relative

[Killed] ConditionalExpression
lib/command.js:1220:11
       const foundExt = sourceExt.find((ext) =>
         fs.existsSync(`${localBin}${ext}`),
       );
-      if (foundExt) return `${localBin}${foundExt}`;
+      if (false) return `${localBin}${foundExt}`;
 
       return undefined;
killedBy: search for subcommand subcommand command name with matching local file when construct with name pm and script arg then spawn local pm-sub.js
statusReason: Error: 'pm-sub' does not exist
 - if 'sub' is not meant to be an executable command, remove description parameter from '.command()' and use '.description()' instead
 - if the default executable name is not suitable, use the executableFile option to supply a custom name or path
 - searched for local subcommand relative to directory 'C:\projects\TCC\commander.js\.stryker-tmp\sandbox-3JgW2O\tests\fix

[Killed] ConditionalExpression
lib/command.js:1231:7
 
     // executableFile and executableDir might be full path, or just a name
     let executableFile =
-      subcommand._executableFile || `${this._name}-${subcommand._name}`;
+      true;
     let executableDir = this._executableDir || '';
     if (this._scriptPath) {
killedBy: search for subcommand whether perform search for local files when no script arg or executableDir then no search for local file
statusReason: TypeError: The "path" argument must be of type string. Received type boolean (true)

[Killed] ConditionalExpression
lib/command.js:1231:7
 
     // executableFile and executableDir might be full path, or just a name
     let executableFile =
-      subcommand._executableFile || `${this._name}-${subcommand._name}`;
+      false;
     let executableDir = this._executableDir || '';
     if (this._scriptPath) {
killedBy: when subcommand executable fails with other error and exitOverride then return in custom wrapper
statusReason: TypeError: The "path" argument must be of type string. Received type boolean (false)

[Killed] ConditionalExpression
lib/command.js:1232:25
     // executableFile and executableDir might be full path, or just a name
     let executableFile =
       subcommand._executableFile || `${this._name}-${subcommand._name}`;
-    let executableDir = this._executableDir || '';
+    let executableDir = false;
     if (this._scriptPath) {
       let resolvedScriptPath; // resolve possible symlink for installed npm binary
killedBy: search for subcommand whether perform search for local files when script arg then search for local files
statusReason: TypeError: The "paths[1]" argument must be of type string. Received type boolean (false)

[Killed] ConditionalExpression
lib/command.js:1232:25
     // executableFile and executableDir might be full path, or just a name
     let executableFile =
       subcommand._executableFile || `${this._name}-${subcommand._name}`;
-    let executableDir = this._executableDir || '';
+    let executableDir = true;
     if (this._scriptPath) {
       let resolvedScriptPath; // resolve possible symlink for installed npm binary
killedBy: search for subcommand whether perform search for local files when no script arg or executableDir then no search for local file
statusReason: TypeError: The "paths[0]" argument must be of type string. Received type boolean (true)
