[Killed] ConditionalExpression
lib/command.js:1233:9
     let executableFile =
       subcommand._executableFile || `${this._name}-${subcommand._name}`;
     let executableDir = this._executableDir || '';
-    if (this._scriptPath) {
+    if (false) {
       let resolvedScriptPath; // resolve possible symlink for installed npm binary
       try {
killedBy: search for subcommand whether perform search for local files when script arg then search for local files
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
lib/command.js:1233:27
     let executableFile =
       subcommand._executableFile || `${this._name}-${subcommand._name}`;
     let executableDir = this._executableDir || '';
-    if (this._scriptPath) {
-      let resolvedScriptPath; // resolve possible symlink for installed npm binary
-      try {
-        resolvedScriptPath = fs.realpathSync(this._scriptPath);
-      } catch {
-        resolvedScriptPath = this._scriptPath;
-      }
-      executableDir = path.resolve(
-        path.dirname(resolvedScriptPath),
-        executableDir,
-      );
-    }
+    if (this._scriptPath) {}
 
     // Look for a local file in preference to a command in PATH.
killedBy: search for subcommand whether perform search for local files when script arg then search for local files
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
lib/command.js:1235:11
     let executableDir = this._executableDir || '';
     if (this._scriptPath) {
       let resolvedScriptPath; // resolve possible symlink for installed npm binary
-      try {
-        resolvedScriptPath = fs.realpathSync(this._scriptPath);
-      } catch {
+      try {} catch {
         resolvedScriptPath = this._scriptPath;
       }
killedBy: .exitOverride and error details when executableSubcommand succeeds then call exitOverride
statusReason: TypeError: The "path" argument must be of type string. Received undefined

[Killed] BlockStatement
lib/command.js:1237:15
       let resolvedScriptPath; // resolve possible symlink for installed npm binary
       try {
         resolvedScriptPath = fs.realpathSync(this._scriptPath);
-      } catch {
-        resolvedScriptPath = this._scriptPath;
-      }
+      } catch {}
       executableDir = path.resolve(
         path.dirname(resolvedScriptPath),
killedBy: search for subcommand whether perform search for local files when script arg then search for local files
statusReason: TypeError: The "path" argument must be of type string. Received undefined

[Killed] ConditionalExpression
lib/command.js:1247:9
     }
 
     // Look for a local file in preference to a command in PATH.
-    if (executableDir) {
+    if (true) {
       let localFile = findFile(executableDir, executableFile);
 
killedBy: search for subcommand whether perform search for local files when no script arg or executableDir then no search for local file
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 6

1: "C:\\projects\\TCC\\commander.js\\.stryker-tmp\\sandbox-3JgW2O\\pm-sub"
2: "C:\\projects\\TCC\\commander.js\\.stryker-tmp\\sandbox-3JgW2O\\pm-sub.js"
3: "C:\\projects\\TCC\\commander.js\\.stryker-tmp\\sandbox-3JgW2O\\pm-sub.ts"

[Killed] BlockStatement
lib/command.js:1247:24
     }
 
     // Look for a local file in preference to a command in PATH.
-    if (executableDir) {
-      let localFile = findFile(executableDir, executableFile);
-
-      // Legacy search using prefix of script name instead of command name
-      if (!localFile && !subcommand._executableFile && this._scriptPath) {
-        const legacyName = path.basename(
-          this._scriptPath,
-          path.extname(this._scriptPath),
-        );
-        if (legacyName !== this._name) {
-          localFile = findFile(
-            executableDir,
-            `${legacyName}-${subcommand._name}`,
-          );
-        }
-      }
-      executableFile = localFile || executableFile;
-    }
+    if (executableDir) {}
 
     launchWithNode = sourceExt.includes(path.extname(executableFile));
killedBy: search for subcommand whether perform search for local files when script arg then search for local files
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] LogicalOperator
lib/command.js:1251:11
       let localFile = findFile(executableDir, executableFile);
 
       // Legacy search using prefix of script name instead of command name
-      if (!localFile && !subcommand._executableFile && this._scriptPath) {
+      if (!localFile && !subcommand._executableFile || this._scriptPath) {
         const legacyName = path.basename(
           this._scriptPath,
killedBy: search for subcommand whether perform search for local files when executableDir then search for local files)
statusReason: TypeError: The "path" argument must be of type string. Received null

[Killed] ConditionalExpression
lib/command.js:1251:11
       let localFile = findFile(executableDir, executableFile);
 
       // Legacy search using prefix of script name instead of command name
-      if (!localFile && !subcommand._executableFile && this._scriptPath) {
+      if (true) {
         const legacyName = path.basename(
           this._scriptPath,
killedBy: search for subcommand whether perform search for local files when executableDir then search for local files)
statusReason: TypeError: The "path" argument must be of type string. Received null

[Killed] EqualityOperator
lib/command.js:1256:13
           this._scriptPath,
           path.extname(this._scriptPath),
         );
-        if (legacyName !== this._name) {
+        if (legacyName === this._name) {
           localFile = findFile(
             executableDir,
killedBy: search for subcommand subcommand command name with matching local file when name pm and script arg and only script-sub.js then fallback to spawn local script-sub.js
statusReason: Error: 'pm-sub' does not exist
 - if 'sub' is not meant to be an executable command, remove description parameter from '.command()' and use '.description()' instead
 - if the default executable name is not suitable, use the executableFile option to supply a custom name or path
 - searched for local subcommand relative to directory 'C:\projects\TCC\commander.js\.stryker-tmp\sandbox-3JgW2O\tests\fix

[Killed] BlockStatement
lib/command.js:1256:40
           this._scriptPath,
           path.extname(this._scriptPath),
         );
-        if (legacyName !== this._name) {
-          localFile = findFile(
-            executableDir,
-            `${legacyName}-${subcommand._name}`,
-          );
-        }
+        if (legacyName !== this._name) {}
       }
       executableFile = localFile || executableFile;
killedBy: search for subcommand subcommand command name with matching local file when name pm and script arg and only script-sub.js then fallback to spawn local script-sub.js
statusReason: Error: 'pm-sub' does not exist
 - if 'sub' is not meant to be an executable command, remove description parameter from '.command()' and use '.description()' instead
 - if the default executable name is not suitable, use the executableFile option to supply a custom name or path
 - searched for local subcommand relative to directory 'C:\projects\TCC\commander.js\.stryker-tmp\sandbox-3JgW2O\tests\fix

[Killed] ConditionalExpression
lib/command.js:1263:24
           );
         }
       }
-      executableFile = localFile || executableFile;
+      executableFile = true;
     }
 
killedBy: search for subcommand whether perform search for local files when script arg then search for local files
statusReason: TypeError: The "path" argument must be of type string. Received type boolean (true)

[Killed] LogicalOperator
lib/command.js:1263:24
           );
         }
       }
-      executableFile = localFile || executableFile;
+      executableFile = localFile && executableFile;
     }
 
killedBy: .exitOverride and error details when executableSubcommand succeeds then call exitOverride
statusReason: Error: 'pm-silent' does not exist
 - if 'silent' is not meant to be an executable command, remove description parameter from '.command()' and use '.description()' instead
 - if the default executable name is not suitable, use the executableFile option to supply a custom name or path
 - searched for local subcommand relative to directory 'C:\projects\TCC\commander.js\.stryker-tmp\sandbox-3JgW2O\tes

[Killed] ConditionalExpression
lib/command.js:1269:9
     launchWithNode = sourceExt.includes(path.extname(executableFile));
 
     let proc;
-    if (process.platform !== 'win32') {
+    if (true) {
       if (launchWithNode) {
         args.unshift(executableFile);
killedBy: .exitOverride and error details when executableSubcommand succeeds then call exitOverride
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] EqualityOperator
lib/command.js:1269:9
     launchWithNode = sourceExt.includes(path.extname(executableFile));
 
     let proc;
-    if (process.platform !== 'win32') {
+    if (process.platform === 'win32') {
       if (launchWithNode) {
         args.unshift(executableFile);
killedBy: .exitOverride and error details when executableSubcommand succeeds then call exitOverride
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[NoCoverage] ConditionalExpression
lib/command.js:1270:11
 
     let proc;
     if (process.platform !== 'win32') {
-      if (launchWithNode) {
+      if (false) {
         args.unshift(executableFile);
         // add executable arguments to spawn

[NoCoverage] BlockStatement
lib/command.js:1270:27
 
     let proc;
     if (process.platform !== 'win32') {
-      if (launchWithNode) {
-        args.unshift(executableFile);
-        // add executable arguments to spawn
-        args = incrementNodeInspectorPort(process.execArgv).concat(args);
-
-        proc = childProcess.spawn(process.argv[0], args, { stdio: 'inherit' });
-      } else {
+      if (launchWithNode) {} else {
         proc = childProcess.spawn(executableFile, args, { stdio: 'inherit' });
       }

[NoCoverage] BlockStatement
lib/command.js:1276:14
         args = incrementNodeInspectorPort(process.execArgv).concat(args);
 
         proc = childProcess.spawn(process.argv[0], args, { stdio: 'inherit' });
-      } else {
-        proc = childProcess.spawn(executableFile, args, { stdio: 'inherit' });
-      }
+      } else {}
     } else {
       this._checkForMissingExecutable(

[Killed] BlockStatement
lib/command.js:1279:12
       } else {
         proc = childProcess.spawn(executableFile, args, { stdio: 'inherit' });
       }
-    } else {
-      this._checkForMissingExecutable(
-        executableFile,
-        executableDir,
-        subcommand._name,
-      );
-      args.unshift(executableFile);
-      // add executable arguments to spawn
-      args = incrementNodeInspectorPort(process.execArgv).concat(args);
-      proc = childProcess.spawn(process.execPath, args, { stdio: 'inherit' });
-    }
+    } else {}
 
     if (!proc.killed) {
killedBy: search for subcommand whether perform search for local files when no script arg or executableDir then no search for local file
statusReason: TypeError: Cannot read properties of undefined (reading 'killed')

[Survived] StringLiteral
lib/command.js:1288:66
       args.unshift(executableFile);
       // add executable arguments to spawn
       args = incrementNodeInspectorPort(process.execArgv).concat(args);
-      proc = childProcess.spawn(process.execPath, args, { stdio: 'inherit' });
+      proc = childProcess.spawn(process.execPath, args, { stdio: "" });
     }
 

[Survived] BooleanLiteral
lib/command.js:1291:9
       proc = childProcess.spawn(process.execPath, args, { stdio: 'inherit' });
     }
 
-    if (!proc.killed) {
+    if (proc.killed) {
       // testing mainly to avoid leak warnings during unit tests with mocked spawn
       const signals = ['SIGUSR1', 'SIGUSR2', 'SIGTERM', 'SIGINT', 'SIGHUP'];

[Survived] BlockStatement
lib/command.js:1291:23
       proc = childProcess.spawn(process.execPath, args, { stdio: 'inherit' });
     }
 
-    if (!proc.killed) {
-      // testing mainly to avoid leak warnings during unit tests with mocked spawn
-      const signals = ['SIGUSR1', 'SIGUSR2', 'SIGTERM', 'SIGINT', 'SIGHUP'];
-      signals.forEach((signal) => {
-        process.on(signal, () => {
-          if (proc.killed === false && proc.exitCode === null) {
-            // @ts-ignore because signals not typed to known strings
-            proc.kill(signal);
-          }
-        });
-      });
-    }
+    if (!proc.killed) {}
 
     // By default terminate process when spawned process terminates.

[Survived] StringLiteral
lib/command.js:1293:67
 
     if (!proc.killed) {
       // testing mainly to avoid leak warnings during unit tests with mocked spawn
-      const signals = ['SIGUSR1', 'SIGUSR2', 'SIGTERM', 'SIGINT', 'SIGHUP'];
+      const signals = ['SIGUSR1', 'SIGUSR2', 'SIGTERM', 'SIGINT', ""];
       signals.forEach((signal) => {
         process.on(signal, () => {

[Survived] BlockStatement
lib/command.js:1294:35
     if (!proc.killed) {
       // testing mainly to avoid leak warnings during unit tests with mocked spawn
       const signals = ['SIGUSR1', 'SIGUSR2', 'SIGTERM', 'SIGINT', 'SIGHUP'];
-      signals.forEach((signal) => {
-        process.on(signal, () => {
-          if (proc.killed === false && proc.exitCode === null) {
-            // @ts-ignore because signals not typed to known strings
-            proc.kill(signal);
-          }
-        });
-      });
+      signals.forEach((signal) => {});
     }
 

[NoCoverage] BlockStatement
lib/command.js:1295:34
       // testing mainly to avoid leak warnings during unit tests with mocked spawn
       const signals = ['SIGUSR1', 'SIGUSR2', 'SIGTERM', 'SIGINT', 'SIGHUP'];
       signals.forEach((signal) => {
-        process.on(signal, () => {
-          if (proc.killed === false && proc.exitCode === null) {
-            // @ts-ignore because signals not typed to known strings
-            proc.kill(signal);
-          }
-        });
+        process.on(signal, () => {});
       });
     }

[NoCoverage] BooleanLiteral
lib/command.js:1296:31
       const signals = ['SIGUSR1', 'SIGUSR2', 'SIGTERM', 'SIGINT', 'SIGHUP'];
       signals.forEach((signal) => {
         process.on(signal, () => {
-          if (proc.killed === false && proc.exitCode === null) {
+          if (proc.killed === true && proc.exitCode === null) {
             // @ts-ignore because signals not typed to known strings
             proc.kill(signal);

[NoCoverage] EqualityOperator
lib/command.js:1296:15
       const signals = ['SIGUSR1', 'SIGUSR2', 'SIGTERM', 'SIGINT', 'SIGHUP'];
       signals.forEach((signal) => {
         process.on(signal, () => {
-          if (proc.killed === false && proc.exitCode === null) {
+          if (proc.killed !== false && proc.exitCode === null) {
             // @ts-ignore because signals not typed to known strings
             proc.kill(signal);

[Killed] BlockStatement
lib/command.js:1306:32
 
     // By default terminate process when spawned process terminates.
     const exitCallback = this._exitCallback;
-    proc.on('close', (code) => {
-      code = code ?? 1; // code is null if spawned process terminated due to a signal
-      if (!exitCallback) {
-        process.exit(code);
-      } else {
-        exitCallback(
-          new CommanderError(
-            code,
-            'commander.executeSubCommandAsync',
-            '(close)',
-          ),
-        );
-      }
-    });
+    proc.on('close', (code) => {});
     proc.on('error', (err) => {
       // @ts-ignore: because err.code is an unknown property
killedBy: .exitOverride and error details when executableSubcommand succeeds then call exitOverride
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] LogicalOperator
lib/command.js:1307:14
     // By default terminate process when spawned process terminates.
     const exitCallback = this._exitCallback;
     proc.on('close', (code) => {
-      code = code ?? 1; // code is null if spawned process terminated due to a signal
+      code = code && 1; // code is null if spawned process terminated due to a signal
       if (!exitCallback) {
         process.exit(code);

[Survived] ConditionalExpression
lib/command.js:1308:11
     const exitCallback = this._exitCallback;
     proc.on('close', (code) => {
       code = code ?? 1; // code is null if spawned process terminated due to a signal
-      if (!exitCallback) {
+      if (false) {
         process.exit(code);
       } else {

[NoCoverage] BlockStatement
lib/command.js:1308:26
     const exitCallback = this._exitCallback;
     proc.on('close', (code) => {
       code = code ?? 1; // code is null if spawned process terminated due to a signal
-      if (!exitCallback) {
-        process.exit(code);
-      } else {
+      if (!exitCallback) {} else {
         exitCallback(
           new CommanderError(

[Killed] BlockStatement
lib/command.js:1310:14
       code = code ?? 1; // code is null if spawned process terminated due to a signal
       if (!exitCallback) {
         process.exit(code);
-      } else {
-        exitCallback(
-          new CommanderError(
-            code,
-            'commander.executeSubCommandAsync',
-            '(close)',
-          ),
-        );
-      }
+      } else {}
     });
     proc.on('error', (err) => {
killedBy: .exitOverride and error details when executableSubcommand succeeds then call exitOverride
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] StringLiteral
lib/command.js:1314:13
         exitCallback(
           new CommanderError(
             code,
-            'commander.executeSubCommandAsync',
+            "",
             '(close)',
           ),
killedBy: .exitOverride and error details when executableSubcommand succeeds then call exitOverride
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "commander.executeSubCommandAsync"
Received: ""

[Killed] StringLiteral
lib/command.js:1315:13
           new CommanderError(
             code,
             'commander.executeSubCommandAsync',
-            '(close)',
+            "",
           ),
         );
killedBy: .exitOverride and error details when executableSubcommand succeeds then call exitOverride
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "(close)"
Received: ""

[Killed] BlockStatement
lib/command.js:1320:31
         );
       }
     });
-    proc.on('error', (err) => {
-      // @ts-ignore: because err.code is an unknown property
-      if (err.code === 'ENOENT') {
-        this._checkForMissingExecutable(
-          executableFile,
-          executableDir,
-          subcommand._name,
-        );
-        // @ts-ignore: because err.code is an unknown property
-      } else if (err.code === 'EACCES') {
-        throw new Error(`'${executableFile}' not executable`);
-      }
-      if (!exitCallback) {
-        process.exit(1);
-      } else {
-        const wrappedError = new CommanderError(
-          1,
-          'commander.executeSubCommandAsync',
-          '(error)',
-        );
-        wrappedError.nestedError = err;
-        exitCallback(wrappedError);
-      }
-    });
+    proc.on('error', (err) => {});
 
     // Store the reference to the child process
killedBy: when subcommand executable fails with other error and exitOverride then return in custom wrapper
statusReason: TypeError: Cannot read properties of undefined (reading 'code')

[Killed] StringLiteral
lib/command.js:1320:13
         );
       }
     });
-    proc.on('error', (err) => {
+    proc.on("", (err) => {
       // @ts-ignore: because err.code is an unknown property
       if (err.code === 'ENOENT') {
killedBy: when subcommand executable fails with other error and exitOverride then return in custom wrapper
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "commander.executeSubCommandAsync"
Received: "ERR_UNHANDLED_ERROR"

[Survived] ConditionalExpression
lib/command.js:1322:11
     });
     proc.on('error', (err) => {
       // @ts-ignore: because err.code is an unknown property
-      if (err.code === 'ENOENT') {
+      if (true) {
         this._checkForMissingExecutable(
           executableFile,

[NoCoverage] BlockStatement
lib/command.js:1322:34
     });
     proc.on('error', (err) => {
       // @ts-ignore: because err.code is an unknown property
-      if (err.code === 'ENOENT') {
-        this._checkForMissingExecutable(
-          executableFile,
-          executableDir,
-          subcommand._name,
-        );
-        // @ts-ignore: because err.code is an unknown property
-      } else if (err.code === 'EACCES') {
+      if (err.code === 'ENOENT') {} else if (err.code === 'EACCES') {
         throw new Error(`'${executableFile}' not executable`);
       }

[Killed] EqualityOperator
lib/command.js:1329:18
           subcommand._name,
         );
         // @ts-ignore: because err.code is an unknown property
-      } else if (err.code === 'EACCES') {
+      } else if (err.code !== 'EACCES') {
         throw new Error(`'${executableFile}' not executable`);
       }
killedBy: when subcommand executable fails with other error and exitOverride then return in custom wrapper
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "commander.executeSubCommandAsync"
Received: undefined

[Killed] ConditionalExpression
lib/command.js:1329:18
           subcommand._name,
         );
         // @ts-ignore: because err.code is an unknown property
-      } else if (err.code === 'EACCES') {
+      } else if (true) {
         throw new Error(`'${executableFile}' not executable`);
       }
killedBy: when subcommand executable fails with other error and exitOverride then return in custom wrapper
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "commander.executeSubCommandAsync"
Received: undefined

[NoCoverage] StringLiteral
lib/command.js:1330:25
         );
         // @ts-ignore: because err.code is an unknown property
       } else if (err.code === 'EACCES') {
-        throw new Error(`'${executableFile}' not executable`);
+        throw new Error(``);
       }
       if (!exitCallback) {

[Killed] ConditionalExpression
lib/command.js:1332:11
       } else if (err.code === 'EACCES') {
         throw new Error(`'${executableFile}' not executable`);
       }
-      if (!exitCallback) {
+      if (false) {
         process.exit(1);
       } else {
killedBy: when subcommand executable fails with other error then exit
statusReason: TypeError: exitCallback is not a function

[Killed] BlockStatement
lib/command.js:1332:26
       } else if (err.code === 'EACCES') {
         throw new Error(`'${executableFile}' not executable`);
       }
-      if (!exitCallback) {
-        process.exit(1);
-      } else {
+      if (!exitCallback) {} else {
         const wrappedError = new CommanderError(
           1,
killedBy: when subcommand executable fails with other error then exit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] BlockStatement
lib/command.js:1334:14
       }
       if (!exitCallback) {
         process.exit(1);
-      } else {
-        const wrappedError = new CommanderError(
-          1,
-          'commander.executeSubCommandAsync',
-          '(error)',
-        );
-        wrappedError.nestedError = err;
-        exitCallback(wrappedError);
-      }
+      } else {}
     });
 
killedBy: when subcommand executable fails with other error and exitOverride then return in custom wrapper
statusReason: TypeError: Cannot read properties of undefined (reading 'code')

[Killed] BlockStatement
lib/command.js:1353:55
    * @private
    */
 
-  _dispatchSubcommand(commandName, operands, unknown) {
-    const subCommand = this._findCommand(commandName);
-    if (!subCommand) this.help({ error: true });
-
-    subCommand._prepareForParse();
-    let promiseChain;
-    promiseChain = this._chainOrCallSubCommandHook(
-      promiseChain,
-      subCommand,
-      'preSubcommand',
-    );
-    promiseChain = this._chainOrCall(promiseChain, () => {
-      if (subCommand._executableHandler) {
-        this._executeSubCommand(subCommand, operands.concat(unknown));
-      } else {
-        return subCommand._parseCommand(operands, unknown);
-      }
-    });
-    return promiseChain;
-  }
+  _dispatchSubcommand(commandName, operands, unknown) {}
 
   /**
killedBy: .exitOverride and error details when specify command without required argument then throw CommanderError
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
lib/command.js:1355:9
 
   _dispatchSubcommand(commandName, operands, unknown) {
     const subCommand = this._findCommand(commandName);
-    if (!subCommand) this.help({ error: true });
+    if (false) this.help({ error: true });
 
     subCommand._prepareForParse();
killedBy: help command processed on correct command when "program help unknown" then program
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "program"
Received message:   "Cannot read properties of undefined (reading '_prepareForParse')"

      2026 |         error: stryMutAct_9fa48("727") ? false : (stryCov_9fa48("727"), true)
      2027 |       }));
    > 2028 |       subCommand._prepareForParse();

[Survived] BooleanLiteral
lib/command.js:1355:41
 
   _dispatchSubcommand(commandName, operands, unknown) {
     const subCommand = this._findCommand(commandName);
-    if (!subCommand) this.help({ error: true });
+    if (!subCommand) this.help({ error: false });
 
     subCommand._prepareForParse();

[Killed] BlockStatement
lib/command.js:1364:58
       subCommand,
       'preSubcommand',
     );
-    promiseChain = this._chainOrCall(promiseChain, () => {
-      if (subCommand._executableHandler) {
-        this._executeSubCommand(subCommand, operands.concat(unknown));
-      } else {
-        return subCommand._parseCommand(operands, unknown);
-      }
-    });
+    promiseChain = this._chainOrCall(promiseChain, () => {});
     return promiseChain;
   }
killedBy: .parse() called multiple times when call subcommand then option values reset (program and subcommand)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Object {
    "black": true,
-   "red": true,

[Killed] ConditionalExpression
lib/command.js:1365:11
       'preSubcommand',
     );
     promiseChain = this._chainOrCall(promiseChain, () => {
-      if (subCommand._executableHandler) {
+      if (false) {
         this._executeSubCommand(subCommand, operands.concat(unknown));
       } else {
killedBy: when subcommand executable fails with other error and exitOverride then return in custom wrapper
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "commander.executeSubCommandAsync"
Received: "ERR_UNHANDLED_ERROR"

[Killed] BlockStatement
lib/command.js:1365:42
       'preSubcommand',
     );
     promiseChain = this._chainOrCall(promiseChain, () => {
-      if (subCommand._executableHandler) {
-        this._executeSubCommand(subCommand, operands.concat(unknown));
-      } else {
+      if (subCommand._executableHandler) {} else {
         return subCommand._parseCommand(operands, unknown);
       }
killedBy: when subcommand executable fails with other error and exitOverride then return in custom wrapper
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "commander.executeSubCommandAsync"
Received: "ERR_UNHANDLED_ERROR"

[Killed] BlockStatement
lib/command.js:1367:14
     promiseChain = this._chainOrCall(promiseChain, () => {
       if (subCommand._executableHandler) {
         this._executeSubCommand(subCommand, operands.concat(unknown));
-      } else {
-        return subCommand._parseCommand(operands, unknown);
-      }
+      } else {}
     });
     return promiseChain;
killedBy: .exitOverride and error details when specify command without required argument then throw CommanderError
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
lib/command.js:1381:40
    * @private
    */
 
-  _dispatchHelpCommand(subcommandName) {
-    if (!subcommandName) {
-      this.help();
-    }
-    const subCommand = this._findCommand(subcommandName);
-    if (subCommand && !subCommand._executableHandler) {
-      subCommand.help();
-    }
-
-    // Fallback to parsing the help flag to invoke the help.
-    return this._dispatchSubcommand(
-      subcommandName,
-      [],
-      [this._getHelpOption()?.long ?? this._getHelpOption()?.short ?? '--help'],
-    );
-  }
+  _dispatchHelpCommand(subcommandName) {}
 
   /**
killedBy: program with positionalOptions and subcommand help: when user args ["help"] then program/sub help called 1/0
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0
