[Killed] BooleanLiteral
lib/command.js:1382:9
    */
 
   _dispatchHelpCommand(subcommandName) {
-    if (!subcommandName) {
+    if (subcommandName) {
       this.help();
     }
killedBy: program with positionalOptions and subcommand help: when user args ["help", "sub"] then program/sub help called 0/1
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 0
Received number of calls: 1

[Killed] ConditionalExpression
lib/command.js:1382:9
    */
 
   _dispatchHelpCommand(subcommandName) {
-    if (!subcommandName) {
+    if (true) {
       this.help();
     }
killedBy: program with positionalOptions and subcommand help: when user args ["help", "sub"] then program/sub help called 0/1
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 0
Received number of calls: 1

[Killed] LogicalOperator
lib/command.js:1386:9
       this.help();
     }
     const subCommand = this._findCommand(subcommandName);
-    if (subCommand && !subCommand._executableHandler) {
+    if (subCommand || !subCommand._executableHandler) {
       subCommand.help();
     }
killedBy: help command processed on correct command when "program help unknown" then program
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "program"
Received message:   "Cannot read properties of undefined (reading '_executableHandler')"

      2076 |       }
      2077 |       const subCommand = this._findCommand(subcommandName);

[Killed] ConditionalExpression
lib/command.js:1386:9
       this.help();
     }
     const subCommand = this._findCommand(subcommandName);
-    if (subCommand && !subCommand._executableHandler) {
+    if (false) {
       subCommand.help();
     }
killedBy: help command processed on correct command when no long help flag then "help sub" works
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "sub help"
Received message:   "(outputHelp)"

      769 |         } else {
      770 |           stryCov_9fa48("305");
    > 771 |           this._exitCallback(new CommanderError(exitCode, code, message));

[NoCoverage] OptionalChaining
lib/command.js:1394:39
     return this._dispatchSubcommand(
       subcommandName,
       [],
-      [this._getHelpOption()?.long ?? this._getHelpOption()?.short ?? '--help'],
+      [this._getHelpOption()?.long ?? this._getHelpOption().short ?? '--help'],
     );
   }

[Survived] OptionalChaining
lib/command.js:1394:8
     return this._dispatchSubcommand(
       subcommandName,
       [],
-      [this._getHelpOption()?.long ?? this._getHelpOption()?.short ?? '--help'],
+      [this._getHelpOption().long ?? this._getHelpOption()?.short ?? '--help'],
     );
   }

[Killed] BlockStatement
lib/command.js:1404:29
    * @private
    */
 
-  _checkNumberOfArguments() {
-    // too few
-    this.registeredArguments.forEach((arg, i) => {
-      if (arg.required && this.args[i] == null) {
-        this.missingArgument(arg.name());
-      }
-    });
-    // too many
-    if (
-      this.registeredArguments.length > 0 &&
-      this.registeredArguments[this.registeredArguments.length - 1].variadic
-    ) {
-      return;
-    }
-    if (this.args.length > this.registeredArguments.length) {
-      this._excessArguments(this.args);
-    }
-  }
+  _checkNumberOfArguments() {}
 
   /**
killedBy: .exitOverride and error details when specify command without required argument then throw CommanderError
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
lib/command.js:1406:50
 
   _checkNumberOfArguments() {
     // too few
-    this.registeredArguments.forEach((arg, i) => {
-      if (arg.required && this.args[i] == null) {
-        this.missingArgument(arg.name());
-      }
-    });
+    this.registeredArguments.forEach((arg, i) => {});
     // too many
     if (
killedBy: .exitOverride and error details when specify command without required argument then throw CommanderError
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
lib/command.js:1407:11
   _checkNumberOfArguments() {
     // too few
     this.registeredArguments.forEach((arg, i) => {
-      if (arg.required && this.args[i] == null) {
+      if (false) {
         this.missingArgument(arg.name());
       }
killedBy: .exitOverride and error details when specify command without required argument then throw CommanderError
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
lib/command.js:1407:49
   _checkNumberOfArguments() {
     // too few
     this.registeredArguments.forEach((arg, i) => {
-      if (arg.required && this.args[i] == null) {
-        this.missingArgument(arg.name());
-      }
+      if (arg.required && this.args[i] == null) {}
     });
     // too many
killedBy: when .action on program with required argument via .arguments and argument not supplied then action not called
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
lib/command.js:1413:7
     });
     // too many
     if (
-      this.registeredArguments.length > 0 &&
-      this.registeredArguments[this.registeredArguments.length - 1].variadic
+      true
     ) {
       return;
killedBy: .exitOverride and error details when specify excess argument then throw CommanderError
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ArithmeticOperator
lib/command.js:1414:32
     // too many
     if (
       this.registeredArguments.length > 0 &&
-      this.registeredArguments[this.registeredArguments.length - 1].variadic
+      this.registeredArguments[this.registeredArguments.length + 1].variadic
     ) {
       return;
killedBy: when .action called then program.args only contains args
statusReason: TypeError: Cannot read properties of undefined (reading 'variadic')

[Killed] BlockStatement
lib/command.js:1418:61
     ) {
       return;
     }
-    if (this.args.length > this.registeredArguments.length) {
-      this._excessArguments(this.args);
-    }
+    if (this.args.length > this.registeredArguments.length) {}
   }
 
killedBy: allowExcessArguments when action handler: true when specify excess program argument then error by default
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
lib/command.js:1418:9
     ) {
       return;
     }
-    if (this.args.length > this.registeredArguments.length) {
+    if (false) {
       this._excessArguments(this.args);
     }
killedBy: allowExcessArguments when action handler: true when specify excess program argument then error by default
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] BlockStatement
lib/command.js:1430:55
    */
 
   _processArguments() {
-    const myParseArg = (argument, value, previous) => {
-      // Extra processing for nice error message on parsing failure.
-      let parsedValue = value;
-      if (value !== null && argument.parseArg) {
-        const invalidValueMessage = `error: command-argument value '${value}' is invalid for argument '${argument.name()}'.`;
-        parsedValue = this._callParseArg(
-          argument,
-          value,
-          previous,
-          invalidValueMessage,
-        );
-      }
-      return parsedValue;
-    };
+    const myParseArg = (argument, value, previous) => {};
 
     this._checkNumberOfArguments();
killedBy: .parse() called multiple times when parse with different arguments then processedArgs change
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   123,
+   undefined,

[Killed] ConditionalExpression
lib/command.js:1433:11
     const myParseArg = (argument, value, previous) => {
       // Extra processing for nice error message on parsing failure.
       let parsedValue = value;
-      if (value !== null && argument.parseArg) {
+      if (false) {
         const invalidValueMessage = `error: command-argument value '${value}' is invalid for argument '${argument.name()}'.`;
         parsedValue = this._callParseArg(
killedBy: when argument specified then callback called with value
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "1", undefined

Number of calls: 0

[Killed] EqualityOperator
lib/command.js:1433:11
     const myParseArg = (argument, value, previous) => {
       // Extra processing for nice error message on parsing failure.
       let parsedValue = value;
-      if (value !== null && argument.parseArg) {
+      if (value === null && argument.parseArg) {
         const invalidValueMessage = `error: command-argument value '${value}' is invalid for argument '${argument.name()}'.`;
         parsedValue = this._callParseArg(
killedBy: when argument specified then callback called with value
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "1", undefined

Number of calls: 0

[Killed] StringLiteral
lib/command.js:1434:37
       // Extra processing for nice error message on parsing failure.
       let parsedValue = value;
       if (value !== null && argument.parseArg) {
-        const invalidValueMessage = `error: command-argument value '${value}' is invalid for argument '${argument.name()}'.`;
+        const invalidValueMessage = ``;
         parsedValue = this._callParseArg(
           argument,
killedBy: .exitOverride and error details when command argument not in choices then throw CommanderError
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "error: command-argument value 'green' is invalid for argument 'shade'. Allowed choices are red, blue."
Received: " Allowed choices are red, blue."

[Killed] BlockStatement
lib/command.js:1448:62
     this._checkNumberOfArguments();
 
     const processedArgs = [];
-    this.registeredArguments.forEach((declaredArg, index) => {
-      let value = declaredArg.defaultValue;
-      if (declaredArg.variadic) {
-        // Collect together remaining arguments for passing together as an array.
-        if (index < this.args.length) {
-          value = this.args.slice(index);
-          if (declaredArg.parseArg) {
-            value = value.reduce((processed, v) => {
-              return myParseArg(declaredArg, v, processed);
-            }, declaredArg.defaultValue);
-          }
-        } else if (value === undefined) {
-          value = [];
-        }
-      } else if (index < this.args.length) {
-        value = this.args[index];
-        if (declaredArg.parseArg) {
-          value = myParseArg(declaredArg, value, declaredArg.defaultValue);
-        }
-      }
-      processedArgs[index] = value;
-    });
+    this.registeredArguments.forEach((declaredArg, index) => {});
     this.processedArgs = processedArgs;
   }
killedBy: when .action on program with required argument via .arguments and argument supplied then action called
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "my-file",
+ undefined,
  {},

[Killed] ConditionalExpression
lib/command.js:1450:11
     const processedArgs = [];
     this.registeredArguments.forEach((declaredArg, index) => {
       let value = declaredArg.defaultValue;
-      if (declaredArg.variadic) {
+      if (true) {
         // Collect together remaining arguments for passing together as an array.
         if (index < this.args.length) {
killedBy: when .action on program with required argument via .arguments and argument supplied then action called
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "my-file",
+ ["my-file"],
  {},

[Killed] ConditionalExpression
lib/command.js:1450:11
     const processedArgs = [];
     this.registeredArguments.forEach((declaredArg, index) => {
       let value = declaredArg.defaultValue;
-      if (declaredArg.variadic) {
+      if (false) {
         // Collect together remaining arguments for passing together as an array.
         if (index < this.args.length) {
killedBy: variadic argument when no extra arguments specified for program then variadic arg is empty array
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "id",
- [],
+ undefined,

[Killed] ConditionalExpression
lib/command.js:1452:13
       let value = declaredArg.defaultValue;
       if (declaredArg.variadic) {
         // Collect together remaining arguments for passing together as an array.
-        if (index < this.args.length) {
+        if (false) {
           value = this.args.slice(index);
           if (declaredArg.parseArg) {
killedBy: program with passThrough when action handler and unknown option after command-argument then option passed through
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Array [
-   "arg",
-   "--pass",

[Killed] EqualityOperator
lib/command.js:1452:13
       let value = declaredArg.defaultValue;
       if (declaredArg.variadic) {
         // Collect together remaining arguments for passing together as an array.
-        if (index < this.args.length) {
+        if (index >= this.args.length) {
           value = this.args.slice(index);
           if (declaredArg.parseArg) {
killedBy: variadic argument when extra arguments specified for program then variadic arg is array of values
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "id",
- Array [
-   "a",

[Killed] MethodExpression
lib/command.js:1453:19
       if (declaredArg.variadic) {
         // Collect together remaining arguments for passing together as an array.
         if (index < this.args.length) {
-          value = this.args.slice(index);
+          value = this.args;
           if (declaredArg.parseArg) {
             value = value.reduce((processed, v) => {
killedBy: variadic argument when extra arguments specified for program then variadic arg is array of values
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "id",
  Array [
+   "id",

[Killed] ConditionalExpression
lib/command.js:1454:15
         // Collect together remaining arguments for passing together as an array.
         if (index < this.args.length) {
           value = this.args.slice(index);
-          if (declaredArg.parseArg) {
+          if (true) {
             value = value.reduce((processed, v) => {
               return myParseArg(declaredArg, v, processed);
killedBy: variadic argument when extra arguments specified for program then variadic arg is array of values
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "id",
- ["a", "b", "c"],
+ "c",

[Killed] ConditionalExpression
lib/command.js:1454:15
         // Collect together remaining arguments for passing together as an array.
         if (index < this.args.length) {
           value = this.args.slice(index);
-          if (declaredArg.parseArg) {
+          if (false) {
             value = value.reduce((processed, v) => {
               return myParseArg(declaredArg, v, processed);
killedBy: when variadic argument specified multiple times then callback called with value and previousValue
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[Killed] BlockStatement
lib/command.js:1455:52
         if (index < this.args.length) {
           value = this.args.slice(index);
           if (declaredArg.parseArg) {
-            value = value.reduce((processed, v) => {
-              return myParseArg(declaredArg, v, processed);
-            }, declaredArg.defaultValue);
+            value = value.reduce((processed, v) => {}, declaredArg.defaultValue);
           }
         } else if (value === undefined) {
killedBy: variadic argument when variadic used with choices and one value then set in array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["one"]
Received: undefined

[Killed] ConditionalExpression
lib/command.js:1459:20
               return myParseArg(declaredArg, v, processed);
             }, declaredArg.defaultValue);
           }
-        } else if (value === undefined) {
+        } else if (false) {
           value = [];
         }
killedBy: variadic argument when no extra arguments specified for program then variadic arg is empty array
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "id",
- [],
+ undefined,

[Killed] BlockStatement
lib/command.js:1459:41
               return myParseArg(declaredArg, v, processed);
             }, declaredArg.defaultValue);
           }
-        } else if (value === undefined) {
-          value = [];
-        }
+        } else if (value === undefined) {}
       } else if (index < this.args.length) {
         value = this.args[index];
killedBy: variadic argument when no extra arguments specified for program then variadic arg is empty array
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "id",
- [],
+ undefined,

[Killed] BlockStatement
lib/command.js:1462:44
         } else if (value === undefined) {
           value = [];
         }
-      } else if (index < this.args.length) {
-        value = this.args[index];
-        if (declaredArg.parseArg) {
-          value = myParseArg(declaredArg, value, declaredArg.defaultValue);
-        }
-      }
+      } else if (index < this.args.length) {}
       processedArgs[index] = value;
     });
killedBy: variadic argument when no extra arguments specified for program then variadic arg is empty array
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "id",
+ undefined,
  [],

[Killed] ConditionalExpression
lib/command.js:1462:18
         } else if (value === undefined) {
           value = [];
         }
-      } else if (index < this.args.length) {
+      } else if (true) {
         value = this.args[index];
         if (declaredArg.parseArg) {
killedBy: when argument not specified then callback not called
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: undefined, undefined

[Killed] ConditionalExpression
lib/command.js:1464:13
         }
       } else if (index < this.args.length) {
         value = this.args[index];
-        if (declaredArg.parseArg) {
+        if (false) {
           value = myParseArg(declaredArg, value, declaredArg.defaultValue);
         }
killedBy: when command argument is not in choices then error
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] BlockStatement
lib/command.js:1464:35
         }
       } else if (index < this.args.length) {
         value = this.args[index];
-        if (declaredArg.parseArg) {
-          value = myParseArg(declaredArg, value, declaredArg.defaultValue);
-        }
+        if (declaredArg.parseArg) {}
       }
       processedArgs[index] = value;
killedBy: when argument specified then callback called with value
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "1", undefined

Number of calls: 0

[Killed] BlockStatement
lib/command.js:1482:29
    * @private
    */
 
-  _chainOrCall(promise, fn) {
-    // thenable
-    if (promise && promise.then && typeof promise.then === 'function') {
-      // already have a promise, chain callback
-      return promise.then(() => fn());
-    }
-    // callback might return a promise
-    return fn();
-  }
+  _chainOrCall(promise, fn) {}
 
   /**
killedBy: .exitOverride and error details when specify command without required argument then throw CommanderError
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
lib/command.js:1484:9
 
   _chainOrCall(promise, fn) {
     // thenable
-    if (promise && promise.then && typeof promise.then === 'function') {
+    if (false) {
       // already have a promise, chain callback
       return promise.then(() => fn());
killedBy: action hooks async when async preAction then async from preAction
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "action",

[Killed] EqualityOperator
lib/command.js:1484:36
 
   _chainOrCall(promise, fn) {
     // thenable
-    if (promise && promise.then && typeof promise.then === 'function') {
+    if (promise && promise.then && typeof promise.then !== 'function') {
       // already have a promise, chain callback
       return promise.then(() => fn());
killedBy: action hooks async when async preAction then async from preAction
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "action",

[Killed] ArrowFunction
lib/command.js:1486:27
     // thenable
     if (promise && promise.then && typeof promise.then === 'function') {
       // already have a promise, chain callback
-      return promise.then(() => fn());
+      return promise.then(() => undefined);
     }
     // callback might return a promise
killedBy: action hooks async when async preAction then async from preAction
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    "before",
-   "action",

[Killed] BlockStatement
lib/command.js:1500:37
    * @private
    */
 
-  _chainOrCallHooks(promise, event) {
-    let result = promise;
-    const hooks = [];
-    this._getCommandAndAncestors()
-      .reverse()
-      .filter((cmd) => cmd._lifeCycleHooks[event] !== undefined)
-      .forEach((hookedCommand) => {
-        hookedCommand._lifeCycleHooks[event].forEach((callback) => {
-          hooks.push({ hookedCommand, callback });
-        });
-      });
-    if (event === 'postAction') {
-      hooks.reverse();
-    }
-
-    hooks.forEach((hookDetail) => {
-      result = this._chainOrCall(result, () => {
-        return hookDetail.callback(hookDetail.hookedCommand, this);
-      });
-    });
-    return result;
-  }
+  _chainOrCallHooks(promise, event) {}
 
   /**
killedBy: when action is async then can await parseAsync
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
lib/command.js:1503:5
   _chainOrCallHooks(promise, event) {
     let result = promise;
     const hooks = [];
-    this._getCommandAndAncestors()
-      .reverse()
+    this._getCommandAndAncestors()
       .filter((cmd) => cmd._lifeCycleHooks[event] !== undefined)
       .forEach((hookedCommand) => {
killedBy: action hooks with synchronous hooks, order when hook preAction at program and sub then hooks called program then sub
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "program",
    "sub",

[Killed] ArrowFunction
lib/command.js:1505:15
     const hooks = [];
     this._getCommandAndAncestors()
       .reverse()
-      .filter((cmd) => cmd._lifeCycleHooks[event] !== undefined)
+      .filter(() => undefined)
       .forEach((hookedCommand) => {
         hookedCommand._lifeCycleHooks[event].forEach((callback) => {
killedBy: action hooks with synchronous hooks, order when hook preAction then hook called before action
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
-   "before",
    "action",

[Killed] ConditionalExpression
lib/command.js:1505:24
     const hooks = [];
     this._getCommandAndAncestors()
       .reverse()
-      .filter((cmd) => cmd._lifeCycleHooks[event] !== undefined)
+      .filter((cmd) => false)
       .forEach((hookedCommand) => {
         hookedCommand._lifeCycleHooks[event].forEach((callback) => {
killedBy: action hooks with synchronous hooks, order when hook preAction then hook called before action
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
-   "before",
    "action",

[Killed] BlockStatement
lib/command.js:1506:35
     this._getCommandAndAncestors()
       .reverse()
       .filter((cmd) => cmd._lifeCycleHooks[event] !== undefined)
-      .forEach((hookedCommand) => {
-        hookedCommand._lifeCycleHooks[event].forEach((callback) => {
-          hooks.push({ hookedCommand, callback });
-        });
-      });
+      .forEach((hookedCommand) => {});
     if (event === 'postAction') {
       hooks.reverse();
killedBy: action hooks with synchronous hooks, order when hook preAction then hook called before action
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
-   "before",
    "action",

[Killed] BlockStatement
lib/command.js:1507:68
       .reverse()
       .filter((cmd) => cmd._lifeCycleHooks[event] !== undefined)
       .forEach((hookedCommand) => {
-        hookedCommand._lifeCycleHooks[event].forEach((callback) => {
-          hooks.push({ hookedCommand, callback });
-        });
+        hookedCommand._lifeCycleHooks[event].forEach((callback) => {});
       });
     if (event === 'postAction') {
killedBy: action hooks with synchronous hooks, order when hook preAction then hook called before action
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
-   "before",
    "action",

[Killed] EqualityOperator
lib/command.js:1511:9
           hooks.push({ hookedCommand, callback });
         });
       });
-    if (event === 'postAction') {
+    if (event !== 'postAction') {
       hooks.reverse();
     }
killedBy: action hooks with synchronous hooks, order when hook preAction twice then hooks called FIFO
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "1",
    "2",

[Killed] BlockStatement
lib/command.js:1511:33
           hooks.push({ hookedCommand, callback });
         });
       });
-    if (event === 'postAction') {
-      hooks.reverse();
-    }
+    if (event === 'postAction') {}
 
     hooks.forEach((hookDetail) => {
killedBy: action hooks with synchronous hooks, order when hook postAction twice then hooks called LIFO
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "action",
-   "2",

[Killed] MethodExpression
lib/command.js:1512:7
         });
       });
     if (event === 'postAction') {
-      hooks.reverse();
+      hooks;
     }
 
killedBy: action hooks with synchronous hooks, order when hook postAction twice then hooks called LIFO
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "action",
-   "2",

[Killed] BlockStatement
lib/command.js:1515:35
       hooks.reverse();
     }
 
-    hooks.forEach((hookDetail) => {
-      result = this._chainOrCall(result, () => {
-        return hookDetail.callback(hookDetail.hookedCommand, this);
-      });
-    });
+    hooks.forEach((hookDetail) => {});
     return result;
   }
killedBy: action hooks with synchronous hooks, order when hook preAction then hook called before action
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
-   "before",
    "action",

[Killed] BlockStatement
lib/command.js:1516:48
     }
 
     hooks.forEach((hookDetail) => {
-      result = this._chainOrCall(result, () => {
-        return hookDetail.callback(hookDetail.hookedCommand, this);
-      });
+      result = this._chainOrCall(result, () => {});
     });
     return result;
killedBy: action hooks with synchronous hooks, order when hook preAction then hook called before action
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
-   "before",
    "action",

[Killed] BlockStatement
lib/command.js:1532:58
    * @private
    */
 
-  _chainOrCallSubCommandHook(promise, subCommand, event) {
-    let result = promise;
-    if (this._lifeCycleHooks[event] !== undefined) {
-      this._lifeCycleHooks[event].forEach((hook) => {
-        result = this._chainOrCall(result, () => {
-          return hook(this, subCommand);
-        });
-      });
-    }
-    return result;
-  }
+  _chainOrCallSubCommandHook(promise, subCommand, event) {}
 
   /**
killedBy: action hooks async preSubcommand hook should work
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
-   0,
    1,

[Killed] EqualityOperator
lib/command.js:1534:9
 
   _chainOrCallSubCommandHook(promise, subCommand, event) {
     let result = promise;
-    if (this._lifeCycleHooks[event] !== undefined) {
+    if (this._lifeCycleHooks[event] === undefined) {
       this._lifeCycleHooks[event].forEach((hook) => {
         result = this._chainOrCall(result, () => {
killedBy: action hooks with synchronous hooks, order when hook preAction at program and sub then hooks called program then sub
statusReason: TypeError: Cannot read properties of undefined (reading 'forEach')
