[Killed] ConditionalExpression
lib/command.js:1712:11
       const conflictingAndDefined = definedNonDefaultOptions.find((defined) =>
         option.conflictsWith.includes(defined.attributeName()),
       );
-      if (conflictingAndDefined) {
+      if (true) {
         this._conflictingOption(option, conflictingAndDefined);
       }
killedBy: command with conflicting options should call action if there are no explicit conflicting options set
statusReason: TypeError: Cannot read properties of undefined (reading 'attributeName')

[Killed] BlockStatement
lib/command.js:1724:33
    *
    * @private
    */
-  _checkForConflictingOptions() {
-    // Walk up hierarchy so can call in subcommand after checking for displaying help.
-    this._getCommandAndAncestors().forEach((cmd) => {
-      cmd._checkForConflictingLocalOptions();
-    });
-  }
+  _checkForConflictingOptions() {}
 
   /**
killedBy: .exitOverride and error details when has conflicting option then throw CommanderError
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: CommanderError

Received value has no prototype
Received value: undefined

[Killed] BlockStatement
lib/command.js:1726:53
    */
   _checkForConflictingOptions() {
     // Walk up hierarchy so can call in subcommand after checking for displaying help.
-    this._getCommandAndAncestors().forEach((cmd) => {
-      cmd._checkForConflictingLocalOptions();
-    });
+    this._getCommandAndAncestors().forEach((cmd) => {});
   }
 
killedBy: .exitOverride and error details when has conflicting option then throw CommanderError
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: CommanderError

Received value has no prototype
Received value: undefined

[Survived] MethodExpression
lib/command.js:1753:18
     const operands = []; // operands, not options or values
     const unknown = []; // first unknown option and remaining unknown args
     let dest = operands;
-    const args = argv.slice();
+    const args = argv;
 
     function maybeOption(arg) {

[Survived] EqualityOperator
lib/command.js:1756:14
     const args = argv.slice();
 
     function maybeOption(arg) {
-      return arg.length > 1 && arg[0] === '-';
+      return arg.length >= 1 && arg[0] === '-';
     }
 

[Survived] ConditionalExpression
lib/command.js:1756:14
     const args = argv.slice();
 
     function maybeOption(arg) {
-      return arg.length > 1 && arg[0] === '-';
+      return true && arg[0] === '-';
     }
 

[Killed] Regex
lib/command.js:1761:12
 
     const negativeNumberArg = (arg) => {
       // return false if not a negative number
-      if (!/^-\d*\.?\d+(e[+-]?\d+)?$/.test(arg)) return false;
+      if (!/^-\d*\.?\d+(e[+-]\d+)?$/.test(arg)) return false;
       // negative number is ok unless digit used as an option in command hierarchy
       return !this._getCommandAndAncestors().some((cmd) =>
killedBy: when option-argument for short optional is -1e3 then consumed=true
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ""
Received: "commander.unknownOption"

[Killed] ArrowFunction
lib/command.js:1763:51
       // return false if not a negative number
       if (!/^-\d*\.?\d+(e[+-]?\d+)?$/.test(arg)) return false;
       // negative number is ok unless digit used as an option in command hierarchy
-      return !this._getCommandAndAncestors().some((cmd) =>
-        cmd.options
-          .map((opt) => opt.short)
-          .some((short) => /^-\d$/.test(short)),
+      return !this._getCommandAndAncestors().some(() => undefined,
       );
     };
killedBy: when digit option defined and option-argument is -.1 then negative not consumed
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "commander.unknownOption"
Received: ""

[Killed] MethodExpression
lib/command.js:1763:15
       // return false if not a negative number
       if (!/^-\d*\.?\d+(e[+-]?\d+)?$/.test(arg)) return false;
       // negative number is ok unless digit used as an option in command hierarchy
-      return !this._getCommandAndAncestors().some((cmd) =>
-        cmd.options
-          .map((opt) => opt.short)
-          .some((short) => /^-\d$/.test(short)),
-      );
+      return !this._getCommandAndAncestors().every(cmd => cmd.options.map(opt => opt.short).some(short => /^-\d$/.test(short)));
     };
 
killedBy: when program has digit option then negatives not allowed in leaf command
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ArrowFunction
lib/command.js:1765:16
       // negative number is ok unless digit used as an option in command hierarchy
       return !this._getCommandAndAncestors().some((cmd) =>
         cmd.options
-          .map((opt) => opt.short)
+          .map(() => undefined)
           .some((short) => /^-\d$/.test(short)),
       );
killedBy: when digit option defined and option-argument is -.1 then negative not consumed
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "commander.unknownOption"
Received: ""

[Killed] ArrowFunction
lib/command.js:1766:17
       return !this._getCommandAndAncestors().some((cmd) =>
         cmd.options
           .map((opt) => opt.short)
-          .some((short) => /^-\d$/.test(short)),
+          .some(() => undefined),
       );
     };
killedBy: when digit option defined and option-argument is -.1 then negative not consumed
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "commander.unknownOption"
Received: ""

[Survived] Regex
lib/command.js:1766:28
       return !this._getCommandAndAncestors().some((cmd) =>
         cmd.options
           .map((opt) => opt.short)
-          .some((short) => /^-\d$/.test(short)),
+          .some((short) => /^-\d/.test(short)),
       );
     };

[Killed] EqualityOperator
lib/command.js:1777:13
 
       // literal
       if (arg === '--') {
-        if (dest === unknown) dest.push(arg);
+        if (dest !== unknown) dest.push(arg);
         dest.push(...args);
         break;
killedBy: parseOptions when program has literal before known flag then option returned as operand
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Object {
    "operands": Array [
+     "--",

[Killed] ConditionalExpression
lib/command.js:1777:13
 
       // literal
       if (arg === '--') {
-        if (dest === unknown) dest.push(arg);
+        if (false) dest.push(arg);
         dest.push(...args);
         break;
killedBy: parseOptions when program has literal after unknown option then literal preserved too
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Object {
    "operands": Array [],
    "unknown": Array [

[Killed] LogicalOperator
lib/command.js:1783:9
       }
 
       if (
-        activeVariadicOption &&
-        (!maybeOption(arg) || negativeNumberArg(arg))
+        activeVariadicOption || !maybeOption(arg) || negativeNumberArg(arg)
       ) {
         this.emit(`option:${activeVariadicOption.name()}`, arg);
killedBy: when option-argument for short optional... is -1e-3.0 then consumed=false
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "commander.unknownOption"
Received: ""

[Killed] ConditionalExpression
lib/command.js:1783:9
       }
 
       if (
-        activeVariadicOption &&
-        (!maybeOption(arg) || negativeNumberArg(arg))
+        true
       ) {
         this.emit(`option:${activeVariadicOption.name()}`, arg);
killedBy: when option-argument for short optional is -.1 then consumed=true
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ""
Received: undefined

[Killed] ConditionalExpression
lib/command.js:1784:10
 
       if (
         activeVariadicOption &&
-        (!maybeOption(arg) || negativeNumberArg(arg))
+        (true)
       ) {
         this.emit(`option:${activeVariadicOption.name()}`, arg);
killedBy: when option-argument for short optional... is -1e-3.0 then consumed=false
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "commander.unknownOption"
Received: ""

[Survived] ConditionalExpression
lib/command.js:1791:11
       }
       activeVariadicOption = null;
 
-      if (maybeOption(arg)) {
+      if (true) {
         const option = this._findOption(arg);
         // recognised option, call listener to assign value with possible custom processing

[Killed] ConditionalExpression
lib/command.js:1794:13
       if (maybeOption(arg)) {
         const option = this._findOption(arg);
         // recognised option, call listener to assign value with possible custom processing
-        if (option) {
+        if (true) {
           if (option.required) {
             const value = args.shift();
killedBy: when option-argument for short optional is -1e-3.0 then consumed=false
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "commander.unknownOption"
Received: undefined

[Killed] ConditionalExpression
lib/command.js:1797:17
         if (option) {
           if (option.required) {
             const value = args.shift();
-            if (value === undefined) this.optionMissingArgument(option);
+            if (false) this.optionMissingArgument(option);
             this.emit(`option:${option.name()}`, value);
           } else if (option.optional) {
killedBy: showHelpAfterError with message when missing option-argument then shows help
statusReason: TypeError: Cannot read properties of undefined (reading 'code')

[Killed] StringLiteral
lib/command.js:1798:23
           if (option.required) {
             const value = args.shift();
             if (value === undefined) this.optionMissingArgument(option);
-            this.emit(`option:${option.name()}`, value);
+            this.emit(``, value);
           } else if (option.optional) {
             let value = null;
killedBy: when complex example with negative numbers then all consumed
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 0

  Object {
    "M": Array [
-     "-50",

[Killed] ConditionalExpression
lib/command.js:1803:15
             let value = null;
             // historical behaviour is optional value is following arg unless an option
             if (
-              args.length > 0 &&
+              true &&
               (!maybeOption(args[0]) || negativeNumberArg(args[0]))
             ) {
killedBy: required program option with mandatory value specified when program has optional value flag specified then true
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
lib/command.js:1803:15
             let value = null;
             // historical behaviour is optional value is following arg unless an option
             if (
-              args.length > 0 &&
+              args.length >= 0 &&
               (!maybeOption(args[0]) || negativeNumberArg(args[0]))
             ) {
killedBy: required program option with mandatory value specified when program has optional value flag specified then true
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] StringLiteral
lib/command.js:1808:23
             ) {
               value = args.shift();
             }
-            this.emit(`option:${option.name()}`, value);
+            this.emit(``, value);
           } else {
             // boolean flag
killedBy: required program option with mandatory value specified when program has optional value flag specified then true
statusReason: CommanderError: error: required option '--cheese [type]' not specified

[Survived] LogicalOperator
lib/command.js:1819:11
       }
 
       // Look for combo options following single dash, eat first one if known.
-      if (arg.length > 2 && arg[0] === '-' && arg[1] !== '-') {
+      if (arg.length > 2 && arg[0] === '-' || arg[1] !== '-') {
         const option = this._findOption(`-${arg[1]}`);
         if (option) {

[Survived] ConditionalExpression
lib/command.js:1819:47
       }
 
       // Look for combo options following single dash, eat first one if known.
-      if (arg.length > 2 && arg[0] === '-' && arg[1] !== '-') {
+      if (arg.length > 2 && arg[0] === '-' && true) {
         const option = this._findOption(`-${arg[1]}`);
         if (option) {

[Killed] ConditionalExpression
lib/command.js:1821:13
       // Look for combo options following single dash, eat first one if known.
       if (arg.length > 2 && arg[0] === '-' && arg[1] !== '-') {
         const option = this._findOption(`-${arg[1]}`);
-        if (option) {
+        if (true) {
           if (
             option.required ||
killedBy: when option-argument for short optional is -1e-3.0 then consumed=false
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "commander.unknownOption"
Received: undefined

[Killed] ConditionalExpression
lib/command.js:1823:13
         const option = this._findOption(`-${arg[1]}`);
         if (option) {
           if (
-            option.required ||
-            (option.optional && this._combineFlagAndOptionalValue)
+            true
           ) {
             // option with value following in same argument
killedBy: .parse() called multiple times when use increaseVerbosity example then option value resets
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "verbose": 3,
+   "verbose": 1,

[Killed] LogicalOperator
lib/command.js:1824:14
         if (option) {
           if (
             option.required ||
-            (option.optional && this._combineFlagAndOptionalValue)
+            (option.optional || this._combineFlagAndOptionalValue)
           ) {
             // option with value following in same argument
killedBy: Utility Conventions when program has combo known boolean short flags then arg removed
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 1

  Object {
-   "aaa": true,
-   "bbb": true,

[Killed] BlockStatement
lib/command.js:1825:13
           if (
             option.required ||
             (option.optional && this._combineFlagAndOptionalValue)
-          ) {
-            // option with value following in same argument
-            this.emit(`option:${option.name()}`, arg.slice(2));
-          } else {
+          ) {} else {
             // boolean option, emit and put back remainder of arg for further processing
             this.emit(`option:${option.name()}`);
killedBy: Utility Conventions when program has combo known short option and required value then arg removed
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "ccc": "value",
- }

[Killed] MethodExpression
lib/command.js:1827:50
             (option.optional && this._combineFlagAndOptionalValue)
           ) {
             // option with value following in same argument
-            this.emit(`option:${option.name()}`, arg.slice(2));
+            this.emit(`option:${option.name()}`, arg);
           } else {
             // boolean option, emit and put back remainder of arg for further processing
killedBy: Utility Conventions when program has combo known short option and required value then arg removed
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "ccc": "value",
+   "ccc": "-cvalue",

[Killed] BlockStatement
lib/command.js:1828:18
           ) {
             // option with value following in same argument
             this.emit(`option:${option.name()}`, arg.slice(2));
-          } else {
-            // boolean option, emit and put back remainder of arg for further processing
-            this.emit(`option:${option.name()}`);
-            args.unshift(`-${arg.slice(2)}`);
-          }
+          } else {}
           continue;
         }
killedBy: Utility Conventions when program has combo known boolean short flags then arg removed
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Object {
-   "aaa": true,
-   "bbb": true,

[Killed] StringLiteral
lib/command.js:1830:23
             this.emit(`option:${option.name()}`, arg.slice(2));
           } else {
             // boolean option, emit and put back remainder of arg for further processing
-            this.emit(`option:${option.name()}`);
+            this.emit(``);
             args.unshift(`-${arg.slice(2)}`);
           }
killedBy: Utility Conventions when program has combo known boolean short flags then arg removed
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Object {
-   "aaa": true,
    "bbb": true,

[Killed] ConditionalExpression
lib/command.js:1838:11
       }
 
       // Look for known long flag with value, like --foo=bar
-      if (/^--[^=]+=/.test(arg)) {
+      if (true) {
         const index = arg.indexOf('=');
         const option = this._findOption(arg.slice(0, index));
killedBy: .parse() called multiple times when parse with different arguments then processedArgs change
statusReason: TypeError: arg.indexOf is not a function

[Killed] LogicalOperator
lib/command.js:1841:13
       if (/^--[^=]+=/.test(arg)) {
         const index = arg.indexOf('=');
         const option = this._findOption(arg.slice(0, index));
-        if (option && (option.required || option.optional)) {
+        if (option || option.required || option.optional) {
           this.emit(`option:${option.name()}`, arg.slice(index + 1));
           continue;
killedBy: Utility Conventions when program has unknown long flag=value then arg preserved
statusReason: TypeError: Cannot read properties of undefined (reading 'required')

[Killed] ConditionalExpression
lib/command.js:1841:13
       if (/^--[^=]+=/.test(arg)) {
         const index = arg.indexOf('=');
         const option = this._findOption(arg.slice(0, index));
-        if (option && (option.required || option.optional)) {
+        if (true) {
           this.emit(`option:${option.name()}`, arg.slice(index + 1));
           continue;
killedBy: Utility Conventions when program has unknown long flag=value then arg preserved
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Killed] ArithmeticOperator
lib/command.js:1842:58
         const index = arg.indexOf('=');
         const option = this._findOption(arg.slice(0, index));
         if (option && (option.required || option.optional)) {
-          this.emit(`option:${option.name()}`, arg.slice(index + 1));
+          this.emit(`option:${option.name()}`, arg.slice(index - 1));
           continue;
         }
killedBy: Utility Conventions when program has known long flag=value then arg removed
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "ccc": "value",
+   "ccc": "c=value",

[Killed] MethodExpression
lib/command.js:1842:48
         const index = arg.indexOf('=');
         const option = this._findOption(arg.slice(0, index));
         if (option && (option.required || option.optional)) {
-          this.emit(`option:${option.name()}`, arg.slice(index + 1));
+          this.emit(`option:${option.name()}`, arg);
           continue;
         }
killedBy: Utility Conventions when program has known long flag=value then arg removed
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "ccc": "value",
+   "ccc": "--ccc=value",

[Survived] ConditionalExpression
lib/command.js:1853:9
       // An unknown option means further arguments also classified as unknown so can be reprocessed by subcommands.
       // A negative number in a leaf command is not an unknown option.
       if (
-        dest === operands &&
+        true &&
         maybeOption(arg) &&
         !(this.commands.length === 0 && negativeNumberArg(arg))

[Killed] ConditionalExpression
lib/command.js:1855:11
       if (
         dest === operands &&
         maybeOption(arg) &&
-        !(this.commands.length === 0 && negativeNumberArg(arg))
+        !(true && negativeNumberArg(arg))
       ) {
         dest = unknown;
killedBy: when default command with digit option then negative throws
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Survived] ConditionalExpression
lib/command.js:1864:9
       if (
         (this._enablePositionalOptions || this._passThroughOptions) &&
         operands.length === 0 &&
-        unknown.length === 0
+        true
       ) {
         if (this._findCommand(arg)) {

[Killed] ConditionalExpression
lib/command.js:1868:15
       ) {
         if (this._findCommand(arg)) {
           operands.push(arg);
-          if (args.length > 0) unknown.push(...args);
+          if (false) unknown.push(...args);
           break;
         } else if (
killedBy: program with positionalOptions and subcommand when shared option after subcommand then parsed by subcommand
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "local"
Received: undefined

[Killed] EqualityOperator
lib/command.js:1868:15
       ) {
         if (this._findCommand(arg)) {
           operands.push(arg);
-          if (args.length > 0) unknown.push(...args);
+          if (args.length <= 0) unknown.push(...args);
           break;
         } else if (
killedBy: program with positionalOptions and subcommand when shared option after subcommand then parsed by subcommand
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "local"
Received: undefined

[Killed] LogicalOperator
lib/command.js:1871:11
           if (args.length > 0) unknown.push(...args);
           break;
         } else if (
-          this._getHelpCommand() &&
-          arg === this._getHelpCommand().name()
+          this._getHelpCommand() || arg === this._getHelpCommand().name()
         ) {
           operands.push(arg);
killedBy: program with passThrough when option before command-argument then option parsed
statusReason: TypeError: Cannot read properties of null (reading 'name')

[Killed] ConditionalExpression
lib/command.js:1871:11
           if (args.length > 0) unknown.push(...args);
           break;
         } else if (
-          this._getHelpCommand() &&
-          arg === this._getHelpCommand().name()
+          false
         ) {
           operands.push(arg);
killedBy: program with positionalOptions and default subcommand (called sub) help: when user args ["help"] then program/sub help called 1/0
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] EqualityOperator
lib/command.js:1872:11
           break;
         } else if (
           this._getHelpCommand() &&
-          arg === this._getHelpCommand().name()
+          arg !== this._getHelpCommand().name()
         ) {
           operands.push(arg);
killedBy: program with positionalOptions and subcommand help: when user args ["--help"] then program/sub help called 1/0
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
lib/command.js:1872:11
           break;
         } else if (
           this._getHelpCommand() &&
-          arg === this._getHelpCommand().name()
+          true
         ) {
           operands.push(arg);
killedBy: program with positionalOptions and subcommand help: when user args ["--help"] then program/sub help called 1/0
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Survived] BlockStatement
lib/command.js:1873:11
         } else if (
           this._getHelpCommand() &&
           arg === this._getHelpCommand().name()
-        ) {
-          operands.push(arg);
-          if (args.length > 0) operands.push(...args);
-          break;
-        } else if (this._defaultCommandName) {
+        ) {} else if (this._defaultCommandName) {
           unknown.push(arg);
           if (args.length > 0) unknown.push(...args);

[Killed] EqualityOperator
lib/command.js:1875:15
           arg === this._getHelpCommand().name()
         ) {
           operands.push(arg);
-          if (args.length > 0) operands.push(...args);
+          if (args.length <= 0) operands.push(...args);
           break;
         } else if (this._defaultCommandName) {
killedBy: program with positionalOptions and subcommand help: when user args ["help", "sub"] then program/sub help called 0/1
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 0
Received number of calls: 1

[Killed] ConditionalExpression
lib/command.js:1875:15
           arg === this._getHelpCommand().name()
         ) {
           operands.push(arg);
-          if (args.length > 0) operands.push(...args);
+          if (false) operands.push(...args);
           break;
         } else if (this._defaultCommandName) {
killedBy: program with positionalOptions and subcommand help: when user args ["help", "sub"] then program/sub help called 0/1
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 0
Received number of calls: 1

[Killed] ConditionalExpression
lib/command.js:1879:15
           break;
         } else if (this._defaultCommandName) {
           unknown.push(arg);
-          if (args.length > 0) unknown.push(...args);
+          if (false) unknown.push(...args);
           break;
         }
killedBy: program with positionalOptions and default subcommand (called sub) when shared option after sub argument then option read by sub
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
lib/command.js:1879:15
           break;
         } else if (this._defaultCommandName) {
           unknown.push(arg);
-          if (args.length > 0) unknown.push(...args);
+          if (args.length <= 0) unknown.push(...args);
           break;
         }
killedBy: program with positionalOptions and default subcommand (called sub) when shared option after sub argument then option read by sub
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
lib/command.js:1887:13
       // If using passThroughOptions, stop processing options at first command-argument.
       if (this._passThroughOptions) {
         dest.push(arg);
-        if (args.length > 0) dest.push(...args);
+        if (false) dest.push(...args);
         break;
       }
killedBy: program with passThrough when known option after command-argument then option passed through
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    "arg",
-   "--debug",

[Killed] EqualityOperator
lib/command.js:1887:13
       // If using passThroughOptions, stop processing options at first command-argument.
       if (this._passThroughOptions) {
         dest.push(arg);
-        if (args.length > 0) dest.push(...args);
+        if (args.length <= 0) dest.push(...args);
         break;
       }
killedBy: program with passThrough when known option after command-argument then option passed through
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    "arg",
-   "--debug",

[Killed] BlockStatement
lib/command.js:1903:10
    *
    * @return {object}
    */
-  opts() {
-    if (this._storeOptionsAsProperties) {
-      // Preserve original behaviour so backwards compatible when still using properties
-      const result = {};
-      const len = this.options.length;
-
-      for (let i = 0; i < len; i++) {
-        const key = this.options[i].attributeName();
-        result[key] =
-          key === this._versionOptionName ? this._version : this[key];
-      }
-      return result;
-    }
-
-    return this._optionValues;
-  }
+  opts() {}
 
   /**
killedBy: program with passThrough when option before command-argument then option parsed
statusReason: TypeError: Cannot read properties of undefined (reading 'debug')

[Killed] BlockStatement
lib/command.js:1904:41
    * @return {object}
    */
   opts() {
-    if (this._storeOptionsAsProperties) {
-      // Preserve original behaviour so backwards compatible when still using properties
-      const result = {};
-      const len = this.options.length;
-
-      for (let i = 0; i < len; i++) {
-        const key = this.options[i].attributeName();
-        result[key] =
-          key === this._versionOptionName ? this._version : this[key];
-      }
-      return result;
-    }
+    if (this._storeOptionsAsProperties) {}
 
     return this._optionValues;
killedBy: when .version used with storeOptionsAsProperties() then version in opts
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "version": "0.0.1",
- }

[Killed] ConditionalExpression
lib/command.js:1904:9
    * @return {object}
    */
   opts() {
-    if (this._storeOptionsAsProperties) {
+    if (false) {
       // Preserve original behaviour so backwards compatible when still using properties
       const result = {};
killedBy: when .version used with storeOptionsAsProperties() then version in opts
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "version": "0.0.1",
- }
