[Killed] LogicalOperator
lib/command.js:2078:21
       const optionKey = option.attributeName();
       const optionValue = this.getOptionValue(optionKey);
       const negativeOption = this.options.find(
-        (target) => target.negate && optionKey === target.attributeName(),
+        (target) => target.negate || optionKey === target.attributeName(),
       );
       const positiveOption = this.options.find(
killedBy: command with conflicting options should report conflict on negated option flag
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "error: option '--red' cannot be used with option '-N, --no-color'"
Received message:   "error: option '--red' cannot be used with option '--color'"

      769 |         } else {
      770 |           stryCov_9fa48("305");
    > 771 |           this._exitCallback(new CommanderError(exitCode, code, message));

[Killed] ConditionalExpression
lib/command.js:2081:21
         (target) => target.negate && optionKey === target.attributeName(),
       );
       const positiveOption = this.options.find(
-        (target) => !target.negate && optionKey === target.attributeName(),
+        (target) => true,
       );
       if (
killedBy: command with conflicting options should exit with error if conflicting options were set
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "error: option '-j, --json' cannot be used with option '-s, --silent'"
Received message:   "error: option '-s, --silent' cannot be used with option '-s, --silent'"

      769 |         } else {
      770 |           stryCov_9fa48("305");
    > 771 |           this._exitCallback(new CommanderError(exitCode, code, message));

[Killed] LogicalOperator
lib/command.js:2081:21
         (target) => target.negate && optionKey === target.attributeName(),
       );
       const positiveOption = this.options.find(
-        (target) => !target.negate && optionKey === target.attributeName(),
+        (target) => !target.negate || optionKey === target.attributeName(),
       );
       if (
killedBy: command with conflicting options should exit with error if conflicting options were set
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "error: option '-j, --json' cannot be used with option '-s, --silent'"
Received message:   "error: option '-s, --silent' cannot be used with option '-s, --silent'"

      769 |         } else {
      770 |           stryCov_9fa48("305");
    > 771 |           this._exitCallback(new CommanderError(exitCode, code, message));

[Killed] LogicalOperator
lib/command.js:2084:9
         (target) => !target.negate && optionKey === target.attributeName(),
       );
       if (
-        negativeOption &&
-        ((negativeOption.presetArg === undefined && optionValue === false) ||
-          (negativeOption.presetArg !== undefined &&
-            optionValue === negativeOption.presetArg))
+        negativeOption || negativeOption.presetArg === undefined && optionValue === false || negativeOption.presetArg !== undefined && optionValue === negativeOption.presetArg
       ) {
         return negativeOption;
killedBy: command with conflicting options should exit with error if conflicting options were set
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "error: option '-j, --json' cannot be used with option '-s, --silent'"
Received message:   "Cannot read properties of undefined (reading 'presetArg')"

[Killed] ConditionalExpression
lib/command.js:2084:9
         (target) => !target.negate && optionKey === target.attributeName(),
       );
       if (
-        negativeOption &&
-        ((negativeOption.presetArg === undefined && optionValue === false) ||
-          (negativeOption.presetArg !== undefined &&
-            optionValue === negativeOption.presetArg))
+        true
       ) {
         return negativeOption;
killedBy: .exitOverride and error details when has conflicting option then throw CommanderError
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: CommanderError
Received constructor: TypeError

[Killed] LogicalOperator
lib/command.js:2085:10
       );
       if (
         negativeOption &&
-        ((negativeOption.presetArg === undefined && optionValue === false) ||
-          (negativeOption.presetArg !== undefined &&
-            optionValue === negativeOption.presetArg))
+        (negativeOption.presetArg === undefined && optionValue === false && negativeOption.presetArg !== undefined && optionValue === negativeOption.presetArg)
       ) {
         return negativeOption;
killedBy: command with conflicting options should report conflict on negated option flag
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "error: option '--red' cannot be used with option '-N, --no-color'"
Received message:   "error: option '--red' cannot be used with option '--color'"

      769 |         } else {
      770 |           stryCov_9fa48("305");
    > 771 |           this._exitCallback(new CommanderError(exitCode, code, message));

[Killed] BooleanLiteral
lib/command.js:2085:69
       );
       if (
         negativeOption &&
-        ((negativeOption.presetArg === undefined && optionValue === false) ||
+        ((negativeOption.presetArg === undefined && optionValue === true) ||
           (negativeOption.presetArg !== undefined &&
             optionValue === negativeOption.presetArg))
killedBy: command with conflicting options should report conflict on negated option flag
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "error: option '--red' cannot be used with option '-N, --no-color'"
Received message:   "error: option '--red' cannot be used with option '--color'"

      769 |         } else {
      770 |           stryCov_9fa48("305");
    > 771 |           this._exitCallback(new CommanderError(exitCode, code, message));

[Killed] ConditionalExpression
lib/command.js:2086:12
       if (
         negativeOption &&
         ((negativeOption.presetArg === undefined && optionValue === false) ||
-          (negativeOption.presetArg !== undefined &&
-            optionValue === negativeOption.presetArg))
+          (false))
       ) {
         return negativeOption;
killedBy: command with conflicting options should report correct error for negated option with preset when negated is configured
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "error: option '--no-dual2' cannot be used with option '--red'"
Received message:   "error: option '--dual2 <str>' cannot be used with option '--red'"

      769 |         } else {
      770 |           stryCov_9fa48("305");
    > 771 |           this._exitCallback(new CommanderError(exitCode, code, message));

[Killed] EqualityOperator
lib/command.js:2086:12
       if (
         negativeOption &&
         ((negativeOption.presetArg === undefined && optionValue === false) ||
-          (negativeOption.presetArg !== undefined &&
+          (negativeOption.presetArg === undefined &&
             optionValue === negativeOption.presetArg))
       ) {
killedBy: command with conflicting options should report correct error for negated option with preset when negated is configured
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "error: option '--no-dual2' cannot be used with option '--red'"
Received message:   "error: option '--dual2 <str>' cannot be used with option '--red'"

      769 |         } else {
      770 |           stryCov_9fa48("305");
    > 771 |           this._exitCallback(new CommanderError(exitCode, code, message));

[Killed] EqualityOperator
lib/command.js:2087:13
         negativeOption &&
         ((negativeOption.presetArg === undefined && optionValue === false) ||
           (negativeOption.presetArg !== undefined &&
-            optionValue === negativeOption.presetArg))
+            optionValue !== negativeOption.presetArg))
       ) {
         return negativeOption;
killedBy: command with conflicting options should report correct error for positive option with string value when negated is configured
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "error: option '--dual2 <str>' cannot be used with option '--red'"
Received message:   "error: option '--no-dual2' cannot be used with option '--red'"

      769 |         } else {
      770 |           stryCov_9fa48("305");
    > 771 |           this._exitCallback(new CommanderError(exitCode, code, message));

[Killed] ConditionalExpression
lib/command.js:2087:13
         negativeOption &&
         ((negativeOption.presetArg === undefined && optionValue === false) ||
           (negativeOption.presetArg !== undefined &&
-            optionValue === negativeOption.presetArg))
+            true))
       ) {
         return negativeOption;
killedBy: command with conflicting options should report correct error for positive option with string value when negated is configured
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "error: option '--dual2 <str>' cannot be used with option '--red'"
Received message:   "error: option '--no-dual2' cannot be used with option '--red'"

      769 |         } else {
      770 |           stryCov_9fa48("305");
    > 771 |           this._exitCallback(new CommanderError(exitCode, code, message));

[Killed] BlockStatement
lib/command.js:2088:9
         ((negativeOption.presetArg === undefined && optionValue === false) ||
           (negativeOption.presetArg !== undefined &&
             optionValue === negativeOption.presetArg))
-      ) {
-        return negativeOption;
-      }
+      ) {}
       return positiveOption || option;
     };
killedBy: command with conflicting options should report conflict on negated option flag
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "error: option '--red' cannot be used with option '-N, --no-color'"
Received message:   "error: option '--red' cannot be used with option '--color'"

      769 |         } else {
      770 |           stryCov_9fa48("305");
    > 771 |           this._exitCallback(new CommanderError(exitCode, code, message));

[Killed] ConditionalExpression
lib/command.js:2091:14
       ) {
         return negativeOption;
       }
-      return positiveOption || option;
+      return false;
     };
 
killedBy: command with conflicting options should exit with error if conflicting options were set
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "error: option '-j, --json' cannot be used with option '-s, --silent'"
Received message:   "bestOption.attributeName is not a function"

      3244 |           stryCov_9fa48("1294");
      3245 |           const bestOption = findBestOptionFromValue(option);
    > 3246 |           const optionKey = bestOption.attributeName();

[Killed] ConditionalExpression
lib/command.js:2091:14
       ) {
         return negativeOption;
       }
-      return positiveOption || option;
+      return true;
     };
 
killedBy: command with conflicting options should exit with error if conflicting options were set
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "error: option '-j, --json' cannot be used with option '-s, --silent'"
Received message:   "bestOption.attributeName is not a function"

      3244 |           stryCov_9fa48("1294");
      3245 |           const bestOption = findBestOptionFromValue(option);
    > 3246 |           const optionKey = bestOption.attributeName();

[Killed] BlockStatement
lib/command.js:2094:41
       return positiveOption || option;
     };
 
-    const getErrorMessage = (option) => {
-      const bestOption = findBestOptionFromValue(option);
-      const optionKey = bestOption.attributeName();
-      const source = this.getOptionValueSource(optionKey);
-      if (source === 'env') {
-        return `environment variable '${bestOption.envVar}'`;
-      }
-      return `option '${bestOption.flags}'`;
-    };
+    const getErrorMessage = (option) => {};
 
     const message = `error: ${getErrorMessage(option)} cannot be used with ${getErrorMessage(conflictingOption)}`;
killedBy: .exitOverride and error details when has conflicting option then throw CommanderError
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "error: option '--debug' cannot be used with option '--silent'"
Received: "error: undefined cannot be used with undefined"

[Killed] EqualityOperator
lib/command.js:2098:11
       const bestOption = findBestOptionFromValue(option);
       const optionKey = bestOption.attributeName();
       const source = this.getOptionValueSource(optionKey);
-      if (source === 'env') {
+      if (source !== 'env') {
         return `environment variable '${bestOption.envVar}'`;
       }
killedBy: command with conflicting options should exit with error if conflicting options were set
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "error: option '-j, --json' cannot be used with option '-s, --silent'"
Received message:   "error: environment variable 'JSON' cannot be used with environment variable 'SILENT'"

      769 |         } else {
      770 |           stryCov_9fa48("305");
    > 771 |           this._exitCallback(new CommanderError(exitCode, code, message))

[Killed] ConditionalExpression
lib/command.js:2098:11
       const bestOption = findBestOptionFromValue(option);
       const optionKey = bestOption.attributeName();
       const source = this.getOptionValueSource(optionKey);
-      if (source === 'env') {
+      if (false) {
         return `environment variable '${bestOption.envVar}'`;
       }
killedBy: command with conflicting options should report the env variable as the conflicting option source, when conflicting option is set
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "error: option '-j, --json' cannot be used with environment variable 'SILENT'"
Received message:   "error: option '-j, --json' cannot be used with option '-s, --silent'"

      769 |         } else {
      770 |           stryCov_9fa48("305");
    > 771 |           this._exitCallback(new CommanderError(exitCode, code, message));

[Killed] StringLiteral
lib/command.js:2099:16
       const optionKey = bestOption.attributeName();
       const source = this.getOptionValueSource(optionKey);
       if (source === 'env') {
-        return `environment variable '${bestOption.envVar}'`;
+        return ``;
       }
       return `option '${bestOption.flags}'`;
killedBy: command with conflicting options should report the env variable as the conflicting option source, when conflicting option is set
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "error: option '-j, --json' cannot be used with environment variable 'SILENT'"
Received message:   "error: option '-j, --json' cannot be used with "

      769 |         } else {
      770 |           stryCov_9fa48("305");
    > 771 |           this._exitCallback(new CommanderError(exitCode, code, message));

[Killed] StringLiteral
lib/command.js:2101:14
       if (source === 'env') {
         return `environment variable '${bestOption.envVar}'`;
       }
-      return `option '${bestOption.flags}'`;
+      return ``;
     };
 
killedBy: command with conflicting options should exit with error if conflicting options were set
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "error: option '-j, --json' cannot be used with option '-s, --silent'"
Received message:   "error:  cannot be used with "

      769 |         } else {
      770 |           stryCov_9fa48("305");
    > 771 |           this._exitCallback(new CommanderError(exitCode, code, message));

[Killed] ObjectLiteral
lib/command.js:2105:25
     };
 
     const message = `error: ${getErrorMessage(option)} cannot be used with ${getErrorMessage(conflictingOption)}`;
-    this.error(message, { code: 'commander.conflictingOption' });
+    this.error(message, {});
   }
 
killedBy: command with conflicting options when conflict on program calling action subcommand then throw conflict
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "commander.conflictingOption"
Received: "commander.error"

[Killed] BlockStatement
lib/command.js:2115:23
    * @private
    */
 
-  unknownOption(flag) {
-    if (this._allowUnknownOption) return;
-    let suggestion = '';
-
-    if (flag.startsWith('--') && this._showSuggestionAfterError) {
-      // Looping to pick up the global options too
-      let candidateFlags = [];
-      // eslint-disable-next-line @typescript-eslint/no-this-alias
-      let command = this;
-      do {
-        const moreFlags = command
-          .createHelp()
-          .visibleOptions(command)
-          .filter((option) => option.long)
-          .map((option) => option.long);
-        candidateFlags = candidateFlags.concat(moreFlags);
-        command = command.parent;
-      } while (command && !command._enablePositionalOptions);
-      suggestion = suggestSimilar(flag, candidateFlags);
-    }
-
-    const message = `error: unknown option '${flag}'${suggestion}`;
-    this.error(message, { code: 'commander.unknownOption' });
-  }
+  unknownOption(flag) {}
 
   /**
killedBy: when option-argument for short optional is -1e-3.0 then consumed=false
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "commander.unknownOption"
Received: "commander.excessArguments"

[Killed] ConditionalExpression
lib/command.js:2116:9
    */
 
   unknownOption(flag) {
-    if (this._allowUnknownOption) return;
+    if (true) return;
     let suggestion = '';
 
killedBy: when option-argument for short optional is -1e-3.0 then consumed=false
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "commander.unknownOption"
Received: "commander.excessArguments"

[Killed] StringLiteral
lib/command.js:2117:22
 
   unknownOption(flag) {
     if (this._allowUnknownOption) return;
-    let suggestion = '';
+    let suggestion = "Stryker was here!";
 
     if (flag.startsWith('--') && this._showSuggestionAfterError) {
killedBy: .exitOverride and error details when specify unknown program option then throw CommanderError
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "error: unknown option '-m'"
Received: "error: unknown option '-m'Stryker was here!"

[Killed] ConditionalExpression
lib/command.js:2119:9
     if (this._allowUnknownOption) return;
     let suggestion = '';
 
-    if (flag.startsWith('--') && this._showSuggestionAfterError) {
+    if (false) {
       // Looping to pick up the global options too
       let candidateFlags = [];
killedBy: when default help option then --help is candidate for suggestion
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "--help"
Received: null

[Killed] BlockStatement
lib/command.js:2119:66
     if (this._allowUnknownOption) return;
     let suggestion = '';
 
-    if (flag.startsWith('--') && this._showSuggestionAfterError) {
-      // Looping to pick up the global options too
-      let candidateFlags = [];
-      // eslint-disable-next-line @typescript-eslint/no-this-alias
-      let command = this;
-      do {
-        const moreFlags = command
-          .createHelp()
-          .visibleOptions(command)
-          .filter((option) => option.long)
-          .map((option) => option.long);
-        candidateFlags = candidateFlags.concat(moreFlags);
-        command = command.parent;
-      } while (command && !command._enablePositionalOptions);
-      suggestion = suggestSimilar(flag, candidateFlags);
-    }
+    if (flag.startsWith('--') && this._showSuggestionAfterError) {}
 
     const message = `error: unknown option '${flag}'${suggestion}`;
killedBy: when default help option then --help is candidate for suggestion
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "--help"
Received: null

[Timeout] BlockStatement
lib/command.js:2124:10
       let candidateFlags = [];
       // eslint-disable-next-line @typescript-eslint/no-this-alias
       let command = this;
-      do {
-        const moreFlags = command
-          .createHelp()
-          .visibleOptions(command)
-          .filter((option) => option.long)
-          .map((option) => option.long);
-        candidateFlags = candidateFlags.concat(moreFlags);
-        command = command.parent;
-      } while (command && !command._enablePositionalOptions);
+      do {} while (command && !command._enablePositionalOptions);
       suggestion = suggestSimilar(flag, candidateFlags);
     }

[Killed] MethodExpression
lib/command.js:2125:27
       // eslint-disable-next-line @typescript-eslint/no-this-alias
       let command = this;
       do {
-        const moreFlags = command
-          .createHelp()
-          .visibleOptions(command)
-          .filter((option) => option.long)
+        const moreFlags = command.createHelp().visibleOptions(command)
           .map((option) => option.long);
         candidateFlags = candidateFlags.concat(moreFlags);
killedBy: when digit option defined and option-argument is --1  then negative not consumed
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "commander.unknownOption"
Received: undefined

[Killed] ArrowFunction
lib/command.js:2128:19
         const moreFlags = command
           .createHelp()
           .visibleOptions(command)
-          .filter((option) => option.long)
+          .filter(() => undefined)
           .map((option) => option.long);
         candidateFlags = candidateFlags.concat(moreFlags);
killedBy: when unknown option and showSuggestionAfterError() then show suggestion
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "--example"
Received: null

[Killed] ArrowFunction
lib/command.js:2129:16
           .createHelp()
           .visibleOptions(command)
           .filter((option) => option.long)
-          .map((option) => option.long);
+          .map(() => undefined);
         candidateFlags = candidateFlags.concat(moreFlags);
         command = command.parent;
killedBy: when default help option then --help is candidate for suggestion
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "--help"
Received: null

[Killed] LogicalOperator
lib/command.js:2132:16
           .map((option) => option.long);
         candidateFlags = candidateFlags.concat(moreFlags);
         command = command.parent;
-      } while (command && !command._enablePositionalOptions);
+      } while (command || !command._enablePositionalOptions);
       suggestion = suggestSimilar(flag, candidateFlags);
     }
killedBy: when option-argument for short optional is --1  then consumed=false
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "commander.unknownOption"
Received: undefined

[Killed] ConditionalExpression
lib/command.js:2132:16
           .map((option) => option.long);
         candidateFlags = candidateFlags.concat(moreFlags);
         command = command.parent;
-      } while (command && !command._enablePositionalOptions);
+      } while (false);
       suggestion = suggestSimilar(flag, candidateFlags);
     }
killedBy: when global option then candidate for subcommand option suggestion
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "--global"
Received: null

[Killed] StringLiteral
lib/command.js:2136:21
       suggestion = suggestSimilar(flag, candidateFlags);
     }
 
-    const message = `error: unknown option '${flag}'${suggestion}`;
+    const message = ``;
     this.error(message, { code: 'commander.unknownOption' });
   }
killedBy: when unknown option and showSuggestionAfterError() then show suggestion
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "--example"
Received: null

[Killed] BlockStatement
lib/command.js:2147:34
    * @private
    */
 
-  _excessArguments(receivedArgs) {
-    if (this._allowExcessArguments) return;
-
-    const expected = this.registeredArguments.length;
-    const s = expected === 1 ? '' : 's';
-    const forSubcommand = this.parent ? ` for '${this.name()}'` : '';
-    const message = `error: too many arguments${forSubcommand}. Expected ${expected} argument${s} but got ${receivedArgs.length}.`;
-    this.error(message, { code: 'commander.excessArguments' });
-  }
+  _excessArguments(receivedArgs) {}
 
   /**
killedBy: .exitOverride and error details when specify excess argument then throw CommanderError
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
lib/command.js:2148:9
    */
 
   _excessArguments(receivedArgs) {
-    if (this._allowExcessArguments) return;
+    if (true) return;
 
     const expected = this.registeredArguments.length;
killedBy: .exitOverride and error details when specify excess argument then throw CommanderError
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] EqualityOperator
lib/command.js:2151:15
     if (this._allowExcessArguments) return;
 
     const expected = this.registeredArguments.length;
-    const s = expected === 1 ? '' : 's';
+    const s = expected !== 1 ? '' : 's';
     const forSubcommand = this.parent ? ` for '${this.name()}'` : '';
     const message = `error: too many arguments${forSubcommand}. Expected ${expected} argument${s} but got ${receivedArgs.length}.`;
killedBy: .exitOverride and error details when specify excess argument then throw CommanderError
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "error: too many arguments. Expected 0 arguments but got 1."
Received: "error: too many arguments. Expected 0 argument but got 1."

[Killed] ConditionalExpression
lib/command.js:2151:15
     if (this._allowExcessArguments) return;
 
     const expected = this.registeredArguments.length;
-    const s = expected === 1 ? '' : 's';
+    const s = true ? '' : 's';
     const forSubcommand = this.parent ? ` for '${this.name()}'` : '';
     const message = `error: too many arguments${forSubcommand}. Expected ${expected} argument${s} but got ${receivedArgs.length}.`;
killedBy: .exitOverride and error details when specify excess argument then throw CommanderError
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "error: too many arguments. Expected 0 arguments but got 1."
Received: "error: too many arguments. Expected 0 argument but got 1."

[Killed] StringLiteral
lib/command.js:2152:41
 
     const expected = this.registeredArguments.length;
     const s = expected === 1 ? '' : 's';
-    const forSubcommand = this.parent ? ` for '${this.name()}'` : '';
+    const forSubcommand = this.parent ? `` : '';
     const message = `error: too many arguments${forSubcommand}. Expected ${expected} argument${s} but got ${receivedArgs.length}.`;
     this.error(message, { code: 'commander.excessArguments' });
killedBy: .exitOverride and error details when specify command with excess argument then throw CommanderError
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "error: too many arguments for 'speak'. Expected 0 arguments but got 1."
Received: "error: too many arguments. Expected 0 arguments but got 1."

[Killed] BlockStatement
lib/command.js:2163:20
    * @private
    */
 
-  unknownCommand() {
-    const unknownName = this.args[0];
-    let suggestion = '';
-
-    if (this._showSuggestionAfterError) {
-      const candidateNames = [];
-      this.createHelp()
-        .visibleCommands(this)
-        .forEach((command) => {
-          candidateNames.push(command.name());
-          // just visible alias
-          if (command.alias()) candidateNames.push(command.alias());
-        });
-      suggestion = suggestSimilar(unknownName, candidateNames);
-    }
-
-    const message = `error: unknown command '${unknownName}'${suggestion}`;
-    this.error(message, { code: 'commander.unknownCommand' });
-  }
+  unknownCommand() {}
 
   /**
killedBy: when cli of a and commands ["ab"] then suggest ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: null

[Killed] BlockStatement
lib/command.js:2167:41
     const unknownName = this.args[0];
     let suggestion = '';
 
-    if (this._showSuggestionAfterError) {
-      const candidateNames = [];
-      this.createHelp()
-        .visibleCommands(this)
-        .forEach((command) => {
-          candidateNames.push(command.name());
-          // just visible alias
-          if (command.alias()) candidateNames.push(command.alias());
-        });
-      suggestion = suggestSimilar(unknownName, candidateNames);
-    }
+    if (this._showSuggestionAfterError) {}
 
     const message = `error: unknown command '${unknownName}'${suggestion}`;
killedBy: when cli of a and commands ["ab"] then suggest ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: null

[Killed] ConditionalExpression
lib/command.js:2167:9
     const unknownName = this.args[0];
     let suggestion = '';
 
-    if (this._showSuggestionAfterError) {
+    if (true) {
       const candidateNames = [];
       this.createHelp()
killedBy: when unknown command and showSuggestionAfterError(false) then do not show suggestion
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "example"
