[Killed] BlockStatement
lib/command.js:2171:31
       const candidateNames = [];
       this.createHelp()
         .visibleCommands(this)
-        .forEach((command) => {
-          candidateNames.push(command.name());
-          // just visible alias
-          if (command.alias()) candidateNames.push(command.alias());
-        });
+        .forEach((command) => {});
       suggestion = suggestSimilar(unknownName, candidateNames);
     }
killedBy: when cli of a and commands ["ab"] then suggest ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: null

[Killed] ConditionalExpression
lib/command.js:2174:15
         .forEach((command) => {
           candidateNames.push(command.name());
           // just visible alias
-          if (command.alias()) candidateNames.push(command.alias());
+          if (false) candidateNames.push(command.alias());
         });
       suggestion = suggestSimilar(unknownName, candidateNames);
killedBy: when similar alias then suggest alias
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "car"
Received: null

[Killed] ConditionalExpression
lib/command.js:2174:15
         .forEach((command) => {
           candidateNames.push(command.name());
           // just visible alias
-          if (command.alias()) candidateNames.push(command.alias());
+          if (true) candidateNames.push(command.alias());
         });
       suggestion = suggestSimilar(unknownName, candidateNames);
killedBy: when cli of a and commands ["ab"] then suggest ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: null

[Killed] ObjectLiteral
lib/command.js:2180:25
     }
 
     const message = `error: unknown command '${unknownName}'${suggestion}`;
-    this.error(message, { code: 'commander.unknownCommand' });
+    this.error(message, {});
   }
 
killedBy: unknownCommand when unknown command then error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "commander.unknownCommand"
Received: "commander.error"

[Killed] StringLiteral
lib/command.js:2180:33
     }
 
     const message = `error: unknown command '${unknownName}'${suggestion}`;
-    this.error(message, { code: 'commander.unknownCommand' });
+    this.error(message, { code: "" });
   }
 
killedBy: .exitOverride and error details when specify unknown command then throw CommanderError
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "commander.unknownCommand"
Received: "commander.error"

[Killed] BlockStatement
lib/command.js:2196:36
    * @return {(this | string | undefined)} `this` command for chaining, or version string if no arguments
    */
 
-  version(str, flags, description) {
-    if (str === undefined) return this._version;
-    this._version = str;
-    flags = flags || '-V, --version';
-    description = description || 'output the version number';
-    const versionOption = this.createOption(flags, description);
-    this._versionOptionName = versionOption.attributeName();
-    this._registerOption(versionOption);
-
-    this.on('option:' + versionOption.name(), () => {
-      this._outputConfiguration.writeOut(`${str}\n`);
-      this._exit(0, 'commander.version', str);
-    });
-    return this;
-  }
+  version(str, flags, description) {}
 
   /**
killedBy: when .version used with storeOptionsAsProperties() then version in opts
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "version": "0.0.1",
- }

[Killed] ConditionalExpression
lib/command.js:2197:9
    */
 
   version(str, flags, description) {
-    if (str === undefined) return this._version;
+    if (false) return this._version;
     this._version = str;
     flags = flags || '-V, --version';
killedBy: .version when specify version then can get version
statusReason: Error: Cannot add option '-V, --version' due to conflicting flag '--version'
-  already used by option '-V, --version'

[Killed] ConditionalExpression
lib/command.js:2197:9
    */
 
   version(str, flags, description) {
-    if (str === undefined) return this._version;
+    if (true) return this._version;
     this._version = str;
     flags = flags || '-V, --version';
killedBy: when .version used with storeOptionsAsProperties() then version in opts
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "version": "0.0.1",
- }

[Killed] LogicalOperator
lib/command.js:2199:13
   version(str, flags, description) {
     if (str === undefined) return this._version;
     this._version = str;
-    flags = flags || '-V, --version';
+    flags = flags && '-V, --version';
     description = description || 'output the version number';
     const versionOption = this.createOption(flags, description);
killedBy: .version when specify default short flag then display version
statusReason: TypeError: Cannot read properties of undefined (reading 'includes')

[Killed] ConditionalExpression
lib/command.js:2199:13
   version(str, flags, description) {
     if (str === undefined) return this._version;
     this._version = str;
-    flags = flags || '-V, --version';
+    flags = true;
     description = description || 'output the version number';
     const versionOption = this.createOption(flags, description);
killedBy: program with passThrough when version option after command-argument then option passed through
statusReason: TypeError: flags.includes is not a function

[Killed] LogicalOperator
lib/command.js:2200:19
     if (str === undefined) return this._version;
     this._version = str;
     flags = flags || '-V, --version';
-    description = description || 'output the version number';
+    description = description && 'output the version number';
     const versionOption = this.createOption(flags, description);
     this._versionOptionName = versionOption.attributeName();
killedBy: .version when default .version then helpInformation includes default version help
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
lib/command.js:2200:19
     if (str === undefined) return this._version;
     this._version = str;
     flags = flags || '-V, --version';
-    description = description || 'output the version number';
+    description = true;
     const versionOption = this.createOption(flags, description);
     this._versionOptionName = versionOption.attributeName();
killedBy: .version when default .version then helpInformation includes default version help
statusReason: TypeError: str.split is not a function

[Killed] BlockStatement
lib/command.js:2205:53
     this._versionOptionName = versionOption.attributeName();
     this._registerOption(versionOption);
 
-    this.on('option:' + versionOption.name(), () => {
-      this._outputConfiguration.writeOut(`${str}\n`);
-      this._exit(0, 'commander.version', str);
-    });
+    this.on('option:' + versionOption.name(), () => {});
     return this;
   }
killedBy: .version when specify default short flag then display version
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "1.2.3"

Received function did not throw

[Killed] StringLiteral
lib/command.js:2206:42
     this._registerOption(versionOption);
 
     this.on('option:' + versionOption.name(), () => {
-      this._outputConfiguration.writeOut(`${str}\n`);
+      this._outputConfiguration.writeOut(``);
       this._exit(0, 'commander.version', str);
     });
killedBy: .version when specify default short flag then display version
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "1.2.3
"
Received: ""

Number of calls: 1

[Survived] ConditionalExpression
lib/command.js:2220:30
    * @return {(string|Command)}
    */
   description(str, argsDescription) {
-    if (str === undefined && argsDescription === undefined)
+    if (str === undefined && true)
       return this._description;
     this._description = str;

[Killed] ConditionalExpression
lib/command.js:2223:9
     if (str === undefined && argsDescription === undefined)
       return this._description;
     this._description = str;
-    if (argsDescription) {
+    if (false) {
       this._argsDescription = argsDescription;
     }
killedBy: when arguments described in deprecated way then included in helpInformation
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Arguments:\n +file +input source/
Received string:  "Usage:  <file>·
description
"

[Killed] BlockStatement
lib/command.js:2223:26
     if (str === undefined && argsDescription === undefined)
       return this._description;
     this._description = str;
-    if (argsDescription) {
-      this._argsDescription = argsDescription;
-    }
+    if (argsDescription) {}
     return this;
   }
killedBy: when arguments described in deprecated way then included in helpInformation
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Arguments:\n +file +input source/
Received string:  "Usage:  <file>·
description
"

[Killed] BlockStatement
lib/command.js:2235:16
    * @param {string} [str]
    * @return {(string|Command)}
    */
-  summary(str) {
-    if (str === undefined) return this._summary;
-    this._summary = str;
-    return this;
-  }
+  summary(str) {}
 
   /**
killedBy: subcommandDescription when program has summary then return summary
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "summary"
Received: ""

[Killed] ConditionalExpression
lib/command.js:2236:9
    * @return {(string|Command)}
    */
   summary(str) {
-    if (str === undefined) return this._summary;
+    if (true) return this._summary;
     this._summary = str;
     return this;
killedBy: subcommandDescription when program has summary then return summary
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "summary"
Received: ""

[Killed] ConditionalExpression
lib/command.js:2251:9
    */
 
   alias(alias) {
-    if (alias === undefined) return this._aliases[0]; // just return first, for backwards compatibility
+    if (false) return this._aliases[0]; // just return first, for backwards compatibility
 
     /** @type {Command} */
killedBy: when set alias then can get alias
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "abcde"

[Killed] ConditionalExpression
lib/command.js:2257:7
     // eslint-disable-next-line @typescript-eslint/no-this-alias
     let command = this;
     if (
-      this.commands.length !== 0 &&
-      this.commands[this.commands.length - 1]._executableHandler
+      false
     ) {
       // assume adding alias for last added executable subcommand, rather than this
killedBy: when set alias on executable then can get alias
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "abcde"
Received: undefined

[Killed] ConditionalExpression
lib/command.js:2257:7
     // eslint-disable-next-line @typescript-eslint/no-this-alias
     let command = this;
     if (
-      this.commands.length !== 0 &&
-      this.commands[this.commands.length - 1]._executableHandler
+      true
     ) {
       // assume adding alias for last added executable subcommand, rather than this
killedBy: when command name conflicts with existing alias then throw
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "cannot add command"
Received message:   "Cannot read properties of undefined (reading '_name')"

      3478 |         }
      3479 |       }

[Killed] ArithmeticOperator
lib/command.js:2258:21
     let command = this;
     if (
       this.commands.length !== 0 &&
-      this.commands[this.commands.length - 1]._executableHandler
+      this.commands[this.commands.length + 1]._executableHandler
     ) {
       // assume adding alias for last added executable subcommand, rather than this
killedBy: when set alias on executable then can get alias
statusReason: TypeError: Cannot read properties of undefined (reading '_executableHandler')

[Killed] BlockStatement
lib/command.js:2259:7
     if (
       this.commands.length !== 0 &&
       this.commands[this.commands.length - 1]._executableHandler
-    ) {
-      // assume adding alias for last added executable subcommand, rather than this
-      command = this.commands[this.commands.length - 1];
-    }
+    ) {}
 
     if (alias === command._name)
killedBy: when set alias on executable then can get alias
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "abcde"
Received: undefined

[Killed] ArithmeticOperator
lib/command.js:2261:31
       this.commands[this.commands.length - 1]._executableHandler
     ) {
       // assume adding alias for last added executable subcommand, rather than this
-      command = this.commands[this.commands.length - 1];
+      command = this.commands[this.commands.length + 1];
     }
 
killedBy: when set alias on executable then can get alias
statusReason: TypeError: Cannot read properties of undefined (reading '_name')

[Killed] EqualityOperator
lib/command.js:2264:9
       command = this.commands[this.commands.length - 1];
     }
 
-    if (alias === command._name)
+    if (alias !== command._name)
       throw new Error("Command alias can't be the same as its name");
     const matchingCommand = this.parent?._findCommand(alias);
killedBy: when command has alias then appears in help
statusReason: Error: Command alias can't be the same as its name

[Killed] ConditionalExpression
lib/command.js:2264:9
       command = this.commands[this.commands.length - 1];
     }
 
-    if (alias === command._name)
+    if (true)
       throw new Error("Command alias can't be the same as its name");
     const matchingCommand = this.parent?._findCommand(alias);
killedBy: when command name conflicts with existing alias then throw
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "cannot add command"
Received message:   "Command alias can't be the same as its name"

      3478 |         }
      3479 |       }

[Killed] OptionalChaining
lib/command.js:2266:29
 
     if (alias === command._name)
       throw new Error("Command alias can't be the same as its name");
-    const matchingCommand = this.parent?._findCommand(alias);
+    const matchingCommand = this.parent._findCommand(alias);
     if (matchingCommand) {
       // c.f. _registerCommand
killedBy: Command methods that should return this for chaining when set .alias() then returns this
statusReason: TypeError: Cannot read properties of null (reading '_findCommand')

[Killed] BlockStatement
lib/command.js:2267:26
     if (alias === command._name)
       throw new Error("Command alias can't be the same as its name");
     const matchingCommand = this.parent?._findCommand(alias);
-    if (matchingCommand) {
-      // c.f. _registerCommand
-      const existingCmd = [matchingCommand.name()]
-        .concat(matchingCommand.aliases())
-        .join('|');
-      throw new Error(
-        `cannot add alias '${alias}' to command '${this.name()}' as already have command '${existingCmd}'`,
-      );
-    }
+    if (matchingCommand) {}
 
     command._aliases.push(alias);
killedBy: when command alias conflicts with existing name then throw
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "cannot add alias"

Received function did not throw

[Killed] ConditionalExpression
lib/command.js:2267:9
     if (alias === command._name)
       throw new Error("Command alias can't be the same as its name");
     const matchingCommand = this.parent?._findCommand(alias);
-    if (matchingCommand) {
+    if (true) {
       // c.f. _registerCommand
       const existingCmd = [matchingCommand.name()]
killedBy: when similar alias then suggest alias
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Killed] BlockStatement
lib/command.js:2290:20
    * @return {(string[]|Command)}
    */
 
-  aliases(aliases) {
-    // Getter for the array of aliases is the main reason for having aliases() in addition to alias().
-    if (aliases === undefined) return this._aliases;
-
-    aliases.forEach((alias) => this.alias(alias));
-    return this;
-  }
+  aliases(aliases) {}
 
   /**
killedBy: when command has aliases then only first appears in help
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "list|ls "
Received string:    "Usage:  [options] [command]·
Options:
  -h, --help      display help for command·
Commands:
  list [thing]

[Killed] ConditionalExpression
lib/command.js:2292:9
 
   aliases(aliases) {
     // Getter for the array of aliases is the main reason for having aliases() in addition to alias().
-    if (aliases === undefined) return this._aliases;
+    if (true) return this._aliases;
 
     aliases.forEach((alias) => this.alias(alias));
killedBy: Command methods that should return this for chaining when set .aliases() then returns this
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: []

[Killed] BlockStatement
lib/command.js:2305:14
    * @return {(string|Command)}
    */
 
-  usage(str) {
-    if (str === undefined) {
-      if (this._usage) return this._usage;
-
-      const args = this.registeredArguments.map((arg) => {
-        return humanReadableArgName(arg);
-      });
-      return []
-        .concat(
-          this.options.length || this._helpOption !== null ? '[options]' : [],
-          this.commands.length ? '[command]' : [],
-          this.registeredArguments.length ? args : [],
-        )
-        .join(' ');
-    }
-
-    this._usage = str;
-    return this;
-  }
+  usage(str) {}
 
   /**
killedBy: Command methods that should return this for chaining when set .usage() then returns this
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: undefined

[Killed] EqualityOperator
lib/command.js:2306:9
    */
 
   usage(str) {
-    if (str === undefined) {
+    if (str !== undefined) {
       if (this._usage) return this._usage;
 
killedBy: Command methods that should return this for chaining when set .usage() then returns this
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: "[options]"

[Killed] BlockStatement
lib/command.js:2306:28
    */
 
   usage(str) {
-    if (str === undefined) {
-      if (this._usage) return this._usage;
-
-      const args = this.registeredArguments.map((arg) => {
-        return humanReadableArgName(arg);
-      });
-      return []
-        .concat(
-          this.options.length || this._helpOption !== null ? '[options]' : [],
-          this.commands.length ? '[command]' : [],
-          this.registeredArguments.length ? args : [],
-        )
-        .join(' ');
-    }
+    if (str === undefined) {}
 
     this._usage = str;
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

@@ -1,6 +1,6 @@
- Usage: test [options] [command]
+ Usage: test [object Object]

[Killed] ConditionalExpression
lib/command.js:2307:11
 
   usage(str) {
     if (str === undefined) {
-      if (this._usage) return this._usage;
+      if (false) return this._usage;
 
       const args = this.registeredArguments.map((arg) => {
killedBy: when custom usage and check program help then starts with custom usage
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /^Usage: test custom/
Received string:  "Usage: test [options]·
Options:
  -h, --help  display help for command
"

[Killed] ConditionalExpression
lib/command.js:2307:11
 
   usage(str) {
     if (str === undefined) {
-      if (this._usage) return this._usage;
+      if (true) return this._usage;
 
       const args = this.registeredArguments.map((arg) => {
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

@@ -1,6 +1,6 @@
- Usage: test [options] [command]
+ Usage: test undefined

[Killed] BlockStatement
lib/command.js:2309:58
     if (str === undefined) {
       if (this._usage) return this._usage;
 
-      const args = this.registeredArguments.map((arg) => {
-        return humanReadableArgName(arg);
-      });
+      const args = this.registeredArguments.map((arg) => {});
       return []
         .concat(
killedBy: when argument then included in helpInformation
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Usage: foo [options] <file>"
Received string:    "Usage: foo [options]··
Options:
  -h, --help  display help for command
"

[Killed] ArrayDeclaration
lib/command.js:2312:14
       const args = this.registeredArguments.map((arg) => {
         return humanReadableArgName(arg);
       });
-      return []
+      return ["Stryker was here"]
         .concat(
           this.options.length || this._helpOption !== null ? '[options]' : [],
killedBy: when default usage and check program help then starts with default usage
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /^Usage: test \[options\]/
Received string:  "Usage: test Stryker was here [options]·
Options:
  -h, --help  display help for command
"

[Killed] ConditionalExpression
lib/command.js:2314:11
       });
       return []
         .concat(
-          this.options.length || this._helpOption !== null ? '[options]' : [],
+          false ? '[options]' : [],
           this.commands.length ? '[command]' : [],
           this.registeredArguments.length ? args : [],
killedBy: when default usage and check program help then starts with default usage
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /^Usage: test \[options\]/
Received string:  "Usage: test··
Options:
  -h, --help  display help for command
"

[Killed] EqualityOperator
lib/command.js:2314:34
       });
       return []
         .concat(
-          this.options.length || this._helpOption !== null ? '[options]' : [],
+          this.options.length || this._helpOption === null ? '[options]' : [],
           this.commands.length ? '[command]' : [],
           this.registeredArguments.length ? args : [],
killedBy: when default usage and check program help then starts with default usage
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /^Usage: test \[options\]/
Received string:  "Usage: test··
Options:
  -h, --help  display help for command
"

[Killed] ArrayDeclaration
lib/command.js:2316:52
         .concat(
           this.options.length || this._helpOption !== null ? '[options]' : [],
           this.commands.length ? '[command]' : [],
-          this.registeredArguments.length ? args : [],
+          this.registeredArguments.length ? args : ["Stryker was here"],
         )
         .join(' ');
killedBy: commandUsage when single program then "program [options]"
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "program [options]"
Received: "program [options] Stryker was here"

[Killed] ConditionalExpression
lib/command.js:2333:9
    */
 
   name(str) {
-    if (str === undefined) return this._name;
+    if (true) return this._name;
     this._name = str;
     return this;
killedBy: when default usage and check program help then starts with default usage
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /^Usage: test \[options\]/
Received string:  "Usage:  [options]·
Options:
  -h, --help  display help for command
"

[Killed] BlockStatement
lib/command.js:2345:22
    * @return {Command | string}
    */
 
-  helpGroup(heading) {
-    if (heading === undefined) return this._helpGroupHeading ?? '';
-    this._helpGroupHeading = heading;
-    return this;
-  }
+  helpGroup(heading) {}
 
   /**
killedBy: Command methods that should return this for chaining when set .helpGroup(heading) then returns this
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: undefined

[Killed] ConditionalExpression
lib/command.js:2346:9
    */
 
   helpGroup(heading) {
-    if (heading === undefined) return this._helpGroupHeading ?? '';
+    if (false) return this._helpGroupHeading ?? '';
     this._helpGroupHeading = heading;
     return this;
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 4

  Usage: test [options] [command]

  Options:

[Killed] ConditionalExpression
lib/command.js:2346:9
    */
 
   helpGroup(heading) {
-    if (heading === undefined) return this._helpGroupHeading ?? '';
+    if (true) return this._helpGroupHeading ?? '';
     this._helpGroupHeading = heading;
     return this;
killedBy: Command methods that should return this for chaining when set .helpGroup(heading) then returns this
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: ""

[Killed] BlockStatement
lib/command.js:2364:26
    * @param {string} [heading]
    * @returns {Command | string}
    */
-  commandsGroup(heading) {
-    if (heading === undefined) return this._defaultCommandGroup ?? '';
-    this._defaultCommandGroup = heading;
-    return this;
-  }
+  commandsGroup(heading) {}
 
   /**
killedBy: Command methods that should return this for chaining when set .commandsGroup(heading) then returns this
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: undefined

[Killed] EqualityOperator
lib/command.js:2365:9
    * @returns {Command | string}
    */
   commandsGroup(heading) {
-    if (heading === undefined) return this._defaultCommandGroup ?? '';
+    if (heading !== undefined) return this._defaultCommandGroup ?? '';
     this._defaultCommandGroup = heading;
     return this;
killedBy: .commandsGroup when add one command then help contains group
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Greek:\n *alpha/
Received string:  "Usage:  [options] [command]·
Options:
  -h, --help      display help for command·
Commands:
  alpha

[Killed] ConditionalExpression
lib/command.js:2365:9
    * @returns {Command | string}
    */
   commandsGroup(heading) {
-    if (heading === undefined) return this._defaultCommandGroup ?? '';
+    if (true) return this._defaultCommandGroup ?? '';
     this._defaultCommandGroup = heading;
     return this;
killedBy: .commandsGroup when add one command then help contains group
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Greek:\n *alpha/
Received string:  "Usage:  [options] [command]·
Options:
  -h, --help      display help for command·
Commands:
  alpha

[Killed] BlockStatement
lib/command.js:2383:25
    * @param {string} [heading]
    * @returns {Command | string}
    */
-  optionsGroup(heading) {
-    if (heading === undefined) return this._defaultOptionGroup ?? '';
-    this._defaultOptionGroup = heading;
-    return this;
-  }
+  optionsGroup(heading) {}
 
   /**
killedBy: .optionsGroup when add one option then help contains group
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Greek:\n *--alpha/
Received string:  "Usage:  [options]·
Options:
  --alpha
  -h, --help  display help for command
"

[Killed] EqualityOperator
lib/command.js:2384:9
    * @returns {Command | string}
    */
   optionsGroup(heading) {
-    if (heading === undefined) return this._defaultOptionGroup ?? '';
+    if (heading !== undefined) return this._defaultOptionGroup ?? '';
     this._defaultOptionGroup = heading;
     return this;
killedBy: .optionsGroup when add one option then help contains group
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Greek:\n *--alpha/
Received string:  "Usage:  [options]·
Options:
  --alpha
  -h, --help  display help for command
"

[Killed] ConditionalExpression
lib/command.js:2384:9
    * @returns {Command | string}
    */
   optionsGroup(heading) {
-    if (heading === undefined) return this._defaultOptionGroup ?? '';
+    if (true) return this._defaultOptionGroup ?? '';
     this._defaultOptionGroup = heading;
     return this;
killedBy: .optionsGroup when add one option then help contains group
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Greek:\n *--alpha/
Received string:  "Usage:  [options]·
Options:
  --alpha
  -h, --help  display help for command
"

[Killed] BlockStatement
lib/command.js:2393:28
    * @param {Option} option
    * @private
    */
-  _initOptionGroup(option) {
-    if (this._defaultOptionGroup && !option.helpGroupHeading)
-      option.helpGroup(this._defaultOptionGroup);
-  }
+  _initOptionGroup(option) {}
 
   /**
killedBy: .optionsGroup when add one option then help contains group
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Greek:\n *--alpha/
Received string:  "Usage:  [options]·
Options:
  --alpha
  -h, --help  display help for command
"

[Killed] LogicalOperator
lib/command.js:2394:9
    * @private
    */
   _initOptionGroup(option) {
-    if (this._defaultOptionGroup && !option.helpGroupHeading)
+    if (this._defaultOptionGroup || !option.helpGroupHeading)
       option.helpGroup(this._defaultOptionGroup);
   }
killedBy: .optionsGroup when option with helpGroup then helpGroup wins
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Latin:\n *--unus/
Received string:  "Usage:  [options]·
Greek:
  --unus·
Options:
  -h, --help  display help for command
