[Killed] BooleanLiteral
lib/command.js:2394:37
    * @private
    */
   _initOptionGroup(option) {
-    if (this._defaultOptionGroup && !option.helpGroupHeading)
+    if (this._defaultOptionGroup && option.helpGroupHeading)
       option.helpGroup(this._defaultOptionGroup);
   }
killedBy: .optionsGroup when add one option then help contains group
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Greek:\n *--alpha/
Received string:  "Usage:  [options]·
Options:
  --alpha
  -h, --help  display help for command
"

[Killed] BlockStatement
lib/command.js:2402:26
    * @param {Command} cmd
    * @private
    */
-  _initCommandGroup(cmd) {
-    if (this._defaultCommandGroup && !cmd.helpGroup())
-      cmd.helpGroup(this._defaultCommandGroup);
-  }
+  _initCommandGroup(cmd) {}
 
   /**
killedBy: .commandsGroup when add one command then help contains group
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Greek:\n *alpha/
Received string:  "Usage:  [options] [command]·
Options:
  -h, --help      display help for command·
Commands:
  alpha

[Killed] BooleanLiteral
lib/command.js:2403:38
    * @private
    */
   _initCommandGroup(cmd) {
-    if (this._defaultCommandGroup && !cmd.helpGroup())
+    if (this._defaultCommandGroup && cmd.helpGroup())
       cmd.helpGroup(this._defaultCommandGroup);
   }
killedBy: .commandsGroup when add one command then help contains group
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Greek:\n *alpha/
Received string:  "Usage:  [options] [command]·
Options:
  -h, --help      display help for command·
Commands:
  alpha

[Killed] ConditionalExpression
lib/command.js:2403:9
    * @private
    */
   _initCommandGroup(cmd) {
-    if (this._defaultCommandGroup && !cmd.helpGroup())
+    if (false)
       cmd.helpGroup(this._defaultCommandGroup);
   }
killedBy: .commandsGroup when add one command then help contains group
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Greek:\n *alpha/
Received string:  "Usage:  [options] [command]·
Options:
  -h, --help      display help for command·
Commands:
  alpha

[Killed] BlockStatement
lib/command.js:2420:30
    * @return {Command}
    */
 
-  nameFromFilename(filename) {
-    this._name = path.basename(filename, path.extname(filename));
-
-    return this;
-  }
+  nameFromFilename(filename) {}
 
   /**
killedBy: .parse() called multiple times when parse with different implied program name then name changes
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "script1"
Received: "program"

[Killed] BlockStatement
lib/command.js:2438:23
    * @return {(string|null|Command)}
    */
 
-  executableDir(path) {
-    if (path === undefined) return this._executableDir;
-    this._executableDir = path;
-    return this;
-  }
+  executableDir(path) {}
 
   /**
killedBy: search for subcommand whether perform search for local files when executableDir then search for local files)
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
lib/command.js:2439:9
    */
 
   executableDir(path) {
-    if (path === undefined) return this._executableDir;
+    if (true) return this._executableDir;
     this._executableDir = path;
     return this;
killedBy: search for subcommand whether perform search for local files when executableDir then search for local files)
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] EqualityOperator
lib/command.js:2439:9
    */
 
   executableDir(path) {
-    if (path === undefined) return this._executableDir;
+    if (path !== undefined) return this._executableDir;
     this._executableDir = path;
     return this;
killedBy: search for subcommand whether perform search for local files when executableDir then search for local files)
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
lib/command.js:2451:35
    * @return {string}
    */
 
-  helpInformation(contextOptions) {
-    const helper = this.createHelp();
-    const context = this._getOutputContext(contextOptions);
-    helper.prepareContext({
-      error: context.error,
-      helpWidth: context.helpWidth,
-      outputHasColors: context.hasColors,
-    });
-    const text = helper.formatHelp(this, helper);
-    if (context.hasColors) return text;
-    return this._outputConfiguration.stripColor(text);
-  }
+  helpInformation(contextOptions) {}
 
   /**
killedBy: Option.helpGroup when add one option with helpGroup then help contains group
statusReason: Error: expect(received).toMatch(expected)

Matcher error: received value must be a string

Received has value: undefined

[Killed] ConditionalExpression
lib/command.js:2460:9
       outputHasColors: context.hasColors,
     });
     const text = helper.formatHelp(this, helper);
-    if (context.hasColors) return text;
+    if (false) return text;
     return this._outputConfiguration.stripColor(text);
   }
killedBy: check styles with configureOutput overrides for color when getOutHasColors returns true then help has color
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "RED program DER"
Received string:    "Usage: program [options] <file>·
program description·
Arguments:
  file        arg description·
Options:

[Survived] ConditionalExpression
lib/command.js:2460:9
       outputHasColors: context.hasColors,
     });
     const text = helper.formatHelp(this, helper);
-    if (context.hasColors) return text;
+    if (true) return text;
     return this._outputConfiguration.stripColor(text);
   }

[Killed] ConditionalExpression
lib/command.js:2477:22
    */
 
   _getOutputContext(contextOptions) {
-    contextOptions = contextOptions || {};
+    contextOptions = false;
     const error = !!contextOptions.error;
     let baseWrite;
killedBy: when default writeErr then help error on stderr
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
lib/command.js:2477:22
    */
 
   _getOutputContext(contextOptions) {
-    contextOptions = contextOptions || {};
+    contextOptions = true;
     const error = !!contextOptions.error;
     let baseWrite;
killedBy: when call .help with { error: true } then output on stderr
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Usage:  [options]·
Options:
  -h, --help  display help for command
"

Number of calls: 0

[Killed] BooleanLiteral
lib/command.js:2478:20
 
   _getOutputContext(contextOptions) {
     contextOptions = contextOptions || {};
-    const error = !!contextOptions.error;
+    const error = !contextOptions.error;
     let baseWrite;
     let hasColors;
killedBy: program calls to addHelpText when "before" string then string before built-in help
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
Expected: "text
"

Number of calls: 0

[Killed] ConditionalExpression
lib/command.js:2482:9
     let baseWrite;
     let hasColors;
     let helpWidth;
-    if (error) {
+    if (true) {
       baseWrite = (str) => this._outputConfiguration.writeErr(str);
       hasColors = this._outputConfiguration.getErrHasColors();
killedBy: program calls to addHelpText when "before" string then string before built-in help
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
Expected: "text
"

Number of calls: 0

[Killed] BlockStatement
lib/command.js:2482:16
     let baseWrite;
     let hasColors;
     let helpWidth;
-    if (error) {
-      baseWrite = (str) => this._outputConfiguration.writeErr(str);
-      hasColors = this._outputConfiguration.getErrHasColors();
-      helpWidth = this._outputConfiguration.getErrHelpWidth();
-    } else {
+    if (error) {} else {
       baseWrite = (str) => this._outputConfiguration.writeOut(str);
       hasColors = this._outputConfiguration.getOutHasColors();
killedBy: when call .help with { error: true } then output on stderr
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "(outputHelp)"
Received message:   "baseWrite is not a function"

      3778 |           stryCov_9fa48("1483");
      3779 |           if (stryMutAct_9fa48("1486") ? false : stryMutAct_9fa48("1485") ? true : stryMutAct_9fa48("1484") ? hasColors : (stryCov_9fa48("1484", "1485", "1486"), !hasColors)) str = this._outputConfiguration.strip

[Killed] ArrowFunction
lib/command.js:2483:19
     let hasColors;
     let helpWidth;
     if (error) {
-      baseWrite = (str) => this._outputConfiguration.writeErr(str);
+      baseWrite = () => undefined;
       hasColors = this._outputConfiguration.getErrHasColors();
       helpWidth = this._outputConfiguration.getErrHelpWidth();
killedBy: context checks with full parse when help for error then text is on stderr
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "text
"

Number of calls: 0

[Killed] BlockStatement
lib/command.js:2486:12
       baseWrite = (str) => this._outputConfiguration.writeErr(str);
       hasColors = this._outputConfiguration.getErrHasColors();
       helpWidth = this._outputConfiguration.getErrHelpWidth();
-    } else {
-      baseWrite = (str) => this._outputConfiguration.writeOut(str);
-      hasColors = this._outputConfiguration.getOutHasColors();
-      helpWidth = this._outputConfiguration.getOutHelpWidth();
-    }
+    } else {}
     const write = (str) => {
       if (!hasColors) str = this._outputConfiguration.stripColor(str);
killedBy: when call .help then exit
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "(outputHelp)"
Received message:   "baseWrite is not a function"

      3778 |           stryCov_9fa48("1483");
      3779 |           if (stryMutAct_9fa48("1486") ? false : stryMutAct_9fa48("1485") ? true : stryMutAct_9fa48("1484") ? hasColors : (stryCov_9fa48("1484", "1485", "1486"), !hasColors)) str = this._outputConfiguration.strip

[Killed] ArrowFunction
lib/command.js:2487:19
       hasColors = this._outputConfiguration.getErrHasColors();
       helpWidth = this._outputConfiguration.getErrHelpWidth();
     } else {
-      baseWrite = (str) => this._outputConfiguration.writeOut(str);
+      baseWrite = () => undefined;
       hasColors = this._outputConfiguration.getOutHasColors();
       helpWidth = this._outputConfiguration.getOutHelpWidth();
killedBy: when call help(cb) then display cb output and exit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "reformatted help"

Number of calls: 0

[Killed] BlockStatement
lib/command.js:2491:28
       hasColors = this._outputConfiguration.getOutHasColors();
       helpWidth = this._outputConfiguration.getOutHelpWidth();
     }
-    const write = (str) => {
-      if (!hasColors) str = this._outputConfiguration.stripColor(str);
-      return baseWrite(str);
-    };
+    const write = (str) => {};
     return { error, write, hasColors, helpWidth };
   }
killedBy: when call help(cb) then display cb output and exit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "reformatted help"

Number of calls: 0

[Killed] BooleanLiteral
lib/command.js:2492:11
       helpWidth = this._outputConfiguration.getOutHelpWidth();
     }
     const write = (str) => {
-      if (!hasColors) str = this._outputConfiguration.stripColor(str);
+      if (hasColors) str = this._outputConfiguration.stripColor(str);
       return baseWrite(str);
     };
killedBy: check styles with configureOutput overrides for color when getOutHasColors returns true then help has color
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "RED program DER"
Received string:    "Usage: program [options] <file>·
program description·
Arguments:
  file        arg description·
Options:

[Killed] ConditionalExpression
lib/command.js:2492:11
       helpWidth = this._outputConfiguration.getOutHelpWidth();
     }
     const write = (str) => {
-      if (!hasColors) str = this._outputConfiguration.stripColor(str);
+      if (true) str = this._outputConfiguration.stripColor(str);
       return baseWrite(str);
     };
killedBy: check styles with configureOutput overrides for color when getOutHasColors returns true then help has color
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "RED program DER"
Received string:    "Usage: program [options] <file>·
program description·
Arguments:
  file        arg description·
Options:

[Killed] ConditionalExpression
lib/command.js:2508:9
 
   outputHelp(contextOptions) {
     let deprecatedCallback;
-    if (typeof contextOptions === 'function') {
+    if (false) {
       deprecatedCallback = contextOptions;
       contextOptions = undefined;
killedBy: when call help(cb) then display cb output and exit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "reformatted help"
Received: "Usage:  [options]·
Options:
  -h, --help  display help for command
"

[Killed] ConditionalExpression
lib/command.js:2508:9
 
   outputHelp(contextOptions) {
     let deprecatedCallback;
-    if (typeof contextOptions === 'function') {
+    if (true) {
       deprecatedCallback = contextOptions;
       contextOptions = undefined;
killedBy: when call .help with { error: true } then output on stderr
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "(outputHelp)"
Received message:   "deprecatedCallback is not a function"

      3830 |         } else {
      3831 |           stryCov_9fa48("1502");
    > 3832 |           helpInformation = deprecatedCallback(helpInformation);

[Survived] MethodExpression
lib/command.js:2521:5
       command: this,
     };
 
-    this._getCommandAndAncestors()
-      .reverse()
+    this._getCommandAndAncestors()
       .forEach((command) => command.emit('beforeAllHelp', eventContext));
     this.emit('beforeHelp', eventContext);

[Killed] ArrowFunction
lib/command.js:2523:16
 
     this._getCommandAndAncestors()
       .reverse()
-      .forEach((command) => command.emit('beforeAllHelp', eventContext));
+      .forEach(() => undefined);
     this.emit('beforeHelp', eventContext);
 
killedBy: program calls to addHelpText when "beforeAll" string then string before built-in help
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
Expected: "text
"
Received: "Usage:  [options]·
Options:
  -h, --help  display help for command

[Killed] ConditionalExpression
lib/command.js:2527:9
     this.emit('beforeHelp', eventContext);
 
     let helpInformation = this.helpInformation({ error: outputContext.error });
-    if (deprecatedCallback) {
+    if (true) {
       helpInformation = deprecatedCallback(helpInformation);
       if (
killedBy: when call .help then exit
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "(outputHelp)"
Received message:   "deprecatedCallback is not a function"

      3830 |         } else {
      3831 |           stryCov_9fa48("1502");
    > 3832 |           helpInformation = deprecatedCallback(helpInformation);

[Killed] ConditionalExpression
lib/command.js:2527:9
     this.emit('beforeHelp', eventContext);
 
     let helpInformation = this.helpInformation({ error: outputContext.error });
-    if (deprecatedCallback) {
+    if (false) {
       helpInformation = deprecatedCallback(helpInformation);
       if (
killedBy: when call help(cb) then display cb output and exit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "reformatted help"
Received: "Usage:  [options]·
Options:
  -h, --help  display help for command
"

[Killed] EqualityOperator
lib/command.js:2530:9
     if (deprecatedCallback) {
       helpInformation = deprecatedCallback(helpInformation);
       if (
-        typeof helpInformation !== 'string' &&
+        typeof helpInformation === 'string' &&
         !Buffer.isBuffer(helpInformation)
       ) {
killedBy: when call help(cb) then display cb output and exit
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "(outputHelp)"
Received message:   "outputHelp callback must return a string or a Buffer"

      3836 |             } else {
      3837 |               stryCov_9fa48("1510");
    > 3838 |               throw new Error(stryMutAct_9fa48("1511") ? "" : (stryCov_9fa48("1511"), 'outputHelp callback must return a string or a Buffer'));

[Killed] ConditionalExpression
lib/command.js:2530:9
     if (deprecatedCallback) {
       helpInformation = deprecatedCallback(helpInformation);
       if (
-        typeof helpInformation !== 'string' &&
-        !Buffer.isBuffer(helpInformation)
+        true
       ) {
         throw new Error('outputHelp callback must return a string or a Buffer');
killedBy: when call help(cb) then display cb output and exit
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "(outputHelp)"
Received message:   "outputHelp callback must return a string or a Buffer"

      3836 |             } else {
      3837 |               stryCov_9fa48("1510");
    > 3838 |               throw new Error(stryMutAct_9fa48("1511") ? "" : (stryCov_9fa48("1511"), 'outputHelp callback must return a string or a Buffer'));

[Survived] BooleanLiteral
lib/command.js:2531:9
       helpInformation = deprecatedCallback(helpInformation);
       if (
         typeof helpInformation !== 'string' &&
-        !Buffer.isBuffer(helpInformation)
+        Buffer.isBuffer(helpInformation)
       ) {
         throw new Error('outputHelp callback must return a string or a Buffer');

[Survived] BlockStatement
lib/command.js:2532:9
       if (
         typeof helpInformation !== 'string' &&
         !Buffer.isBuffer(helpInformation)
-      ) {
-        throw new Error('outputHelp callback must return a string or a Buffer');
-      }
+      ) {}
     }
     outputContext.write(helpInformation);

[Survived] OptionalChaining
lib/command.js:2538:9
     }
     outputContext.write(helpInformation);
 
-    if (this._getHelpOption()?.long) {
+    if (this._getHelpOption().long) {
       this.emit(this._getHelpOption().long); // deprecated
     }

[Survived] ConditionalExpression
lib/command.js:2538:9
     }
     outputContext.write(helpInformation);
 
-    if (this._getHelpOption()?.long) {
+    if (true) {
       this.emit(this._getHelpOption().long); // deprecated
     }

[Killed] ArrowFunction
lib/command.js:2542:44
       this.emit(this._getHelpOption().long); // deprecated
     }
     this.emit('afterHelp', eventContext);
-    this._getCommandAndAncestors().forEach((command) =>
-      command.emit('afterAllHelp', eventContext),
+    this._getCommandAndAncestors().forEach(() => undefined,
     );
   }
killedBy: program calls to addHelpText when "afterAll" string then string after built-in help
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 2
Expected: "text
"
Received
       1: "Usage:  [options]·
Options:

[Killed] BlockStatement
lib/command.js:2560:34
    * @return {Command} `this` command for chaining
    */
 
-  helpOption(flags, description) {
-    // Support enabling/disabling built-in help option.
-    if (typeof flags === 'boolean') {
-      if (flags) {
-        if (this._helpOption === null) this._helpOption = undefined; // reenable
-        if (this._defaultOptionGroup) {
-          // make the option to store the group
-          this._initOptionGroup(this._getHelpOption());
-        }
-      } else {
-        this._helpOption = null; // disable
-      }
-      return this;
-    }
-
-    // Customise flags and description.
-    this._helpOption = this.createOption(
-      flags ?? '-h, --help',
-      description ?? 'display help for command',
-    );
-    // init group unless lazy create
-    if (flags || description) this._initOptionGroup(this._helpOption);
-
-    return this;
-  }
+  helpOption(flags, description) {}
 
   /**
killedBy: when no custom setup and call formatHelp direct then effective helpWidth is fallback 80
statusReason: TypeError: Cannot read properties of undefined (reading 'options')

[Killed] ConditionalExpression
lib/command.js:2562:9
 
   helpOption(flags, description) {
     // Support enabling/disabling built-in help option.
-    if (typeof flags === 'boolean') {
+    if (true) {
       if (flags) {
         if (this._helpOption === null) this._helpOption = undefined; // reenable
killedBy: .exitOverride and error details when specify --help then throw CommanderError
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
lib/command.js:2563:11
   helpOption(flags, description) {
     // Support enabling/disabling built-in help option.
     if (typeof flags === 'boolean') {
-      if (flags) {
+      if (false) {
         if (this._helpOption === null) this._helpOption = undefined; // reenable
         if (this._defaultOptionGroup) {
killedBy: helpOption when helpOption(true) after false then helpInformation does include --help
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "--help"
Received string:    "Usage:··
"

[Killed] BlockStatement
lib/command.js:2563:18
   helpOption(flags, description) {
     // Support enabling/disabling built-in help option.
     if (typeof flags === 'boolean') {
-      if (flags) {
-        if (this._helpOption === null) this._helpOption = undefined; // reenable
-        if (this._defaultOptionGroup) {
-          // make the option to store the group
-          this._initOptionGroup(this._getHelpOption());
-        }
-      } else {
+      if (flags) {} else {
         this._helpOption = null; // disable
       }
killedBy: .optionsGroup when .helpOption(true) then help option in group
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Greek:\n *-h, --help/
Received string:  "Usage:  [options]·
Options:
  -h, --help  display help for command
"

[Killed] EqualityOperator
lib/command.js:2564:13
     // Support enabling/disabling built-in help option.
     if (typeof flags === 'boolean') {
       if (flags) {
-        if (this._helpOption === null) this._helpOption = undefined; // reenable
+        if (this._helpOption !== null) this._helpOption = undefined; // reenable
         if (this._defaultOptionGroup) {
           // make the option to store the group
killedBy: helpOption when helpOption(true) after false then helpInformation does include --help
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "--help"
Received string:    "Usage:··
"

[Killed] ConditionalExpression
lib/command.js:2564:13
     // Support enabling/disabling built-in help option.
     if (typeof flags === 'boolean') {
       if (flags) {
-        if (this._helpOption === null) this._helpOption = undefined; // reenable
+        if (false) this._helpOption = undefined; // reenable
         if (this._defaultOptionGroup) {
           // make the option to store the group
killedBy: helpOption when helpOption(true) after false then helpInformation does include --help
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "--help"
Received string:    "Usage:··
"

[Killed] BlockStatement
lib/command.js:2565:39
     if (typeof flags === 'boolean') {
       if (flags) {
         if (this._helpOption === null) this._helpOption = undefined; // reenable
-        if (this._defaultOptionGroup) {
-          // make the option to store the group
-          this._initOptionGroup(this._getHelpOption());
-        }
+        if (this._defaultOptionGroup) {}
       } else {
         this._helpOption = null; // disable
killedBy: .optionsGroup when .helpOption(true) then help option in group
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Greek:\n *-h, --help/
Received string:  "Usage:  [options]·
Options:
  -h, --help  display help for command
"

[Killed] ConditionalExpression
lib/command.js:2565:13
     if (typeof flags === 'boolean') {
       if (flags) {
         if (this._helpOption === null) this._helpOption = undefined; // reenable
-        if (this._defaultOptionGroup) {
+        if (false) {
           // make the option to store the group
           this._initOptionGroup(this._getHelpOption());
killedBy: .optionsGroup when .helpOption(true) then help option in group
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Greek:\n *-h, --help/
Received string:  "Usage:  [options]·
Options:
  -h, --help  display help for command
"

[Killed] BlockStatement
lib/command.js:2569:14
           // make the option to store the group
           this._initOptionGroup(this._getHelpOption());
         }
-      } else {
-        this._helpOption = null; // disable
-      }
+      } else {}
       return this;
     }
killedBy: when no options then Options not included in helpInformation
statusReason: Error: expect(received).not.toMatch(expected)

Expected substring: not "Options"
Received string:        "Usage:  [options]

Options:
  -h, --help  display help for command
"

[Killed] LogicalOperator
lib/command.js:2578:7
     // Customise flags and description.
     this._helpOption = this.createOption(
       flags ?? '-h, --help',
-      description ?? 'display help for command',
+      description && 'display help for command',
     );
     // init group unless lazy create
killedBy: helpOption when helpOption has custom description then helpInformation include custom description
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /-C,--custom-help +custom help output/
Received string:  "Usage:  [options]·
Options:
  -C,--custom-help  display help for command
"

[Killed] ConditionalExpression
lib/command.js:2581:9
       description ?? 'display help for command',
     );
     // init group unless lazy create
-    if (flags || description) this._initOptionGroup(this._helpOption);
+    if (true) this._initOptionGroup(this._helpOption);
 
     return this;
killedBy: .optionsGroup when implicit help option then help option not affected
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Options:\n *-h, --help/
Received string:  "Usage:  [options]·
Greek:
  --alpha
  -h, --help  display help for command
"

[Killed] LogicalOperator
lib/command.js:2581:9
       description ?? 'display help for command',
     );
     // init group unless lazy create
-    if (flags || description) this._initOptionGroup(this._helpOption);
+    if (flags && description) this._initOptionGroup(this._helpOption);
 
     return this;
killedBy: .optionsGroup when .helpOption(flags) then help option in group
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Greek:\n *--assist/
Received string:  "Usage:  [options]·
Options:
  --assist  display help for command
"

[Killed] BlockStatement
lib/command.js:2593:20
    * @returns {(Option | null)} the help option
    * @package
    */
-  _getHelpOption() {
-    // Lazy create help option on demand.
-    if (this._helpOption === undefined) {
-      this.helpOption(undefined, undefined);
-    }
-    return this._helpOption;
-  }
+  _getHelpOption() {}
 
   /**
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 0

  Usage: test [options] [command]

- Options:

[Killed] ConditionalExpression
lib/command.js:2595:9
    */
   _getHelpOption() {
     // Lazy create help option on demand.
-    if (this._helpOption === undefined) {
+    if (false) {
       this.helpOption(undefined, undefined);
     }
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 0

  Usage: test [options] [command]

- Options:

[Killed] ConditionalExpression
lib/command.js:2595:9
    */
   _getHelpOption() {
     // Lazy create help option on demand.
-    if (this._helpOption === undefined) {
+    if (true) {
       this.helpOption(undefined, undefined);
     }
killedBy: when no options then Options not included in helpInformation
statusReason: Error: expect(received).not.toMatch(expected)

Expected substring: not "Options"
Received string:        "Usage:  [options]

Options:
  -h, --help  display help for command
"

[Killed] BlockStatement
lib/command.js:2608:25
    * @param {Option} option
    * @return {Command} `this` command for chaining
    */
-  addHelpOption(option) {
-    this._helpOption = option;
-    this._initOptionGroup(option);
-    return this;
-  }
+  addHelpOption(option) {}
 
   /**
killedBy: Command methods that should return this for chaining when call .addHelpOption() then returns this
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: undefined
