[Killed] BlockStatement
lib/command.js:2622:24
    * @param {{ error: boolean }} [contextOptions] - pass {error:true} to write to stderr instead of stdout
    */
 
-  help(contextOptions) {
-    this.outputHelp(contextOptions);
-    let exitCode = Number(process.exitCode ?? 0); // process.exitCode does allow a string or an integer, but we prefer just a number
-    if (
-      exitCode === 0 &&
-      contextOptions &&
-      typeof contextOptions !== 'function' &&
-      contextOptions.error
-    ) {
-      exitCode = 1;
-    }
-    // message: do not have all displayed text available so only passing placeholder.
-    this._exit(exitCode, 'commander.help', '(outputHelp)');
-  }
+  help(contextOptions) {}
 
   /**
killedBy: help command listed in helpInformation when program has subcommands and specify only unknown option then display help
statusReason: TypeError: Cannot read properties of undefined (reading 'code')

[Killed] LogicalOperator
lib/command.js:2624:27
 
   help(contextOptions) {
     this.outputHelp(contextOptions);
-    let exitCode = Number(process.exitCode ?? 0); // process.exitCode does allow a string or an integer, but we prefer just a number
+    let exitCode = Number(process.exitCode && 0); // process.exitCode does allow a string or an integer, but we prefer just a number
     if (
       exitCode === 0 &&
killedBy: .exitOverride and error details when executable subcommand and no command specified then throw CommanderError
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: NaN

[Killed] ConditionalExpression
lib/command.js:2626:7
     this.outputHelp(contextOptions);
     let exitCode = Number(process.exitCode ?? 0); // process.exitCode does allow a string or an integer, but we prefer just a number
     if (
-      exitCode === 0 &&
-      contextOptions &&
-      typeof contextOptions !== 'function' &&
-      contextOptions.error
+      false
     ) {
       exitCode = 1;
killedBy: .exitOverride and error details when executable subcommand and no command specified then throw CommanderError
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] LogicalOperator
lib/command.js:2626:7
     this.outputHelp(contextOptions);
     let exitCode = Number(process.exitCode ?? 0); // process.exitCode does allow a string or an integer, but we prefer just a number
     if (
-      exitCode === 0 &&
-      contextOptions &&
-      typeof contextOptions !== 'function' &&
-      contextOptions.error
+      exitCode === 0 && contextOptions && typeof contextOptions !== 'function' || contextOptions.error
     ) {
       exitCode = 1;
killedBy: when call .help then exit
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "(outputHelp)"
Received message:   "Cannot read properties of undefined (reading 'error')"

      3973 |       this.outputHelp(contextOptions);
      3974 |       let exitCode = Number(stryMutAct_9fa48("1549") ? process.exitCode && 0 : (stryCov_9fa48("1549"), process.exitCode ?? 0)); // process.exitCode does allow a string or an intege

[Killed] EqualityOperator
lib/command.js:2628:7
     if (
       exitCode === 0 &&
       contextOptions &&
-      typeof contextOptions !== 'function' &&
+      typeof contextOptions === 'function' &&
       contextOptions.error
     ) {
killedBy: .exitOverride and error details when executable subcommand and no command specified then throw CommanderError
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Survived] ConditionalExpression
lib/command.js:2628:7
     if (
       exitCode === 0 &&
       contextOptions &&
-      typeof contextOptions !== 'function' &&
+      true &&
       contextOptions.error
     ) {

[Killed] BlockStatement
lib/command.js:2630:7
       contextOptions &&
       typeof contextOptions !== 'function' &&
       contextOptions.error
-    ) {
-      exitCode = 1;
-    }
+    ) {}
     // message: do not have all displayed text available so only passing placeholder.
     this._exit(exitCode, 'commander.help', '(outputHelp)');
killedBy: .exitOverride and error details when executable subcommand and no command specified then throw CommanderError
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
lib/command.js:2657:31
    * @return {Command} `this` command for chaining
    */
 
-  addHelpText(position, text) {
-    const allowedValues = ['beforeAll', 'before', 'after', 'afterAll'];
-    if (!allowedValues.includes(position)) {
-      throw new Error(`Unexpected value for position to addHelpText.
-Expecting one of '${allowedValues.join("', '")}'`);
-    }
-
-    const helpEvent = `${position}Help`;
-    this.on(helpEvent, (/** @type {HelpTextEventContext} */ context) => {
-      let helpStr;
-      if (typeof text === 'function') {
-        helpStr = text({ error: context.error, command: context.command });
-      } else {
-        helpStr = text;
-      }
-      // Ignore falsy value when nothing to output.
-      if (helpStr) {
-        context.write(`${helpStr}\n`);
-      }
-    });
-    return this;
-  }
+  addHelpText(position, text) {}
 
   /**
killedBy: Command methods that should return this for chaining when call .addHelpText() then returns this
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: undefined

[Killed] StringLiteral
lib/command.js:2658:51
    */
 
   addHelpText(position, text) {
-    const allowedValues = ['beforeAll', 'before', 'after', 'afterAll'];
+    const allowedValues = ['beforeAll', 'before', "", 'afterAll'];
     if (!allowedValues.includes(position)) {
       throw new Error(`Unexpected value for position to addHelpText.
killedBy: program calls to addHelpText when "after" string then string after built-in help
statusReason: Error: Unexpected value for position to addHelpText.
Expecting one of 'beforeAll', 'before', '', 'afterAll'

[Killed] StringLiteral
lib/command.js:2658:28
    */
 
   addHelpText(position, text) {
-    const allowedValues = ['beforeAll', 'before', 'after', 'afterAll'];
+    const allowedValues = ["", 'before', 'after', 'afterAll'];
     if (!allowedValues.includes(position)) {
       throw new Error(`Unexpected value for position to addHelpText.
killedBy: program calls to addHelpText when "beforeAll" string then string before built-in help
statusReason: Error: Unexpected value for position to addHelpText.
Expecting one of '', 'before', 'after', 'afterAll'

[Killed] ConditionalExpression
lib/command.js:2659:9
 
   addHelpText(position, text) {
     const allowedValues = ['beforeAll', 'before', 'after', 'afterAll'];
-    if (!allowedValues.includes(position)) {
+    if (true) {
       throw new Error(`Unexpected value for position to addHelpText.
 Expecting one of '${allowedValues.join("', '")}'`);
killedBy: program calls to addHelpText when "before" string then string before built-in help
statusReason: Error: Unexpected value for position to addHelpText.
Expecting one of 'beforeAll', 'before', 'after', 'afterAll'

[Killed] ConditionalExpression
lib/command.js:2659:9
 
   addHelpText(position, text) {
     const allowedValues = ['beforeAll', 'before', 'after', 'afterAll'];
-    if (!allowedValues.includes(position)) {
+    if (false) {
       throw new Error(`Unexpected value for position to addHelpText.
 Expecting one of '${allowedValues.join("', '")}'`);
killedBy: program calls to addHelpText when "silly" position then throw
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] BlockStatement
lib/command.js:2665:73
     }
 
     const helpEvent = `${position}Help`;
-    this.on(helpEvent, (/** @type {HelpTextEventContext} */ context) => {
-      let helpStr;
-      if (typeof text === 'function') {
-        helpStr = text({ error: context.error, command: context.command });
-      } else {
-        helpStr = text;
-      }
-      // Ignore falsy value when nothing to output.
-      if (helpStr) {
-        context.write(`${helpStr}\n`);
-      }
-    });
+    this.on(helpEvent, (/** @type {HelpTextEventContext} */ context) => {});
     return this;
   }
killedBy: program calls to addHelpText when "before" string then string before built-in help
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
Expected: "text
"
Received: "Usage:  [options]·
Options:
  -h, --help  display help for command

[Killed] EqualityOperator
lib/command.js:2667:11
     const helpEvent = `${position}Help`;
     this.on(helpEvent, (/** @type {HelpTextEventContext} */ context) => {
       let helpStr;
-      if (typeof text === 'function') {
+      if (typeof text !== 'function') {
         helpStr = text({ error: context.error, command: context.command });
       } else {
killedBy: program calls to addHelpText when "before" string then string before built-in help
statusReason: TypeError: text is not a function

[Killed] BlockStatement
lib/command.js:2667:39
     const helpEvent = `${position}Help`;
     this.on(helpEvent, (/** @type {HelpTextEventContext} */ context) => {
       let helpStr;
-      if (typeof text === 'function') {
-        helpStr = text({ error: context.error, command: context.command });
-      } else {
+      if (typeof text === 'function') {} else {
         helpStr = text;
       }
killedBy: program calls to addHelpText when "before" function then function result before built-in help
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
Expected: "text
"
Received: "Usage:  [options]·
Options:
  -h, --help  display help for command

[Killed] ObjectLiteral
lib/command.js:2668:24
     this.on(helpEvent, (/** @type {HelpTextEventContext} */ context) => {
       let helpStr;
       if (typeof text === 'function') {
-        helpStr = text({ error: context.error, command: context.command });
+        helpStr = text({});
       } else {
         helpStr = text;
killedBy: context checks with full parse when help requested then context.error is false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] BlockStatement
lib/command.js:2669:14
       let helpStr;
       if (typeof text === 'function') {
         helpStr = text({ error: context.error, command: context.command });
-      } else {
-        helpStr = text;
-      }
+      } else {}
       // Ignore falsy value when nothing to output.
       if (helpStr) {
killedBy: program calls to addHelpText when "before" string then string before built-in help
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
Expected: "text
"
Received: "Usage:  [options]·
Options:
  -h, --help  display help for command

[Killed] ConditionalExpression
lib/command.js:2673:11
         helpStr = text;
       }
       // Ignore falsy value when nothing to output.
-      if (helpStr) {
+      if (true) {
         context.write(`${helpStr}\n`);
       }
killedBy: program calls to addHelpText when "before" function returns nothing then no effect
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
Expected: "Usage:  [options]·
Options:
  -h, --help  display help for command
"
Received

[Killed] ConditionalExpression
lib/command.js:2673:11
         helpStr = text;
       }
       // Ignore falsy value when nothing to output.
-      if (helpStr) {
+      if (false) {
         context.write(`${helpStr}\n`);
       }
killedBy: program calls to addHelpText when "before" string then string before built-in help
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
Expected: "text
"
Received: "Usage:  [options]·
Options:
  -h, --help  display help for command

[Killed] BlockStatement
lib/command.js:2687:32
    * @private
    */
 
-  _outputHelpIfRequested(args) {
-    const helpOption = this._getHelpOption();
-    const helpRequested = helpOption && args.find((arg) => helpOption.is(arg));
-    if (helpRequested) {
-      this.outputHelp();
-      // (Do not have all displayed text available so only passing placeholder.)
-      this._exit(0, 'commander.helpDisplayed', '(outputHelp)');
-    }
-  }
+  _outputHelpIfRequested(args) {}
 }
 
killedBy: program with passThrough when help option (without command-argument) then help called
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
lib/command.js:2689:27
 
   _outputHelpIfRequested(args) {
     const helpOption = this._getHelpOption();
-    const helpRequested = helpOption && args.find((arg) => helpOption.is(arg));
+    const helpRequested = false;
     if (helpRequested) {
       this.outputHelp();
killedBy: context checks with full parse when help requested then text is on stdout
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "text
"

Number of calls: 0

[Killed] ArrowFunction
lib/command.js:2689:51
 
   _outputHelpIfRequested(args) {
     const helpOption = this._getHelpOption();
-    const helpRequested = helpOption && args.find((arg) => helpOption.is(arg));
+    const helpRequested = helpOption && args.find(() => undefined);
     if (helpRequested) {
       this.outputHelp();
killedBy: .exitOverride and error details when specify --help then throw CommanderError
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
lib/command.js:2690:9
   _outputHelpIfRequested(args) {
     const helpOption = this._getHelpOption();
     const helpRequested = helpOption && args.find((arg) => helpOption.is(arg));
-    if (helpRequested) {
+    if (false) {
       this.outputHelp();
       // (Do not have all displayed text available so only passing placeholder.)
killedBy: addHelpOption when addHelpOption has custom flags then custom short flag invokes help
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "(outputHelp)"
Received message:   "error: unknown option '-c'"

      769 |         } else {
      770 |           stryCov_9fa48("305");
    > 771 |           this._exitCallback(new CommanderError(exitCode, code, message));

[Killed] BlockStatement
lib/command.js:2690:24
   _outputHelpIfRequested(args) {
     const helpOption = this._getHelpOption();
     const helpRequested = helpOption && args.find((arg) => helpOption.is(arg));
-    if (helpRequested) {
-      this.outputHelp();
-      // (Do not have all displayed text available so only passing placeholder.)
-      this._exit(0, 'commander.helpDisplayed', '(outputHelp)');
-    }
+    if (helpRequested) {}
   }
 }
killedBy: addHelpOption when addHelpOption has custom flags then custom short flag invokes help
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "(outputHelp)"
Received message:   "error: unknown option '-c'"

      769 |         } else {
      770 |           stryCov_9fa48("305");
    > 771 |           this._exitCallback(new CommanderError(exitCode, code, message));

[Killed] StringLiteral
lib/command.js:2693:21
     if (helpRequested) {
       this.outputHelp();
       // (Do not have all displayed text available so only passing placeholder.)
-      this._exit(0, 'commander.helpDisplayed', '(outputHelp)');
+      this._exit(0, "", '(outputHelp)');
     }
   }
killedBy: command with conflicting options when conflict on program calling action subcommand with help then show help
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "commander.helpDisplayed"
Received: ""

[Killed] ConditionalExpression
lib/command.js:2712:9
   //  --inspect-brk[=[host:]port]
   //  --inspect-port=[host:]port
   return args.map((arg) => {
-    if (!arg.startsWith('--inspect')) {
+    if (true) {
       return arg;
     }
killedBy: incrementNodeInspectorPort when --inspect then bump port
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "--inspect=127.0.0.1:9230",
+   "--inspect",

[Killed] MethodExpression
lib/command.js:2712:10
   //  --inspect-brk[=[host:]port]
   //  --inspect-port=[host:]port
   return args.map((arg) => {
-    if (!arg.startsWith('--inspect')) {
+    if (!arg.endsWith('--inspect')) {
       return arg;
     }
killedBy: incrementNodeInspectorPort when --inspect=100 then bump port
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "--inspect=127.0.0.1:101",
+   "--inspect=100",

[Killed] EqualityOperator
lib/command.js:2719:9
     let debugHost = '127.0.0.1';
     let debugPort = '9229';
     let match;
-    if ((match = arg.match(/^(--inspect(-brk)?)$/)) !== null) {
+    if ((match = arg.match(/^(--inspect(-brk)?)$/)) === null) {
       // e.g. --inspect
       debugOption = match[1];
killedBy: incrementNodeInspectorPort when --inspect then bump port
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "--inspect=127.0.0.1:9230",
+   "--inspect",

[Killed] ConditionalExpression
lib/command.js:2719:9
     let debugHost = '127.0.0.1';
     let debugPort = '9229';
     let match;
-    if ((match = arg.match(/^(--inspect(-brk)?)$/)) !== null) {
+    if (true) {
       // e.g. --inspect
       debugOption = match[1];
killedBy: incrementNodeInspectorPort when --inspect then bump port
statusReason: TypeError: Cannot read properties of undefined (reading '1')

[Killed] ConditionalExpression
lib/command.js:2723:7
       // e.g. --inspect
       debugOption = match[1];
     } else if (
-      (match = arg.match(/^(--inspect(-brk|-port)?)=([^:]+)$/)) !== null
+      false
     ) {
       debugOption = match[1];
killedBy: incrementNodeInspectorPort when --inspect=100 then bump port
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "--inspect=127.0.0.1:101",
+   "--inspect=100",

[Killed] EqualityOperator
lib/command.js:2723:7
       // e.g. --inspect
       debugOption = match[1];
     } else if (
-      (match = arg.match(/^(--inspect(-brk|-port)?)=([^:]+)$/)) !== null
+      (match = arg.match(/^(--inspect(-brk|-port)?)=([^:]+)$/)) === null
     ) {
       debugOption = match[1];
killedBy: incrementNodeInspectorPort when --inspect=100 then bump port
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "--inspect=127.0.0.1:101",
+   "--inspect=100",

[Killed] BlockStatement
lib/command.js:2724:7
       debugOption = match[1];
     } else if (
       (match = arg.match(/^(--inspect(-brk|-port)?)=([^:]+)$/)) !== null
-    ) {
-      debugOption = match[1];
-      if (/^\d+$/.test(match[3])) {
-        // e.g. --inspect=1234
-        debugPort = match[3];
-      } else {
-        // e.g. --inspect=localhost
-        debugHost = match[3];
-      }
-    } else if (
+    ) {} else if (
       (match = arg.match(/^(--inspect(-brk|-port)?)=([^:]+):(\d+)$/)) !== null
     ) {
killedBy: incrementNodeInspectorPort when --inspect=100 then bump port
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "--inspect=127.0.0.1:101",
+   "--inspect=100",

[Killed] ConditionalExpression
lib/command.js:2726:11
       (match = arg.match(/^(--inspect(-brk|-port)?)=([^:]+)$/)) !== null
     ) {
       debugOption = match[1];
-      if (/^\d+$/.test(match[3])) {
+      if (true) {
         // e.g. --inspect=1234
         debugPort = match[3];
killedBy: incrementNodeInspectorPort when --inspect=1.2.3.4 then bump port
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "--inspect=1.2.3.4:9230",
+   "--inspect=127.0.0.1:2",

[Killed] ConditionalExpression
lib/command.js:2726:11
       (match = arg.match(/^(--inspect(-brk|-port)?)=([^:]+)$/)) !== null
     ) {
       debugOption = match[1];
-      if (/^\d+$/.test(match[3])) {
+      if (false) {
         // e.g. --inspect=1234
         debugPort = match[3];
killedBy: incrementNodeInspectorPort when --inspect=100 then bump port
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "--inspect=127.0.0.1:101",
+   "--inspect=100:9230",

[Killed] BlockStatement
lib/command.js:2729:14
       if (/^\d+$/.test(match[3])) {
         // e.g. --inspect=1234
         debugPort = match[3];
-      } else {
-        // e.g. --inspect=localhost
-        debugHost = match[3];
-      }
+      } else {}
     } else if (
       (match = arg.match(/^(--inspect(-brk|-port)?)=([^:]+):(\d+)$/)) !== null
killedBy: incrementNodeInspectorPort when --inspect=1.2.3.4 then bump port
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "--inspect=1.2.3.4:9230",
+   "--inspect=127.0.0.1:9230",

[Killed] EqualityOperator
lib/command.js:2734:7
         debugHost = match[3];
       }
     } else if (
-      (match = arg.match(/^(--inspect(-brk|-port)?)=([^:]+):(\d+)$/)) !== null
+      (match = arg.match(/^(--inspect(-brk|-port)?)=([^:]+):(\d+)$/)) === null
     ) {
       // e.g. --inspect=localhost:1234
killedBy: incrementNodeInspectorPort when --inspect=1.2.3.4:100 then bump port
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "--inspect=1.2.3.4:101",
+   "--inspect=1.2.3.4:100",

[Killed] ConditionalExpression
lib/command.js:2734:7
         debugHost = match[3];
       }
     } else if (
-      (match = arg.match(/^(--inspect(-brk|-port)?)=([^:]+):(\d+)$/)) !== null
+      true
     ) {
       // e.g. --inspect=localhost:1234
killedBy: incrementNodeInspectorPort when --inspect=1.2.3.4:100 then bump port
statusReason: TypeError: Cannot read properties of null (reading '1')

[Killed] BlockStatement
lib/command.js:2735:7
       }
     } else if (
       (match = arg.match(/^(--inspect(-brk|-port)?)=([^:]+):(\d+)$/)) !== null
-    ) {
-      // e.g. --inspect=localhost:1234
-      debugOption = match[1];
-      debugHost = match[3];
-      debugPort = match[4];
-    }
+    ) {}
 
     if (debugOption && debugPort !== '0') {
killedBy: incrementNodeInspectorPort when --inspect=1.2.3.4:100 then bump port
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "--inspect=1.2.3.4:101",
+   "--inspect=1.2.3.4:100",

[Killed] ConditionalExpression
lib/command.js:2742:9
       debugPort = match[4];
     }
 
-    if (debugOption && debugPort !== '0') {
+    if (false) {
       return `${debugOption}=${debugHost}:${parseInt(debugPort) + 1}`;
     }
killedBy: incrementNodeInspectorPort when --inspect then bump port
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "--inspect=127.0.0.1:9230",
+   "--inspect",

[Killed] LogicalOperator
lib/command.js:2742:9
       debugPort = match[4];
     }
 
-    if (debugOption && debugPort !== '0') {
+    if (debugOption || debugPort !== '0') {
       return `${debugOption}=${debugHost}:${parseInt(debugPort) + 1}`;
     }
killedBy: incrementNodeInspectorPort when --inspect-unexpected then unchanged
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "--inspect-unexpected",
+   "undefined=127.0.0.1:9230",

[Killed] ArithmeticOperator
lib/command.js:2743:45
     }
 
     if (debugOption && debugPort !== '0') {
-      return `${debugOption}=${debugHost}:${parseInt(debugPort) + 1}`;
+      return `${debugOption}=${debugHost}:${parseInt(debugPort) - 1}`;
     }
     return arg;
killedBy: incrementNodeInspectorPort when --inspect then bump port
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "--inspect=127.0.0.1:9230",
+   "--inspect=127.0.0.1:9228",

[Killed] BlockStatement
lib/command.js:2753:21
  * @returns {boolean | undefined}
  * @package
  */
-function useColor() {
-  // Test for common conventions.
-  // NB: the observed behaviour is in combination with how author adds color! For example:
-  //   - we do not test NODE_DISABLE_COLORS, but util:styletext does
-  //   - we do test NO_COLOR, but Chalk does not
-  //
-  // References:
-  // https://no-color.org
-  // https://bixense.com/clicolors/
-  // https://github.com/nodejs/node/blob/0a00217a5f67ef4a22384cfc80eb6dd9a917fdc1/lib/internal/tty.js#L109
-  // https://github.com/chalk/supports-color/blob/c214314a14bcb174b12b3014b2b0a8de375029ae/index.js#L33
-  // (https://force-color.org recent web page from 2023, does not match major javascript implementations)
-
-  if (
-    process.env.NO_COLOR ||
-    process.env.FORCE_COLOR === '0' ||
-    process.env.FORCE_COLOR === 'false'
-  )
-    return false;
-  if (process.env.FORCE_COLOR || process.env.CLICOLOR_FORCE !== undefined)
-    return true;
-  return undefined;
-}
+function useColor() {}
 
 exports.Command = Command;
killedBy: internal useColor environment variable support when NO_COLOR defined then returns false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] ConditionalExpression
lib/command.js:2767:5
   // (https://force-color.org recent web page from 2023, does not match major javascript implementations)
 
   if (
-    process.env.NO_COLOR ||
-    process.env.FORCE_COLOR === '0' ||
+    false ||
     process.env.FORCE_COLOR === 'false'
   )
killedBy: internal useColor environment variable support when NO_COLOR defined then returns false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] ConditionalExpression
lib/command.js:2767:5
   // (https://force-color.org recent web page from 2023, does not match major javascript implementations)
 
   if (
-    process.env.NO_COLOR ||
-    process.env.FORCE_COLOR === '0' ||
-    process.env.FORCE_COLOR === 'false'
+    false
   )
     return false;
killedBy: internal useColor environment variable support when NO_COLOR defined then returns false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] ConditionalExpression
lib/command.js:2768:5
 
   if (
     process.env.NO_COLOR ||
-    process.env.FORCE_COLOR === '0' ||
+    false ||
     process.env.FORCE_COLOR === 'false'
   )
killedBy: internal useColor environment variable support when FORCE_COLOR=0 then returns false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
lib/command.js:2768:5
 
   if (
     process.env.NO_COLOR ||
-    process.env.FORCE_COLOR === '0' ||
+    process.env.FORCE_COLOR !== '0' ||
     process.env.FORCE_COLOR === 'false'
   )
killedBy: internal useColor environment variable support when no ENV defined then returns undefined
statusReason: Error: expect(received).toBeUndefined()

Received: false

[Killed] ConditionalExpression
lib/command.js:2769:5
   if (
     process.env.NO_COLOR ||
     process.env.FORCE_COLOR === '0' ||
-    process.env.FORCE_COLOR === 'false'
+    false
   )
     return false;
killedBy: internal useColor environment variable support when FORCE_COLOR=false then returns false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
lib/command.js:2769:5
   if (
     process.env.NO_COLOR ||
     process.env.FORCE_COLOR === '0' ||
-    process.env.FORCE_COLOR === 'false'
+    process.env.FORCE_COLOR !== 'false'
   )
     return false;
killedBy: internal useColor environment variable support when no ENV defined then returns undefined
statusReason: Error: expect(received).toBeUndefined()

Received: false

[Killed] EqualityOperator
lib/command.js:2772:34
     process.env.FORCE_COLOR === 'false'
   )
     return false;
-  if (process.env.FORCE_COLOR || process.env.CLICOLOR_FORCE !== undefined)
+  if (process.env.FORCE_COLOR || process.env.CLICOLOR_FORCE === undefined)
     return true;
   return undefined;
killedBy: internal useColor environment variable support when no ENV defined then returns undefined
statusReason: Error: expect(received).toBeUndefined()

Received: true

[Killed] ConditionalExpression
lib/command.js:2772:7
     process.env.FORCE_COLOR === 'false'
   )
     return false;
-  if (process.env.FORCE_COLOR || process.env.CLICOLOR_FORCE !== undefined)
+  if (true)
     return true;
   return undefined;
killedBy: internal useColor environment variable support when no ENV defined then returns undefined
statusReason: Error: expect(received).toBeUndefined()

Received: true

[Killed] BooleanLiteral
lib/command.js:2773:12
   )
     return false;
   if (process.env.FORCE_COLOR || process.env.CLICOLOR_FORCE !== undefined)
-    return true;
+    return false;
   return undefined;
 }
killedBy: internal useColor environment variable support when CLICOLOR_FORCE defined then returns true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
