[Killed] LogicalOperator
lib/argument.js:14:24
    */
 
   constructor(name, description) {
-    this.description = description || '';
+    this.description = description && '';
     this.variadic = false;
     this.parseArg = undefined;
killedBy: padWidth when argument term longest return argument length
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 29
Received: 14

[Killed] ConditionalExpression
lib/argument.js:14:24
    */
 
   constructor(name, description) {
-    this.description = description || '';
+    this.description = false;
     this.variadic = false;
     this.parseArg = undefined;
killedBy: visibleArguments when argument and argument description then returned
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
lib/argument.js:22:7
     this.argChoices = undefined;
 
     switch (name[0]) {
-      case '<': // e.g. <required>
-        this.required = true;
-        this._name = name.slice(1, -1);
-        break;
+      case '<':
       case '[': // e.g. [optional]
         this.required = false;
killedBy: subcommandTerm when command has <argument> then returns name <argument>
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "program <argument>"
Received: "program [argument]"

[Killed] BooleanLiteral
lib/argument.js:23:25
 
     switch (name[0]) {
       case '<': // e.g. <required>
-        this.required = true;
+        this.required = false;
         this._name = name.slice(1, -1);
         break;
killedBy: when add "<arg>" using .arguments then argument required
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 6

- Object {
+ Argument {
    "_name": "explicit-required",

[Killed] BooleanLiteral
lib/argument.js:31:25
         this._name = name.slice(1, -1);
         break;
       default:
-        this.required = true;
+        this.required = false;
         this._name = name;
         break;
killedBy: when add "arg" using .arguments then argument required
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 6

- Object {
+ Argument {
    "_name": "implicit-required",

[Survived] EqualityOperator
lib/argument.js:36:9
         break;
     }
 
-    if (this._name.length > 3 && this._name.slice(-3) === '...') {
+    if (this._name.length >= 3 && this._name.slice(-3) === '...') {
       this.variadic = true;
       this._name = this._name.slice(0, -3);

[Survived] ConditionalExpression
lib/argument.js:36:9
         break;
     }
 
-    if (this._name.length > 3 && this._name.slice(-3) === '...') {
+    if (true && this._name.slice(-3) === '...') {
       this.variadic = true;
       this._name = this._name.slice(0, -3);

[Killed] UnaryOperator
lib/argument.js:38:40
 
     if (this._name.length > 3 && this._name.slice(-3) === '...') {
       this.variadic = true;
-      this._name = this._name.slice(0, -3);
+      this._name = this._name.slice(0, +3);
     }
   }
killedBy: when add "<arg...>" using .arguments then argument required and variadic
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 6

- Object {
-   "_name": "explicit-required",
+ Argument {

[Killed] MethodExpression
lib/argument.js:38:20
 
     if (this._name.length > 3 && this._name.slice(-3) === '...') {
       this.variadic = true;
-      this._name = this._name.slice(0, -3);
+      this._name = this._name;
     }
   }
killedBy: when add "<arg...>" using .arguments then argument required and variadic
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 6

- Object {
-   "_name": "explicit-required",
+ Argument {

[Killed] BlockStatement
lib/argument.js:56:33
    * @package
    */
 
-  _concatValue(value, previous) {
-    if (previous === this.defaultValue || !Array.isArray(previous)) {
-      return [value];
-    }
-
-    return previous.concat(value);
-  }
+  _concatValue(value, previous) {}
 
   /**
killedBy: variadic argument when variadic used with choices and one value then set in array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["one"]
Received: undefined

[Killed] ConditionalExpression
lib/argument.js:57:9
    */
 
   _concatValue(value, previous) {
-    if (previous === this.defaultValue || !Array.isArray(previous)) {
+    if (false) {
       return [value];
     }
killedBy: variadic argument when variadic used with choices and one value then set in array
statusReason: TypeError: Cannot read properties of undefined (reading 'concat')

[Killed] BooleanLiteral
lib/argument.js:57:43
    */
 
   _concatValue(value, previous) {
-    if (previous === this.defaultValue || !Array.isArray(previous)) {
+    if (previous === this.defaultValue || Array.isArray(previous)) {
       return [value];
     }
killedBy: variadic argument when variadic used with choices and two values then set in array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
-   "one",
    "two",

[Killed] BlockStatement
lib/argument.js:97:19
    * @return {Argument}
    */
 
-  choices(values) {
-    this.argChoices = values.slice();
-    this.parseArg = (arg, previous) => {
-      if (!this.argChoices.includes(arg)) {
-        throw new InvalidArgumentError(
-          `Allowed choices are ${this.argChoices.join(', ')}.`,
-        );
-      }
-      if (this.variadic) {
-        return this._concatValue(arg, previous);
-      }
-      return arg;
-    };
-    return this;
-  }
+  choices(values) {}
 
   /**
killedBy: variadic argument when variadic used with choices and one value then set in array
statusReason: TypeError: Cannot read properties of undefined (reading 'required')

[Killed] BlockStatement
lib/argument.js:99:40
 
   choices(values) {
     this.argChoices = values.slice();
-    this.parseArg = (arg, previous) => {
-      if (!this.argChoices.includes(arg)) {
-        throw new InvalidArgumentError(
-          `Allowed choices are ${this.argChoices.join(', ')}.`,
-        );
-      }
-      if (this.variadic) {
-        return this._concatValue(arg, previous);
-      }
-      return arg;
-    };
+    this.parseArg = (arg, previous) => {};
     return this;
   }
killedBy: .exitOverride and error details when command argument not in choices then throw CommanderError
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: CommanderError

Received value has no prototype
Received value: undefined

[Killed] BlockStatement
lib/argument.js:105:26
           `Allowed choices are ${this.argChoices.join(', ')}.`,
         );
       }
-      if (this.variadic) {
-        return this._concatValue(arg, previous);
-      }
+      if (this.variadic) {}
       return arg;
     };
killedBy: variadic argument when variadic used with choices and one value then set in array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["one"]
Received: "one"

[Killed] ConditionalExpression
lib/argument.js:105:11
           `Allowed choices are ${this.argChoices.join(', ')}.`,
         );
       }
-      if (this.variadic) {
+      if (true) {
         return this._concatValue(arg, previous);
       }
killedBy: when command argument in choices then argument set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "red"
Received: ["red"]

[Killed] BlockStatement
lib/argument.js:118:17
    *
    * @returns {Argument}
    */
-  argRequired() {
-    this.required = true;
-    return this;
-  }
+  argRequired() {}
 
   /**
killedBy: when call .argRequired() then argument required
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
lib/argument.js:119:21
    * @returns {Argument}
    */
   argRequired() {
-    this.required = true;
+    this.required = false;
     return this;
   }
killedBy: when call .argRequired() then argument required
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
lib/argument.js:128:17
    *
    * @returns {Argument}
    */
-  argOptional() {
-    this.required = false;
-    return this;
-  }
+  argOptional() {}
 }
 
killedBy: Argument methods that should return this for chaining when call .argOptional() then returns this
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"_name": "value", "argChoices": undefined, "defaultValue": undefined, "defaultValueDescription": undefined, "description": "", "parseArg": undefined, "required": true, "variadic": false}
Received: undefined

[Killed] BooleanLiteral
lib/argument.js:129:21
    * @returns {Argument}
    */
   argOptional() {
-    this.required = false;
+    this.required = true;
     return this;
   }
killedBy: when call .argOptional() then argument optional
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
lib/argument.js:142:36
  * @private
  */
 
-function humanReadableArgName(arg) {
-  const nameOutput = arg.name() + (arg.variadic === true ? '...' : '');
-
-  return arg.required ? '<' + nameOutput + '>' : '[' + nameOutput + ']';
-}
+function humanReadableArgName(arg) {}
 
 exports.Argument = Argument;
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 3

  Usage: test [options] [command]

  Options:

[Killed] ConditionalExpression
lib/argument.js:143:36
  */
 
 function humanReadableArgName(arg) {
-  const nameOutput = arg.name() + (arg.variadic === true ? '...' : '');
+  const nameOutput = arg.name() + (false ? '...' : '');
 
   return arg.required ? '<' + nameOutput + '>' : '[' + nameOutput + ']';
killedBy: variadic argument when variadic argument then usage shows variadic
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "[options] [args...]"
Received: "[options] [args]"

[Killed] ArithmeticOperator
lib/argument.js:143:22
  */
 
 function humanReadableArgName(arg) {
-  const nameOutput = arg.name() + (arg.variadic === true ? '...' : '');
+  const nameOutput = arg.name() - (arg.variadic === true ? '...' : '');
 
   return arg.required ? '<' + nameOutput + '>' : '[' + nameOutput + ']';
killedBy: variadic argument when variadic argument then usage shows variadic
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "[options] [args...]"
Received: "[options] [NaN]"
