[Killed] BlockStatement
lib/error.js:11:40
    * @param {string} code an id string representing the error
    * @param {string} message human-readable description of the error
    */
-  constructor(exitCode, code, message) {
-    super(message);
-    // properly capture stack trace in Node.js
-    Error.captureStackTrace(this, this.constructor);
-    this.name = this.constructor.name;
-    this.code = code;
-    this.exitCode = exitCode;
-    this.nestedError = undefined;
-  }
+  constructor(exitCode, code, message) {}
 }
 
killedBy: when error called with code and exitOverride then throws with code
statusReason: TypeError: Cannot read properties of undefined (reading 'code')

[Killed] BlockStatement
lib/error.js:30:24
    * Constructs the InvalidArgumentError class
    * @param {string} [message] explanation of why argument is invalid
    */
-  constructor(message) {
-    super(1, 'commander.invalidArgument', message);
-    // properly capture stack trace in Node.js
-    Error.captureStackTrace(this, this.constructor);
-    this.name = this.constructor.name;
-  }
+  constructor(message) {}
 }
 
killedBy: InvalidArgumentError
statusReason: ReferenceError: Must call super constructor in derived class before accessing 'this' or returning from derived constructor
