[Killed] BlockStatement
lib/help.js:13:17
 
 // Although this is a class, methods are static in style to allow override using subclass or just functions.
 class Help {
-  constructor() {
-    this.helpWidth = undefined;
-    this.minWidthToWrap = 40;
-    this.sortSubcommands = false;
-    this.sortOptions = false;
-    this.showGlobalOptions = false;
-  }
+  constructor() {}
 
   /**
killedBy: when set width 12 (too small) then skip wrap
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

-  x x x x x x x x yy yy yy yy yy yy
+  x x x x x x x
+ x yy yy yy yy

[Killed] BooleanLiteral
lib/help.js:16:28
   constructor() {
     this.helpWidth = undefined;
     this.minWidthToWrap = 40;
-    this.sortSubcommands = false;
+    this.sortSubcommands = true;
     this.sortOptions = false;
     this.showGlobalOptions = false;
killedBy: visibleCommands when add command then visible (with help)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "sub",
    "help",

[Killed] BooleanLiteral
lib/help.js:17:24
     this.helpWidth = undefined;
     this.minWidthToWrap = 40;
     this.sortSubcommands = false;
-    this.sortOptions = false;
+    this.sortOptions = true;
     this.showGlobalOptions = false;
   }
killedBy: sortOptions when unsorted then options in order added
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "zzz",
    "aaa",

[Killed] BooleanLiteral
lib/help.js:18:30
     this.minWidthToWrap = 40;
     this.sortSubcommands = false;
     this.sortOptions = false;
-    this.showGlobalOptions = false;
+    this.showGlobalOptions = true;
   }
 
killedBy: when default configuration then global options hidden
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "global"
Received string:        "Usage:  sub [options]

Options:
  -h, --help  display help for command

[Killed] BlockStatement
lib/help.js:29:34
    *
    * @param {{ error?: boolean, helpWidth?: number, outputHasColors?: boolean }} contextOptions
    */
-  prepareContext(contextOptions) {
-    this.helpWidth = this.helpWidth ?? contextOptions.helpWidth ?? 80;
-  }
+  prepareContext(contextOptions) {}
 
   /**
killedBy: when default getOutHelpWidth then help helpWidth from stdout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 123
Received: undefined

[Killed] LogicalOperator
lib/help.js:30:22
    * @param {{ error?: boolean, helpWidth?: number, outputHasColors?: boolean }} contextOptions
    */
   prepareContext(contextOptions) {
-    this.helpWidth = this.helpWidth ?? contextOptions.helpWidth ?? 80;
+    this.helpWidth = (this.helpWidth ?? contextOptions.helpWidth) && 80;
   }
 
killedBy: when default getOutHelpWidth then help helpWidth from stdout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 123
Received: 80

[Killed] LogicalOperator
lib/help.js:30:22
    * @param {{ error?: boolean, helpWidth?: number, outputHasColors?: boolean }} contextOptions
    */
   prepareContext(contextOptions) {
-    this.helpWidth = this.helpWidth ?? contextOptions.helpWidth ?? 80;
+    this.helpWidth = this.helpWidth && contextOptions.helpWidth ?? 80;
   }
 
killedBy: when default getOutHelpWidth then help helpWidth from stdout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 123
Received: 80

[Killed] BooleanLiteral
lib/help.js:41:58
    */
 
   visibleCommands(cmd) {
-    const visibleCommands = cmd.commands.filter((cmd) => !cmd._hidden);
+    const visibleCommands = cmd.commands.filter((cmd) => cmd._hidden);
     const helpCommand = cmd._getHelpCommand();
     if (helpCommand && !helpCommand._hidden) {
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 2

  Usage: test [options] [command]

  Options:

[Killed] MethodExpression
lib/help.js:41:29
    */
 
   visibleCommands(cmd) {
-    const visibleCommands = cmd.commands.filter((cmd) => !cmd._hidden);
+    const visibleCommands = cmd.commands;
     const helpCommand = cmd._getHelpCommand();
     if (helpCommand && !helpCommand._hidden) {
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 2

@@ -3,7 +3,8 @@
  Options:
    -h, --help         display help for command

[Killed] BlockStatement
lib/help.js:43:46
   visibleCommands(cmd) {
     const visibleCommands = cmd.commands.filter((cmd) => !cmd._hidden);
     const helpCommand = cmd._getHelpCommand();
-    if (helpCommand && !helpCommand._hidden) {
-      visibleCommands.push(helpCommand);
-    }
+    if (helpCommand && !helpCommand._hidden) {}
     if (this.sortSubcommands) {
       visibleCommands.sort((a, b) => {
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

@@ -2,8 +2,7 @@

  Options:

[Killed] ConditionalExpression
lib/help.js:43:9
   visibleCommands(cmd) {
     const visibleCommands = cmd.commands.filter((cmd) => !cmd._hidden);
     const helpCommand = cmd._getHelpCommand();
-    if (helpCommand && !helpCommand._hidden) {
+    if (false) {
       visibleCommands.push(helpCommand);
     }
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

@@ -2,8 +2,7 @@

  Options:

[Killed] ConditionalExpression
lib/help.js:46:9
     if (helpCommand && !helpCommand._hidden) {
       visibleCommands.push(helpCommand);
     }
-    if (this.sortSubcommands) {
+    if (false) {
       visibleCommands.sort((a, b) => {
         // @ts-ignore: because overloaded return type
killedBy: .commandsGroup when set sortCommands then commands are sorted within groups
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Latin:\n *duo\n *unus/
Received string:  "Usage:  [options] [command]·
Options:
  -h, --help      display help for command·
Latin:
  unus

[Killed] ConditionalExpression
lib/help.js:46:9
     if (helpCommand && !helpCommand._hidden) {
       visibleCommands.push(helpCommand);
     }
-    if (this.sortSubcommands) {
+    if (true) {
       visibleCommands.sort((a, b) => {
         // @ts-ignore: because overloaded return type
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 2

@@ -2,8 +2,8 @@

  Options:

[Killed] BlockStatement
lib/help.js:47:38
       visibleCommands.push(helpCommand);
     }
     if (this.sortSubcommands) {
-      visibleCommands.sort((a, b) => {
-        // @ts-ignore: because overloaded return type
-        return a.name().localeCompare(b.name());
-      });
+      visibleCommands.sort((a, b) => {});
     }
     return visibleCommands;
killedBy: .commandsGroup when set sortCommands then commands are sorted within groups
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Latin:\n *duo\n *unus/
Received string:  "Usage:  [options] [command]·
Options:
  -h, --help      display help for command·
Latin:
  unus

[Killed] MethodExpression
lib/help.js:47:7
       visibleCommands.push(helpCommand);
     }
     if (this.sortSubcommands) {
-      visibleCommands.sort((a, b) => {
-        // @ts-ignore: because overloaded return type
-        return a.name().localeCompare(b.name());
-      });
+      visibleCommands;
     }
     return visibleCommands;
killedBy: .commandsGroup when set sortCommands then commands are sorted within groups
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Latin:\n *duo\n *unus/
Received string:  "Usage:  [options] [command]·
Options:
  -h, --help      display help for command·
Latin:
  unus

[Killed] BlockStatement
lib/help.js:62:24
    * @param {Option} b
    * @returns {number}
    */
-  compareOptions(a, b) {
-    const getSortKey = (option) => {
-      // WYSIWYG for order displayed in help. Short used for comparison if present. No special handling for negated.
-      return option.short
-        ? option.short.replace(/^-/, '')
-        : option.long.replace(/^--/, '');
-    };
-    return getSortKey(a).localeCompare(getSortKey(b));
-  }
+  compareOptions(a, b) {}
 
   /**
killedBy: when showGlobalOptions:true and sortOptions: true then global options sorted
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Global Options:
  -1
  -2
  -3
  -4
  -5

[Killed] BlockStatement
lib/help.js:63:36
    * @returns {number}
    */
   compareOptions(a, b) {
-    const getSortKey = (option) => {
-      // WYSIWYG for order displayed in help. Short used for comparison if present. No special handling for negated.
-      return option.short
-        ? option.short.replace(/^-/, '')
-        : option.long.replace(/^--/, '');
-    };
+    const getSortKey = (option) => {};
     return getSortKey(a).localeCompare(getSortKey(b));
   }
killedBy: .optionsGroup when set sortOptions then options are sorted within groups
statusReason: TypeError: Cannot read properties of undefined (reading 'localeCompare')

[Killed] BooleanLiteral
lib/help.js:80:59
    */
 
   visibleOptions(cmd) {
-    const visibleOptions = cmd.options.filter((option) => !option.hidden);
+    const visibleOptions = cmd.options.filter((option) => option.hidden);
     // Built-in help option.
     const helpOption = cmd._getHelpOption();
killedBy: when cli of --a and options ["--ab"] then suggest --ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "--ab"
Received: null

[Killed] ArrowFunction
lib/help.js:80:47
    */
 
   visibleOptions(cmd) {
-    const visibleOptions = cmd.options.filter((option) => !option.hidden);
+    const visibleOptions = cmd.options.filter(() => undefined);
     // Built-in help option.
     const helpOption = cmd._getHelpOption();
killedBy: when negated option then option included in helpInformation
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "--no-colour"
Received string:    "Usage:  [options]·
Options:
  -h, --help  display help for command
"

[Killed] ConditionalExpression
lib/help.js:83:9
     const visibleOptions = cmd.options.filter((option) => !option.hidden);
     // Built-in help option.
     const helpOption = cmd._getHelpOption();
-    if (helpOption && !helpOption.hidden) {
+    if (true) {
       // Automatically hide conflicting flags. Bit dubious but a historical behaviour that is convenient for single-command programs.
       const removeShort = helpOption.short && cmd._findOption(helpOption.short);
killedBy: when no options then Options not included in helpInformation
statusReason: TypeError: Cannot read properties of null (reading 'short')

[Killed] ConditionalExpression
lib/help.js:83:9
     const visibleOptions = cmd.options.filter((option) => !option.hidden);
     // Built-in help option.
     const helpOption = cmd._getHelpOption();
-    if (helpOption && !helpOption.hidden) {
+    if (false) {
       // Automatically hide conflicting flags. Bit dubious but a historical behaviour that is convenient for single-command programs.
       const removeShort = helpOption.short && cmd._findOption(helpOption.short);
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 0

  Usage: test [options] [command]

- Options:

[Killed] ConditionalExpression
lib/help.js:85:27
     const helpOption = cmd._getHelpOption();
     if (helpOption && !helpOption.hidden) {
       // Automatically hide conflicting flags. Bit dubious but a historical behaviour that is convenient for single-command programs.
-      const removeShort = helpOption.short && cmd._findOption(helpOption.short);
+      const removeShort = false;
       const removeLong = helpOption.long && cmd._findOption(helpOption.long);
       if (!removeShort && !removeLong) {
killedBy: when help short flag masked then not displayed in helpInformation
statusReason: Error: expect(received).not.toMatch(expected)

Expected pattern: not /\W-h\W.*display help/
Received string:      "Usage:  [options]

Options:
  -h, --host  select host
  -h, --help  display help for command

[Killed] ConditionalExpression
lib/help.js:85:27
     const helpOption = cmd._getHelpOption();
     if (helpOption && !helpOption.hidden) {
       // Automatically hide conflicting flags. Bit dubious but a historical behaviour that is convenient for single-command programs.
-      const removeShort = helpOption.short && cmd._findOption(helpOption.short);
+      const removeShort = true;
       const removeLong = helpOption.long && cmd._findOption(helpOption.long);
       if (!removeShort && !removeLong) {
killedBy: .optionsGroup when implicit help option then help option not affected
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Options:\n *-h, --help/
Received string:  "Usage:  [options]·
Greek:
  --alpha·
Options:
  --help   display help for command

[Killed] LogicalOperator
lib/help.js:86:26
     if (helpOption && !helpOption.hidden) {
       // Automatically hide conflicting flags. Bit dubious but a historical behaviour that is convenient for single-command programs.
       const removeShort = helpOption.short && cmd._findOption(helpOption.short);
-      const removeLong = helpOption.long && cmd._findOption(helpOption.long);
+      const removeLong = helpOption.long || cmd._findOption(helpOption.long);
       if (!removeShort && !removeLong) {
         visibleOptions.push(helpOption); // no changes needed
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  Usage: test [options] [command]

  Options:

[Killed] ConditionalExpression
lib/help.js:86:26
     if (helpOption && !helpOption.hidden) {
       // Automatically hide conflicting flags. Bit dubious but a historical behaviour that is convenient for single-command programs.
       const removeShort = helpOption.short && cmd._findOption(helpOption.short);
-      const removeLong = helpOption.long && cmd._findOption(helpOption.long);
+      const removeLong = false;
       if (!removeShort && !removeLong) {
         visibleOptions.push(helpOption); // no changes needed
killedBy: when both help flags masked then not displayed in helpInformation
statusReason: Error: expect(received).not.toMatch(expected)

Expected substring: not "display help"
Received string:        "Usage:  [options]

Options:
  -h, --help  custom
  --help      display help for command

[Killed] BooleanLiteral
lib/help.js:87:11
       // Automatically hide conflicting flags. Bit dubious but a historical behaviour that is convenient for single-command programs.
       const removeShort = helpOption.short && cmd._findOption(helpOption.short);
       const removeLong = helpOption.long && cmd._findOption(helpOption.long);
-      if (!removeShort && !removeLong) {
+      if (removeShort && !removeLong) {
         visibleOptions.push(helpOption); // no changes needed
       } else if (helpOption.long && !removeLong) {
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  Usage: test [options] [command]

  Options:

[Killed] ConditionalExpression
lib/help.js:87:11
       // Automatically hide conflicting flags. Bit dubious but a historical behaviour that is convenient for single-command programs.
       const removeShort = helpOption.short && cmd._findOption(helpOption.short);
       const removeLong = helpOption.long && cmd._findOption(helpOption.long);
-      if (!removeShort && !removeLong) {
+      if (true) {
         visibleOptions.push(helpOption); // no changes needed
       } else if (helpOption.long && !removeLong) {
killedBy: when help short flag masked then not displayed in helpInformation
statusReason: Error: expect(received).not.toMatch(expected)

Expected pattern: not /\W-h\W.*display help/
Received string:      "Usage:  [options]

Options:
  -h, --host  select host
  -h, --help  display help for command

[Killed] LogicalOperator
lib/help.js:89:18
       const removeLong = helpOption.long && cmd._findOption(helpOption.long);
       if (!removeShort && !removeLong) {
         visibleOptions.push(helpOption); // no changes needed
-      } else if (helpOption.long && !removeLong) {
+      } else if (helpOption.long || !removeLong) {
         visibleOptions.push(
           cmd.createOption(helpOption.long, helpOption.description),
killedBy: implicit help when long flag obscured then help term is --h
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "-h"
Received: "--help"

[Killed] BooleanLiteral
lib/help.js:89:37
       const removeLong = helpOption.long && cmd._findOption(helpOption.long);
       if (!removeShort && !removeLong) {
         visibleOptions.push(helpOption); // no changes needed
-      } else if (helpOption.long && !removeLong) {
+      } else if (helpOption.long && removeLong) {
         visibleOptions.push(
           cmd.createOption(helpOption.long, helpOption.description),
killedBy: when both help flags masked then not displayed in helpInformation
statusReason: Error: expect(received).not.toMatch(expected)

Expected substring: not "display help"
Received string:        "Usage:  [options]

Options:
  -h, --help  custom
  --help      display help for command

[Killed] BlockStatement
lib/help.js:93:52
         visibleOptions.push(
           cmd.createOption(helpOption.long, helpOption.description),
         );
-      } else if (helpOption.short && !removeShort) {
-        visibleOptions.push(
-          cmd.createOption(helpOption.short, helpOption.description),
-        );
-      }
+      } else if (helpOption.short && !removeShort) {}
     }
     if (this.sortOptions) {
killedBy: implicit help when long flag obscured then help term is --h
statusReason: TypeError: Cannot read properties of undefined (reading 'flags')

[Killed] ConditionalExpression
lib/help.js:93:18
         visibleOptions.push(
           cmd.createOption(helpOption.long, helpOption.description),
         );
-      } else if (helpOption.short && !removeShort) {
+      } else if (true) {
         visibleOptions.push(
           cmd.createOption(helpOption.short, helpOption.description),
killedBy: implicit help when help flags obscured then implicit help hidden
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 23

- Array []
+ Array [
+   Option {

[Killed] ConditionalExpression
lib/help.js:99:9
         );
       }
     }
-    if (this.sortOptions) {
+    if (true) {
       visibleOptions.sort(this.compareOptions);
     }
killedBy: end-to-end: when option description is preformatted then manual format is preserved
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 2

  Usage:  [options]

  Options:

[Killed] ConditionalExpression
lib/help.js:99:9
         );
       }
     }
-    if (this.sortOptions) {
+    if (false) {
       visibleOptions.sort(this.compareOptions);
     }
killedBy: .optionsGroup when set sortOptions then options are sorted within groups
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Latin:\n *--duo\n *--unus/
Received string:  "Usage:  [options]·
Latin:
  --unus
  --duo·
Greek:

[Killed] MethodExpression
lib/help.js:100:7
       }
     }
     if (this.sortOptions) {
-      visibleOptions.sort(this.compareOptions);
+      visibleOptions;
     }
     return visibleOptions;
killedBy: sortOptions when sortOptions:true then options sorted alphabetically
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
+   "zzz",
    "aaa",

[Killed] ConditionalExpression
lib/help.js:113:9
    */
 
   visibleGlobalOptions(cmd) {
-    if (!this.showGlobalOptions) return [];
+    if (true) return [];
 
     const globalOptions = [];
killedBy: padWidth when global option term longest return global option length
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 36
Received: 10

[Killed] BooleanLiteral
lib/help.js:113:9
    */
 
   visibleGlobalOptions(cmd) {
-    if (!this.showGlobalOptions) return [];
+    if (this.showGlobalOptions) return [];
 
     const globalOptions = [];
killedBy: when showGlobalOptions:true then return program options
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "global",
- ]

[Killed] ConditionalExpression
lib/help.js:118:7
     const globalOptions = [];
     for (
       let ancestorCmd = cmd.parent;
-      ancestorCmd;
+      false;
       ancestorCmd = ancestorCmd.parent
     ) {
killedBy: when showGlobalOptions:true then program options shown
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "global"
Received string:    "Usage:  sub [options]·
Options:
  -h, --help  display help for command
"

[Killed] BlockStatement
lib/help.js:120:7
       let ancestorCmd = cmd.parent;
       ancestorCmd;
       ancestorCmd = ancestorCmd.parent
-    ) {
-      const visibleOptions = ancestorCmd.options.filter(
-        (option) => !option.hidden,
-      );
-      globalOptions.push(...visibleOptions);
-    }
+    ) {}
     if (this.sortOptions) {
       globalOptions.sort(this.compareOptions);
killedBy: when showGlobalOptions:true then program options shown
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "global"
Received string:    "Usage:  sub [options]·
Options:
  -h, --help  display help for command
"

[Survived] MethodExpression
lib/help.js:121:30
       ancestorCmd;
       ancestorCmd = ancestorCmd.parent
     ) {
-      const visibleOptions = ancestorCmd.options.filter(
-        (option) => !option.hidden,
-      );
+      const visibleOptions = ancestorCmd.options;
       globalOptions.push(...visibleOptions);
     }

[Killed] ArrowFunction
lib/help.js:122:9
       ancestorCmd = ancestorCmd.parent
     ) {
       const visibleOptions = ancestorCmd.options.filter(
-        (option) => !option.hidden,
+        () => undefined,
       );
       globalOptions.push(...visibleOptions);
killedBy: when showGlobalOptions:true then return program options
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "global",
- ]

[Killed] BooleanLiteral
lib/help.js:122:21
       ancestorCmd = ancestorCmd.parent
     ) {
       const visibleOptions = ancestorCmd.options.filter(
-        (option) => !option.hidden,
+        (option) => option.hidden,
       );
       globalOptions.push(...visibleOptions);
killedBy: when showGlobalOptions:true then return program options
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "global",
- ]

[Killed] BlockStatement
lib/help.js:126:27
       );
       globalOptions.push(...visibleOptions);
     }
-    if (this.sortOptions) {
-      globalOptions.sort(this.compareOptions);
-    }
+    if (this.sortOptions) {}
     return globalOptions;
   }
killedBy: when showGlobalOptions:true and sortOptions: true then global options sorted
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Global Options:
  -1
  -2
  -3
  -4
  -5

[Killed] MethodExpression
lib/help.js:127:7
       globalOptions.push(...visibleOptions);
     }
     if (this.sortOptions) {
-      globalOptions.sort(this.compareOptions);
+      globalOptions;
     }
     return globalOptions;
killedBy: when showGlobalOptions:true and sortOptions: true then global options sorted
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Global Options:
  -1
  -2
  -3
  -4
  -5

[Killed] ConditionalExpression
lib/help.js:141:9
 
   visibleArguments(cmd) {
     // Side effect! Apply the legacy descriptions before the arguments are displayed.
-    if (cmd._argsDescription) {
+    if (true) {
       cmd.registeredArguments.forEach((argument) => {
         argument.description =
killedBy: when argument then included in helpInformation
statusReason: TypeError: Cannot read properties of undefined (reading 'file')

[Killed] ConditionalExpression
lib/help.js:141:9
 
   visibleArguments(cmd) {
     // Side effect! Apply the legacy descriptions before the arguments are displayed.
-    if (cmd._argsDescription) {
+    if (false) {
       cmd.registeredArguments.forEach((argument) => {
         argument.description =
killedBy: when arguments described in deprecated way then included in helpInformation
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Arguments:\n +file +input source/
Received string:  "Usage:  <file>·
description
"

[Killed] BlockStatement
lib/help.js:142:53
   visibleArguments(cmd) {
     // Side effect! Apply the legacy descriptions before the arguments are displayed.
     if (cmd._argsDescription) {
-      cmd.registeredArguments.forEach((argument) => {
-        argument.description =
-          argument.description || cmd._argsDescription[argument.name()] || '';
-      });
+      cmd.registeredArguments.forEach((argument) => {});
     }
 
killedBy: visibleArguments when argument and legacy argument description then returned
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] LogicalOperator
lib/help.js:144:11
     if (cmd._argsDescription) {
       cmd.registeredArguments.forEach((argument) => {
         argument.description =
-          argument.description || cmd._argsDescription[argument.name()] || '';
+          (argument.description || cmd._argsDescription[argument.name()]) && '';
       });
     }
killedBy: visibleArguments when argument and legacy argument description then returned
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
lib/help.js:144:11
     if (cmd._argsDescription) {
       cmd.registeredArguments.forEach((argument) => {
         argument.description =
-          argument.description || cmd._argsDescription[argument.name()] || '';
+          true;
       });
     }
killedBy: visibleArguments when argument and legacy argument description then returned
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Argument {
    "_name": "file",
    "argChoices": undefined,

[Killed] BlockStatement
lib/help.js:149:75
     }
 
     // If there are any arguments with a description then return all the arguments.
-    if (cmd.registeredArguments.find((argument) => argument.description)) {
-      return cmd.registeredArguments;
-    }
+    if (cmd.registeredArguments.find((argument) => argument.description)) {}
     return [];
   }
killedBy: when argument described then included in helpInformation
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Arguments:\n +file +input source/
Received string:  "Usage:  <file>
"

[Killed] ConditionalExpression
lib/help.js:149:9
     }
 
     // If there are any arguments with a description then return all the arguments.
-    if (cmd.registeredArguments.find((argument) => argument.description)) {
+    if (false) {
       return cmd.registeredArguments;
     }
killedBy: padWidth when argument term longest return argument length
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 29
Received: 14

[Killed] ArrowFunction
lib/help.js:165:12
   subcommandTerm(cmd) {
     // Legacy. Ignores custom usage string, and nested commands.
     const args = cmd.registeredArguments
-      .map((arg) => humanReadableArgName(arg))
+      .map(() => undefined)
       .join(' ');
     return (
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 3

  Usage: test [options] [command]

  Options:

[Killed] ArithmeticOperator
lib/help.js:168:7
       .map((arg) => humanReadableArgName(arg))
       .join(' ');
     return (
-      cmd._name +
-      (cmd._aliases[0] ? '|' + cmd._aliases[0] : '') +
+      cmd._name - (cmd._aliases[0] ? '|' + cmd._aliases[0] : '') +
       (cmd.options.length ? ' [options]' : '') + // simplistic check for non-help option
       (args ? ' ' + args : '')
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 3

  Usage: test [options] [command]

  Options:
