[Killed] ArithmeticOperator
lib/help.js:168:7
       .map((arg) => humanReadableArgName(arg))
       .join(' ');
     return (
-      cmd._name +
-      (cmd._aliases[0] ? '|' + cmd._aliases[0] : '') +
-      (cmd.options.length ? ' [options]' : '') + // simplistic check for non-help option
+      cmd._name + (cmd._aliases[0] ? '|' + cmd._aliases[0] : '') - (cmd.options.length ? ' [options]' : '') + // simplistic check for non-help option
       (args ? ' ' + args : '')
     );
killedBy: padWidth when command term longest return command length
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 34
Received: 13

[Killed] StringLiteral
lib/help.js:169:50
       .join(' ');
     return (
       cmd._name +
-      (cmd._aliases[0] ? '|' + cmd._aliases[0] : '') +
+      (cmd._aliases[0] ? '|' + cmd._aliases[0] : "Stryker was here!") +
       (cmd.options.length ? ' [options]' : '') + // simplistic check for non-help option
       (args ? ' ' + args : '')
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 3

  Usage: test [options] [command]

  Options:

[Killed] StringLiteral
lib/help.js:169:26
       .join(' ');
     return (
       cmd._name +
-      (cmd._aliases[0] ? '|' + cmd._aliases[0] : '') +
+      (cmd._aliases[0] ? "" + cmd._aliases[0] : '') +
       (cmd.options.length ? ' [options]' : '') + // simplistic check for non-help option
       (args ? ' ' + args : '')
killedBy: subcommandTerm when command has alias then returns name|alias
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "program|alias"
Received: "programalias"

[Killed] StringLiteral
lib/help.js:171:15
       cmd._name +
       (cmd._aliases[0] ? '|' + cmd._aliases[0] : '') +
       (cmd.options.length ? ' [options]' : '') + // simplistic check for non-help option
-      (args ? ' ' + args : '')
+      (args ? "" + args : '')
     );
   }
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 3

  Usage: test [options] [command]

  Options:

[Killed] StringLiteral
lib/help.js:171:28
       cmd._name +
       (cmd._aliases[0] ? '|' + cmd._aliases[0] : '') +
       (cmd.options.length ? ' [options]' : '') + // simplistic check for non-help option
-      (args ? ' ' + args : '')
+      (args ? ' ' + args : "Stryker was here!")
     );
   }
killedBy: when use .description for command then help includes description
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /simple-command +custom-description/
Received string:  "Usage:  [options] [command]·
Options:
  -h, --help                       display help for command·
Commands:
  simple-commandStryker was here!  custom-description

[Killed] BlockStatement
lib/help.js:205:44
    * @returns {number}
    */
 
-  longestSubcommandTermLength(cmd, helper) {
-    return helper.visibleCommands(cmd).reduce((max, command) => {
-      return Math.max(
-        max,
-        this.displayWidth(
-          helper.styleSubcommandTerm(helper.subcommandTerm(command)),
-        ),
-      );
-    }, 0);
-  }
+  longestSubcommandTermLength(cmd, helper) {}
 
   /**
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 8

  Usage: test [options] [command]

  Options:

[Killed] BlockStatement
lib/help.js:206:65
    */
 
   longestSubcommandTermLength(cmd, helper) {
-    return helper.visibleCommands(cmd).reduce((max, command) => {
-      return Math.max(
-        max,
-        this.displayWidth(
-          helper.styleSubcommandTerm(helper.subcommandTerm(command)),
-        ),
-      );
-    }, 0);
+    return helper.visibleCommands(cmd).reduce((max, command) => {}, 0);
   }
 
killedBy: override style methods and check help information styleOptionDescription
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 4

@@ -5,14 +5,16 @@
  Arguments:
    file  arg

[Killed] MethodExpression
lib/help.js:207:14
 
   longestSubcommandTermLength(cmd, helper) {
     return helper.visibleCommands(cmd).reduce((max, command) => {
-      return Math.max(
-        max,
-        this.displayWidth(
-          helper.styleSubcommandTerm(helper.subcommandTerm(command)),
-        ),
-      );
+      return Math.min(max, this.displayWidth(helper.styleSubcommandTerm(helper.subcommandTerm(command))));
     }, 0);
   }
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 2

  Usage: test [options] [command]

  Options:

[Killed] BlockStatement
lib/help.js:224:40
    * @returns {number}
    */
 
-  longestOptionTermLength(cmd, helper) {
-    return helper.visibleOptions(cmd).reduce((max, option) => {
-      return Math.max(
-        max,
-        this.displayWidth(helper.styleOptionTerm(helper.optionTerm(option))),
-      );
-    }, 0);
-  }
+  longestOptionTermLength(cmd, helper) {}
 
   /**
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 8

  Usage: test [options] [command]

  Options:

[Killed] BlockStatement
lib/help.js:225:63
    */
 
   longestOptionTermLength(cmd, helper) {
-    return helper.visibleOptions(cmd).reduce((max, option) => {
-      return Math.max(
-        max,
-        this.displayWidth(helper.styleOptionTerm(helper.optionTerm(option))),
-      );
-    }, 0);
+    return helper.visibleOptions(cmd).reduce((max, option) => {}, 0);
   }
 
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 8

  Usage: test [options] [command]

  Options:

[Killed] MethodExpression
lib/help.js:226:14
 
   longestOptionTermLength(cmd, helper) {
     return helper.visibleOptions(cmd).reduce((max, option) => {
-      return Math.max(
-        max,
-        this.displayWidth(helper.styleOptionTerm(helper.optionTerm(option))),
-      );
+      return Math.min(max, this.displayWidth(helper.styleOptionTerm(helper.optionTerm(option))));
     }, 0);
   }
killedBy: padWidth when option term longest return option length
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 36
Received: 14

[Killed] BlockStatement
lib/help.js:241:46
    * @returns {number}
    */
 
-  longestGlobalOptionTermLength(cmd, helper) {
-    return helper.visibleGlobalOptions(cmd).reduce((max, option) => {
-      return Math.max(
-        max,
-        this.displayWidth(helper.styleOptionTerm(helper.optionTerm(option))),
-      );
-    }, 0);
-  }
+  longestGlobalOptionTermLength(cmd, helper) {}
 
   /**
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 8

  Usage: test [options] [command]

  Options:

[Killed] BlockStatement
lib/help.js:242:69
    */
 
   longestGlobalOptionTermLength(cmd, helper) {
-    return helper.visibleGlobalOptions(cmd).reduce((max, option) => {
-      return Math.max(
-        max,
-        this.displayWidth(helper.styleOptionTerm(helper.optionTerm(option))),
-      );
-    }, 0);
+    return helper.visibleGlobalOptions(cmd).reduce((max, option) => {}, 0);
   }
 
killedBy: padWidth when global option term longest return global option length
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 36
Received: NaN

[Killed] MethodExpression
lib/help.js:243:14
 
   longestGlobalOptionTermLength(cmd, helper) {
     return helper.visibleGlobalOptions(cmd).reduce((max, option) => {
-      return Math.max(
-        max,
-        this.displayWidth(helper.styleOptionTerm(helper.optionTerm(option))),
-      );
+      return Math.min(max, this.displayWidth(helper.styleOptionTerm(helper.optionTerm(option))));
     }, 0);
   }
killedBy: padWidth when global option term longest return global option length
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 36
Received: 10

[Killed] BlockStatement
lib/help.js:258:42
    * @returns {number}
    */
 
-  longestArgumentTermLength(cmd, helper) {
-    return helper.visibleArguments(cmd).reduce((max, argument) => {
-      return Math.max(
-        max,
-        this.displayWidth(
-          helper.styleArgumentTerm(helper.argumentTerm(argument)),
-        ),
-      );
-    }, 0);
-  }
+  longestArgumentTermLength(cmd, helper) {}
 
   /**
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 8

  Usage: test [options] [command]

  Options:

[Killed] BlockStatement
lib/help.js:259:67
    */
 
   longestArgumentTermLength(cmd, helper) {
-    return helper.visibleArguments(cmd).reduce((max, argument) => {
-      return Math.max(
-        max,
-        this.displayWidth(
-          helper.styleArgumentTerm(helper.argumentTerm(argument)),
-        ),
-      );
-    }, 0);
+    return helper.visibleArguments(cmd).reduce((max, argument) => {}, 0);
   }
 
killedBy: override style methods and check help information styleOptionDescription
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 4

@@ -5,14 +5,16 @@
  Arguments:
    file  arg

[Killed] MethodExpression
lib/help.js:260:14
 
   longestArgumentTermLength(cmd, helper) {
     return helper.visibleArguments(cmd).reduce((max, argument) => {
-      return Math.max(
-        max,
-        this.displayWidth(
-          helper.styleArgumentTerm(helper.argumentTerm(argument)),
-        ),
-      );
+      return Math.min(max, this.displayWidth(helper.styleArgumentTerm(helper.argumentTerm(argument))));
     }, 0);
   }
killedBy: padWidth when argument term longest return argument length
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 29
Received: 14

[Killed] BlockStatement
lib/help.js:279:26
   commandUsage(cmd) {
     // Usage
     let cmdName = cmd._name;
-    if (cmd._aliases[0]) {
-      cmdName = cmdName + '|' + cmd._aliases[0];
-    }
+    if (cmd._aliases[0]) {}
     let ancestorCmdNames = '';
     for (
killedBy: commandUsage when program has alias then usage includes alias
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "program|alias [options]"
Received: "program [options]"

[Killed] ConditionalExpression
lib/help.js:279:9
   commandUsage(cmd) {
     // Usage
     let cmdName = cmd._name;
-    if (cmd._aliases[0]) {
+    if (false) {
       cmdName = cmdName + '|' + cmd._aliases[0];
     }
killedBy: commandUsage when program has alias then usage includes alias
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "program|alias [options]"
Received: "program [options]"

[Killed] BlockStatement
lib/help.js:287:7
       let ancestorCmd = cmd.parent;
       ancestorCmd;
       ancestorCmd = ancestorCmd.parent
-    ) {
-      ancestorCmdNames = ancestorCmd.name() + ' ' + ancestorCmdNames;
-    }
+    ) {}
     return ancestorCmdNames + cmdName + ' ' + cmd.usage();
   }
killedBy: when default usage and check subcommand help then starts with default usage including program name
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /^Usage: test info \[options\]/
Received string:  "Usage: info [options]·
Options:
  -h, --help  display help for command
"

[Killed] ArithmeticOperator
lib/help.js:290:12
     ) {
       ancestorCmdNames = ancestorCmd.name() + ' ' + ancestorCmdNames;
     }
-    return ancestorCmdNames + cmdName + ' ' + cmd.usage();
+    return ancestorCmdNames - cmdName + ' ' + cmd.usage();
   }
 
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

@@ -1,6 +1,6 @@
- Usage: test [options] [command]
+ Usage: NaN [options] [command]

[Killed] BlockStatement
lib/help.js:313:30
    * @returns {string}
    */
 
-  subcommandDescription(cmd) {
-    // @ts-ignore: because overloaded return type
-    return cmd.summary() || cmd.description();
-  }
+  subcommandDescription(cmd) {}
 
   /**
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

@@ -3,7 +3,7 @@
  Options:
    -h, --help         display help for command

[Killed] LogicalOperator
lib/help.js:315:12
 
   subcommandDescription(cmd) {
     // @ts-ignore: because overloaded return type
-    return cmd.summary() || cmd.description();
+    return cmd.summary() && cmd.description();
   }
 
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

@@ -3,7 +3,7 @@
  Options:
    -h, --help         display help for command

[Killed] ConditionalExpression
lib/help.js:315:12
 
   subcommandDescription(cmd) {
     // @ts-ignore: because overloaded return type
-    return cmd.summary() || cmd.description();
+    return false;
   }
 
killedBy: override style methods and check help information styleSubcommandDescription
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -7,8 +7,8 @@

  Options:

[Killed] ArrayDeclaration
lib/help.js:326:23
    */
 
   optionDescription(option) {
-    const extraInfo = [];
+    const extraInfo = ["Stryker was here"];
 
     if (option.argChoices) {
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  Usage: test [options] [command]

  Options:

[Killed] ConditionalExpression
lib/help.js:328:9
   optionDescription(option) {
     const extraInfo = [];
 
-    if (option.argChoices) {
+    if (false) {
       extraInfo.push(
         // use stringify to match the display of the default value
killedBy: when option has choices then choices included in helpInformation
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "(choices: \"red\", \"blue\")"
Received string:    "Usage:  [options]·
Options:
  -c, --colour <colour>
  -h, --help             display help for command
"

[Killed] BlockStatement
lib/help.js:328:28
   optionDescription(option) {
     const extraInfo = [];
 
-    if (option.argChoices) {
-      extraInfo.push(
-        // use stringify to match the display of the default value
-        `choices: ${option.argChoices.map((choice) => JSON.stringify(choice)).join(', ')}`,
-      );
-    }
+    if (option.argChoices) {}
     if (option.defaultValue !== undefined) {
       // default for boolean and negated more for programmer than end user,
killedBy: when option has choices then choices included in helpInformation
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "(choices: \"red\", \"blue\")"
Received string:    "Usage:  [options]·
Options:
  -c, --colour <colour>
  -h, --help             display help for command
"

[Killed] ArrowFunction
lib/help.js:331:43
     if (option.argChoices) {
       extraInfo.push(
         // use stringify to match the display of the default value
-        `choices: ${option.argChoices.map((choice) => JSON.stringify(choice)).join(', ')}`,
+        `choices: ${option.argChoices.map(() => undefined).join(', ')}`,
       );
     }
killedBy: when option has choices then choices included in helpInformation
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "(choices: \"red\", \"blue\")"
Received string:    "Usage:  [options]·
Options:
  -c, --colour <colour>  (choices: , )
  -h, --help             display help for command
"

[Killed] EqualityOperator
lib/help.js:334:9
         `choices: ${option.argChoices.map((choice) => JSON.stringify(choice)).join(', ')}`,
       );
     }
-    if (option.defaultValue !== undefined) {
+    if (option.defaultValue === undefined) {
       // default for boolean and negated more for programmer than end user,
       // but show true/false for boolean option as may be for hand-rolled env or config processing.
killedBy: when option has default value then default included in helpInformation
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "(default: 80)"
Received string:    "Usage:  [options]·
Options:
  -p, --port <portNumber>  port number
  -h, --help               display help for command
"

[Killed] ConditionalExpression
lib/help.js:334:9
         `choices: ${option.argChoices.map((choice) => JSON.stringify(choice)).join(', ')}`,
       );
     }
-    if (option.defaultValue !== undefined) {
+    if (false) {
       // default for boolean and negated more for programmer than end user,
       // but show true/false for boolean option as may be for hand-rolled env or config processing.
killedBy: when option has default value then default included in helpInformation
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "(default: 80)"
Received string:    "Usage:  [options]·
Options:
  -p, --port <portNumber>  port number
  -h, --help               display help for command
"

[Killed] ConditionalExpression
lib/help.js:338:9
       // default for boolean and negated more for programmer than end user,
       // but show true/false for boolean option as may be for hand-rolled env or config processing.
       const showDefault =
-        option.required ||
-        option.optional ||
-        (option.isBoolean() && typeof option.defaultValue === 'boolean');
+        false;
       if (showDefault) {
         extraInfo.push(
killedBy: when option has default value then default included in helpInformation
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "(default: 80)"
Received string:    "Usage:  [options]·
Options:
  -p, --port <portNumber>  port number
  -h, --help               display help for command
"

[Killed] ConditionalExpression
lib/help.js:338:9
       // default for boolean and negated more for programmer than end user,
       // but show true/false for boolean option as may be for hand-rolled env or config processing.
       const showDefault =
-        option.required ||
-        option.optional ||
+        false ||
         (option.isBoolean() && typeof option.defaultValue === 'boolean');
       if (showDefault) {
killedBy: when option has default value then default included in helpInformation
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "(default: 80)"
Received string:    "Usage:  [options]·
Options:
  -p, --port <portNumber>  port number
  -h, --help               display help for command
"

[Killed] EqualityOperator
lib/help.js:340:32
       const showDefault =
         option.required ||
         option.optional ||
-        (option.isBoolean() && typeof option.defaultValue === 'boolean');
+        (option.isBoolean() && typeof option.defaultValue !== 'boolean');
       if (showDefault) {
         extraInfo.push(
killedBy: optionDescription when boolean option has default value true then return description and default value
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "description (default: true)"
Received: "description"

[Killed] ConditionalExpression
lib/help.js:340:10
       const showDefault =
         option.required ||
         option.optional ||
-        (option.isBoolean() && typeof option.defaultValue === 'boolean');
+        (false);
       if (showDefault) {
         extraInfo.push(
killedBy: optionDescription when boolean option has default value true then return description and default value
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "description (default: true)"
Received: "description"

[Killed] ConditionalExpression
lib/help.js:341:11
         option.required ||
         option.optional ||
         (option.isBoolean() && typeof option.defaultValue === 'boolean');
-      if (showDefault) {
+      if (true) {
         extraInfo.push(
           `default: ${option.defaultValueDescription || JSON.stringify(option.defaultValue)}`,
killedBy: optionDescription when boolean option has default value string then return description without default
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "description"
Received: "description (default: \"foo\")"

[Killed] ConditionalExpression
lib/help.js:341:11
         option.required ||
         option.optional ||
         (option.isBoolean() && typeof option.defaultValue === 'boolean');
-      if (showDefault) {
+      if (false) {
         extraInfo.push(
           `default: ${option.defaultValueDescription || JSON.stringify(option.defaultValue)}`,
killedBy: when option has default value then default included in helpInformation
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "(default: 80)"
Received string:    "Usage:  [options]·
Options:
  -p, --port <portNumber>  port number
  -h, --help               display help for command
"

[Killed] LogicalOperator
lib/help.js:343:23
         (option.isBoolean() && typeof option.defaultValue === 'boolean');
       if (showDefault) {
         extraInfo.push(
-          `default: ${option.defaultValueDescription || JSON.stringify(option.defaultValue)}`,
+          `default: ${option.defaultValueDescription && JSON.stringify(option.defaultValue)}`,
         );
       }
killedBy: optionDescription when boolean option has default value true then return description and default value
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "description (default: true)"
Received: "description (default: undefined)"

[Killed] ConditionalExpression
lib/help.js:343:23
         (option.isBoolean() && typeof option.defaultValue === 'boolean');
       if (showDefault) {
         extraInfo.push(
-          `default: ${option.defaultValueDescription || JSON.stringify(option.defaultValue)}`,
+          `default: ${false}`,
         );
       }
killedBy: when option has default value then default included in helpInformation
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "(default: 80)"
Received string:    "Usage:  [options]·
Options:
  -p, --port <portNumber>  port number (default: false)
  -h, --help               display help for command
"

[Killed] LogicalOperator
lib/help.js:348:9
       }
     }
     // preset for boolean and negated are more for programmer than end user
-    if (option.presetArg !== undefined && option.optional) {
+    if (option.presetArg !== undefined || option.optional) {
       extraInfo.push(`preset: ${JSON.stringify(option.presetArg)}`);
     }
killedBy: optionDescription when boolean option has preset value then return description without default
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "description"
Received: "description (preset: \"abc\")"

[Killed] EqualityOperator
lib/help.js:348:9
       }
     }
     // preset for boolean and negated are more for programmer than end user
-    if (option.presetArg !== undefined && option.optional) {
+    if (option.presetArg === undefined && option.optional) {
       extraInfo.push(`preset: ${JSON.stringify(option.presetArg)}`);
     }
killedBy: optionDescription when optional option has preset value then return description and default value
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "description (preset: \"abc\")"
Received: "description"

[Killed] EqualityOperator
lib/help.js:351:9
     if (option.presetArg !== undefined && option.optional) {
       extraInfo.push(`preset: ${JSON.stringify(option.presetArg)}`);
     }
-    if (option.envVar !== undefined) {
+    if (option.envVar === undefined) {
       extraInfo.push(`env: ${option.envVar}`);
     }
killedBy: optionDescription when option has no description then empty string
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ""
Received: "(env: undefined)"

[Killed] BlockStatement
lib/help.js:351:38
     if (option.presetArg !== undefined && option.optional) {
       extraInfo.push(`preset: ${JSON.stringify(option.presetArg)}`);
     }
-    if (option.envVar !== undefined) {
-      extraInfo.push(`env: ${option.envVar}`);
-    }
+    if (option.envVar !== undefined) {}
     if (extraInfo.length > 0) {
       const extraDescription = `(${extraInfo.join(', ')})`;
killedBy: optionDescription when option has env then return description and env name
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "description (env: ENV)"
Received: "description"

[Killed] ConditionalExpression
lib/help.js:354:9
     if (option.envVar !== undefined) {
       extraInfo.push(`env: ${option.envVar}`);
     }
-    if (extraInfo.length > 0) {
+    if (true) {
       const extraDescription = `(${extraInfo.join(', ')})`;
       if (option.description) {
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  Usage: test [options] [command]

  Options:

[Killed] EqualityOperator
lib/help.js:354:9
     if (option.envVar !== undefined) {
       extraInfo.push(`env: ${option.envVar}`);
     }
-    if (extraInfo.length > 0) {
+    if (extraInfo.length <= 0) {
       const extraDescription = `(${extraInfo.join(', ')})`;
       if (option.description) {
killedBy: optionDescription when option has no description then empty string
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ""
Received: "()"

[Killed] StringLiteral
lib/help.js:355:51
       extraInfo.push(`env: ${option.envVar}`);
     }
     if (extraInfo.length > 0) {
-      const extraDescription = `(${extraInfo.join(', ')})`;
+      const extraDescription = `(${extraInfo.join("")})`;
       if (option.description) {
         return `${option.description} ${extraDescription}`;
killedBy: when option has choices and default then both included in helpInformation
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "(choices: \"red\", \"blue\", default: \"red\")"
Received string:    "Usage:  [options]·
Options:
  -c, --colour <colour>  (choices: \"red\", \"blue\"default: \"red\")
  -h, --help             display help for command
"

[Killed] ConditionalExpression
lib/help.js:356:11
     }
     if (extraInfo.length > 0) {
       const extraDescription = `(${extraInfo.join(', ')})`;
-      if (option.description) {
+      if (true) {
         return `${option.description} ${extraDescription}`;
       }
killedBy: optionDescription when option has default value but not description then return custom default
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "(default: custom)"
Received: " (default: custom)"

[Killed] BlockStatement
lib/help.js:356:31
     }
     if (extraInfo.length > 0) {
       const extraDescription = `(${extraInfo.join(', ')})`;
-      if (option.description) {
-        return `${option.description} ${extraDescription}`;
-      }
+      if (option.description) {}
       return extraDescription;
     }
killedBy: optionDescription when boolean option has default value true then return description and default value
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "description (default: true)"
Received: "(default: true)"

[Killed] StringLiteral
lib/help.js:357:16
     if (extraInfo.length > 0) {
       const extraDescription = `(${extraInfo.join(', ')})`;
       if (option.description) {
-        return `${option.description} ${extraDescription}`;
+        return ``;
       }
       return extraDescription;
killedBy: when option has default value then default included in helpInformation
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "(default: 80)"
Received string:    "Usage:  [options]·
Options:
  -p, --port <portNumber>
  -h, --help               display help for command
"
