[Killed] BlockStatement
lib/help.js:372:33
    * @return {string}
    */
 
-  argumentDescription(argument) {
-    const extraInfo = [];
-    if (argument.argChoices) {
-      extraInfo.push(
-        // use stringify to match the display of the default value
-        `choices: ${argument.argChoices.map((choice) => JSON.stringify(choice)).join(', ')}`,
-      );
-    }
-    if (argument.defaultValue !== undefined) {
-      extraInfo.push(
-        `default: ${argument.defaultValueDescription || JSON.stringify(argument.defaultValue)}`,
-      );
-    }
-    if (extraInfo.length > 0) {
-      const extraDescription = `(${extraInfo.join(', ')})`;
-      if (argument.description) {
-        return `${argument.description} ${extraDescription}`;
-      }
-      return extraDescription;
-    }
-    return argument.description;
-  }
+  argumentDescription(argument) {}
 
   /**
killedBy: when argument described then included in helpInformation
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Arguments:\n +file +input source/
Received string:  "Usage:  <file>·
Arguments:
  file
"

[Killed] BlockStatement
lib/help.js:374:30
 
   argumentDescription(argument) {
     const extraInfo = [];
-    if (argument.argChoices) {
-      extraInfo.push(
-        // use stringify to match the display of the default value
-        `choices: ${argument.argChoices.map((choice) => JSON.stringify(choice)).join(', ')}`,
-      );
-    }
+    if (argument.argChoices) {}
     if (argument.defaultValue !== undefined) {
       extraInfo.push(
killedBy: when argument has choices then choices included in helpInformation
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "(choices: \"red\", \"blue\")"
Received string:    "Usage:  [options] <colour>·
Arguments:
  colour      preferred colour·
Options:
  -h, --help  display help for command

[Killed] ConditionalExpression
lib/help.js:374:9
 
   argumentDescription(argument) {
     const extraInfo = [];
-    if (argument.argChoices) {
+    if (false) {
       extraInfo.push(
         // use stringify to match the display of the default value
killedBy: when argument has choices then choices included in helpInformation
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "(choices: \"red\", \"blue\")"
Received string:    "Usage:  [options] <colour>·
Arguments:
  colour      preferred colour·
Options:
  -h, --help  display help for command

[Killed] ArrowFunction
lib/help.js:377:45
     if (argument.argChoices) {
       extraInfo.push(
         // use stringify to match the display of the default value
-        `choices: ${argument.argChoices.map((choice) => JSON.stringify(choice)).join(', ')}`,
+        `choices: ${argument.argChoices.map(() => undefined).join(', ')}`,
       );
     }
killedBy: when argument has choices then choices included in helpInformation
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "(choices: \"red\", \"blue\")"
Received string:    "Usage:  [options] <colour>·
Arguments:
  colour      preferred colour (choices: , )·
Options:
  -h, --help  display help for command

[Killed] ConditionalExpression
lib/help.js:380:9
         `choices: ${argument.argChoices.map((choice) => JSON.stringify(choice)).join(', ')}`,
       );
     }
-    if (argument.defaultValue !== undefined) {
+    if (false) {
       extraInfo.push(
         `default: ${argument.defaultValueDescription || JSON.stringify(argument.defaultValue)}`,
killedBy: when argument described with default then included in helpInformation
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Arguments:\n +file +input source \(default: "test.txt"\)/
Received string:  "Usage:  [file]·
Arguments:
  file  input source
"

[Killed] EqualityOperator
lib/help.js:380:9
         `choices: ${argument.argChoices.map((choice) => JSON.stringify(choice)).join(', ')}`,
       );
     }
-    if (argument.defaultValue !== undefined) {
+    if (argument.defaultValue === undefined) {
       extraInfo.push(
         `default: ${argument.defaultValueDescription || JSON.stringify(argument.defaultValue)}`,
killedBy: when argument described with default then included in helpInformation
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Arguments:\n +file +input source \(default: "test.txt"\)/
Received string:  "Usage:  [file]·
Arguments:
  file  input source
"

[Killed] ConditionalExpression
lib/help.js:382:21
     }
     if (argument.defaultValue !== undefined) {
       extraInfo.push(
-        `default: ${argument.defaultValueDescription || JSON.stringify(argument.defaultValue)}`,
+        `default: ${false}`,
       );
     }
killedBy: when argument described with default then included in helpInformation
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Arguments:\n +file +input source \(default: "test.txt"\)/
Received string:  "Usage:  [file]·
Arguments:
  file  input source (default: false)
"

[Killed] ConditionalExpression
lib/help.js:382:21
     }
     if (argument.defaultValue !== undefined) {
       extraInfo.push(
-        `default: ${argument.defaultValueDescription || JSON.stringify(argument.defaultValue)}`,
+        `default: ${true}`,
       );
     }
killedBy: when argument described with default then included in helpInformation
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Arguments:\n +file +input source \(default: "test.txt"\)/
Received string:  "Usage:  [file]·
Arguments:
  file  input source (default: true)
"

[Killed] BlockStatement
lib/help.js:385:31
         `default: ${argument.defaultValueDescription || JSON.stringify(argument.defaultValue)}`,
       );
     }
-    if (extraInfo.length > 0) {
-      const extraDescription = `(${extraInfo.join(', ')})`;
-      if (argument.description) {
-        return `${argument.description} ${extraDescription}`;
-      }
-      return extraDescription;
-    }
+    if (extraInfo.length > 0) {}
     return argument.description;
   }
killedBy: when argument described with default then included in helpInformation
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Arguments:\n +file +input source \(default: "test.txt"\)/
Received string:  "Usage:  [file]·
Arguments:
  file  input source
"

[Killed] ConditionalExpression
lib/help.js:387:11
     }
     if (extraInfo.length > 0) {
       const extraDescription = `(${extraInfo.join(', ')})`;
-      if (argument.description) {
+      if (false) {
         return `${argument.description} ${extraDescription}`;
       }
killedBy: when argument described with default then included in helpInformation
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Arguments:\n +file +input source \(default: "test.txt"\)/
Received string:  "Usage:  [file]·
Arguments:
  file  (default: \"test.txt\")
"

[Killed] ConditionalExpression
lib/help.js:387:11
     }
     if (extraInfo.length > 0) {
       const extraDescription = `(${extraInfo.join(', ')})`;
-      if (argument.description) {
+      if (true) {
         return `${argument.description} ${extraDescription}`;
       }
killedBy: argumentDescription when an argument has default value and no description then still return default value
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "(default: \"default\")"
Received: " (default: \"default\")"

[Killed] StringLiteral
lib/help.js:388:16
     if (extraInfo.length > 0) {
       const extraDescription = `(${extraInfo.join(', ')})`;
       if (argument.description) {
-        return `${argument.description} ${extraDescription}`;
+        return ``;
       }
       return extraDescription;
killedBy: when argument described with default then included in helpInformation
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Arguments:\n +file +input source \(default: "test.txt"\)/
Received string:  "Usage:  [file]·
Arguments:
  file
"

[Killed] BlockStatement
lib/help.js:403:42
    * @param {Help} helper
    * @returns string[]
    */
-  formatItemList(heading, items, helper) {
-    if (items.length === 0) return [];
-
-    return [helper.styleTitle(heading), ...items, ''];
-  }
+  formatItemList(heading, items, helper) {}
 
   /**
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 6
+ Received  + 2

  Usage: test [options] [command]

- Options:

[Killed] ConditionalExpression
lib/help.js:404:9
    * @returns string[]
    */
   formatItemList(heading, items, helper) {
-    if (items.length === 0) return [];
+    if (false) return [];
 
     return [helper.styleTitle(heading), ...items, ''];
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 0
+ Received  + 2

@@ -1,7 +1,9 @@
  Usage: test [options] [command]

[Killed] EqualityOperator
lib/help.js:404:9
    * @returns string[]
    */
   formatItemList(heading, items, helper) {
-    if (items.length === 0) return [];
+    if (items.length !== 0) return [];
 
     return [helper.styleTitle(heading), ...items, ''];
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 6
+ Received  + 1

  Usage: test [options] [command]

- Options:

[Killed] StringLiteral
lib/help.js:406:51
   formatItemList(heading, items, helper) {
     if (items.length === 0) return [];
 
-    return [helper.styleTitle(heading), ...items, ''];
+    return [helper.styleTitle(heading), ...items, "Stryker was here!"];
   }
 
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 2

  Usage: test [options] [command]

  Options:

[Killed] BlockStatement
lib/help.js:420:37
   groupItems(unsortedItems, visibleItems, getGroup) {
     const result = new Map();
     // Add groups in order of appearance in unsortedItems.
-    unsortedItems.forEach((item) => {
-      const group = getGroup(item);
-      if (!result.has(group)) result.set(group, []);
-    });
+    unsortedItems.forEach((item) => {});
     // Add items in order of appearance in visibleItems.
     visibleItems.forEach((item) => {
killedBy: .optionsGroup when set sortOptions then groups are in order added not sorted
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /BBB:\n *--bbb.*\n\nCCC:\n *--ccc.*\n\nAAA:\n *--aaa/
Received string:  "Usage:  [options]·
AAA:
  --aaa·
BBB:
  --bbb·

[Killed] BooleanLiteral
lib/help.js:422:11
     // Add groups in order of appearance in unsortedItems.
     unsortedItems.forEach((item) => {
       const group = getGroup(item);
-      if (!result.has(group)) result.set(group, []);
+      if (result.has(group)) result.set(group, []);
     });
     // Add items in order of appearance in visibleItems.
killedBy: .optionsGroup when set sortOptions then groups are in order added not sorted
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /BBB:\n *--bbb.*\n\nCCC:\n *--ccc.*\n\nAAA:\n *--aaa/
Received string:  "Usage:  [options]·
AAA:
  --aaa·
BBB:
  --bbb·

[Killed] ConditionalExpression
lib/help.js:422:11
     // Add groups in order of appearance in unsortedItems.
     unsortedItems.forEach((item) => {
       const group = getGroup(item);
-      if (!result.has(group)) result.set(group, []);
+      if (false) result.set(group, []);
     });
     // Add items in order of appearance in visibleItems.
killedBy: .optionsGroup when set sortOptions then groups are in order added not sorted
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /BBB:\n *--bbb.*\n\nCCC:\n *--ccc.*\n\nAAA:\n *--aaa/
Received string:  "Usage:  [options]·
AAA:
  --aaa·
BBB:
  --bbb·

[Killed] BlockStatement
lib/help.js:425:36
       if (!result.has(group)) result.set(group, []);
     });
     // Add items in order of appearance in visibleItems.
-    visibleItems.forEach((item) => {
-      const group = getGroup(item);
-      if (!result.has(group)) {
-        result.set(group, []);
-      }
-      result.get(group).push(item);
-    });
+    visibleItems.forEach((item) => {});
     return result;
   }
killedBy: Option.helpGroup when add one option with helpGroup then help contains group
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Greek:\n *--alpha/
Received string:  "Usage:  [options]
"

[Killed] ConditionalExpression
lib/help.js:427:11
     // Add items in order of appearance in visibleItems.
     visibleItems.forEach((item) => {
       const group = getGroup(item);
-      if (!result.has(group)) {
+      if (true) {
         result.set(group, []);
       }
killedBy: Option.helpGroup when add two options with helpGroup then help contains group
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Greek:\n *--alpha\n *--beta/
Received string:  "Usage:  [options]·
Greek:
  --beta·
Options:
  -h, --help  display help for command

[Killed] LogicalOperator
lib/help.js:445:23
 
   formatHelp(cmd, helper) {
     const termWidth = helper.padWidth(cmd, helper);
-    const helpWidth = helper.helpWidth ?? 80; // in case prepareContext() was not called
+    const helpWidth = helper.helpWidth && 80; // in case prepareContext() was not called
 
     function callFormatItem(term, description) {
killedBy: when no custom setup and call formatHelp direct then effective helpWidth is fallback 80
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 80
Received: undefined

[Killed] BlockStatement
lib/help.js:447:48
     const termWidth = helper.padWidth(cmd, helper);
     const helpWidth = helper.helpWidth ?? 80; // in case prepareContext() was not called
 
-    function callFormatItem(term, description) {
-      return helper.formatItem(term, termWidth, description, helper);
-    }
+    function callFormatItem(term, description) {}
 
     // Usage
killedBy: Option.helpGroup when add one option with helpGroup then help contains group
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Greek:\n *--alpha/
Received string:  "Usage:  [options]·
Greek:··
Options:·
"

[Killed] StringLiteral
lib/help.js:454:7
     // Usage
     let output = [
       `${helper.styleTitle('Usage:')} ${helper.styleUsage(helper.commandUsage(cmd))}`,
-      '',
+      "Stryker was here!",
     ];
 
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Usage: test [options] [command]
-

[Killed] BlockStatement
lib/help.js:459:40
 
     // Description
     const commandDescription = helper.commandDescription(cmd);
-    if (commandDescription.length > 0) {
-      output = output.concat([
-        helper.boxWrap(
-          helper.styleCommandDescription(commandDescription),
-          helpWidth,
-        ),
-        '',
-      ]);
-    }
+    if (commandDescription.length > 0) {}
 
     // Arguments
killedBy: when no custom setup and call formatHelp direct then effective helpWidth is fallback 80
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 80
Received: undefined

[Killed] ConditionalExpression
lib/help.js:459:9
 
     // Description
     const commandDescription = helper.commandDescription(cmd);
-    if (commandDescription.length > 0) {
+    if (false) {
       output = output.concat([
         helper.boxWrap(
killedBy: Help.minWidthToWrap when enough width then wrap
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x
x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x x
x x x x x x x x x x"
Received string:    "Usage: program [options]·
Options:
  -h, --help  display help for command

[Killed] BlockStatement
lib/help.js:470:73
     }
 
     // Arguments
-    const argumentList = helper.visibleArguments(cmd).map((argument) => {
-      return callFormatItem(
-        helper.styleArgumentTerm(helper.argumentTerm(argument)),
-        helper.styleArgumentDescription(helper.argumentDescription(argument)),
-      );
-    });
+    const argumentList = helper.visibleArguments(cmd).map((argument) => {});
     output = output.concat(
       this.formatItemList('Arguments:', argumentList, helper),
killedBy: when argument described then included in helpInformation
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Arguments:\n +file +input source/
Received string:  "Usage:  <file>·
Arguments:·
"

[Killed] LogicalOperator
lib/help.js:484:19
     const optionGroups = this.groupItems(
       cmd.options,
       helper.visibleOptions(cmd),
-      (option) => option.helpGroupHeading ?? 'Options:',
+      (option) => option.helpGroupHeading && 'Options:',
     );
     optionGroups.forEach((options, group) => {
killedBy: Option.helpGroup when add one option with helpGroup then help contains group
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Greek:\n *--alpha/
Received string:  "Usage:  [options]·
Options:
  --alpha··
  -h, --help  display help for command
"

[Killed] ArrowFunction
lib/help.js:484:7
     const optionGroups = this.groupItems(
       cmd.options,
       helper.visibleOptions(cmd),
-      (option) => option.helpGroupHeading ?? 'Options:',
+      () => undefined,
     );
     optionGroups.forEach((options, group) => {
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

@@ -1,8 +1,8 @@
  Usage: test [options] [command]

[Killed] BlockStatement
lib/help.js:486:46
       helper.visibleOptions(cmd),
       (option) => option.helpGroupHeading ?? 'Options:',
     );
-    optionGroups.forEach((options, group) => {
-      const optionList = options.map((option) => {
-        return callFormatItem(
-          helper.styleOptionTerm(helper.optionTerm(option)),
-          helper.styleOptionDescription(helper.optionDescription(option)),
-        );
-      });
-      output = output.concat(this.formatItemList(group, optionList, helper));
-    });
+    optionGroups.forEach((options, group) => {});
 
     if (helper.showGlobalOptions) {
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 0

  Usage: test [options] [command]

- Options:

[Killed] BlockStatement
lib/help.js:487:50
       (option) => option.helpGroupHeading ?? 'Options:',
     );
     optionGroups.forEach((options, group) => {
-      const optionList = options.map((option) => {
-        return callFormatItem(
-          helper.styleOptionTerm(helper.optionTerm(option)),
-          helper.styleOptionDescription(helper.optionDescription(option)),
-        );
-      });
+      const optionList = options.map((option) => {});
       output = output.concat(this.formatItemList(group, optionList, helper));
     });
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  Usage: test [options] [command]

  Options:

[Killed] BlockStatement
lib/help.js:496:35
       output = output.concat(this.formatItemList(group, optionList, helper));
     });
 
-    if (helper.showGlobalOptions) {
-      const globalOptionList = helper
-        .visibleGlobalOptions(cmd)
-        .map((option) => {
-          return callFormatItem(
-            helper.styleOptionTerm(helper.optionTerm(option)),
-            helper.styleOptionDescription(helper.optionDescription(option)),
-          );
-        });
-      output = output.concat(
-        this.formatItemList('Global Options:', globalOptionList, helper),
-      );
-    }
+    if (helper.showGlobalOptions) {}
 
     // Commands
killedBy: when showGlobalOptions:true then program options shown
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "global"
Received string:    "Usage:  sub [options]·
Options:
  -h, --help  display help for command
"

[Killed] ConditionalExpression
lib/help.js:496:9
       output = output.concat(this.formatItemList(group, optionList, helper));
     });
 
-    if (helper.showGlobalOptions) {
+    if (false) {
       const globalOptionList = helper
         .visibleGlobalOptions(cmd)
killedBy: when showGlobalOptions:true then program options shown
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "global"
Received string:    "Usage:  sub [options]·
Options:
  -h, --help  display help for command
"

[Killed] BlockStatement
lib/help.js:499:26
     if (helper.showGlobalOptions) {
       const globalOptionList = helper
         .visibleGlobalOptions(cmd)
-        .map((option) => {
-          return callFormatItem(
-            helper.styleOptionTerm(helper.optionTerm(option)),
-            helper.styleOptionDescription(helper.optionDescription(option)),
-          );
-        });
+        .map((option) => {});
       output = output.concat(
         this.formatItemList('Global Options:', globalOptionList, helper),
killedBy: when showGlobalOptions:true then program options shown
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "global"
Received string:    "Usage:  sub [options]·
Options:
  -h, --help  display help for command·
Global Options:·
"

[Killed] LogicalOperator
lib/help.js:514:16
     const commandGroups = this.groupItems(
       cmd.commands,
       helper.visibleCommands(cmd),
-      (sub) => sub.helpGroup() || 'Commands:',
+      (sub) => sub.helpGroup() && 'Commands:',
     );
     commandGroups.forEach((commands, group) => {
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  Usage: test [options] [command]

  Options:

[Killed] ArrowFunction
lib/help.js:514:7
     const commandGroups = this.groupItems(
       cmd.commands,
       helper.visibleCommands(cmd),
-      (sub) => sub.helpGroup() || 'Commands:',
+      () => undefined,
     );
     commandGroups.forEach((commands, group) => {
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  Usage: test [options] [command]

  Options:

[Killed] BlockStatement
lib/help.js:516:48
       helper.visibleCommands(cmd),
       (sub) => sub.helpGroup() || 'Commands:',
     );
-    commandGroups.forEach((commands, group) => {
-      const commandList = commands.map((sub) => {
-        return callFormatItem(
-          helper.styleSubcommandTerm(helper.subcommandTerm(sub)),
-          helper.styleSubcommandDescription(helper.subcommandDescription(sub)),
-        );
-      });
-      output = output.concat(this.formatItemList(group, commandList, helper));
-    });
+    commandGroups.forEach((commands, group) => {});
 
     return output.join('\n');
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 4
+ Received  + 0

  Usage: test [options] [command]

  Options:

[Killed] BlockStatement
lib/help.js:517:49
       (sub) => sub.helpGroup() || 'Commands:',
     );
     commandGroups.forEach((commands, group) => {
-      const commandList = commands.map((sub) => {
-        return callFormatItem(
-          helper.styleSubcommandTerm(helper.subcommandTerm(sub)),
-          helper.styleSubcommandDescription(helper.subcommandDescription(sub)),
-        );
-      });
+      const commandList = commands.map((sub) => {});
       output = output.concat(this.formatItemList(group, commandList, helper));
     });
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 2

@@ -2,8 +2,8 @@

  Options:

[Killed] BlockStatement
lib/help.js:535:21
    * @param {string} str
    * @returns {number}
    */
-  displayWidth(str) {
-    return stripColor(str).length;
-  }
+  displayWidth(str) {}
 
   /**
killedBy: override style methods and check help information styleUsage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 14
+ Received  +  5

  Usage: RED program [options] [command] <file> DER

- program

[Killed] BlockStatement
lib/help.js:545:19
    * @param {string} str
    * @returns {string}
    */
-  styleTitle(str) {
-    return str;
-  }
+  styleTitle(str) {}
 
   styleUsage(str) {
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 3

- Usage: test [options] [command]
+ undefined test [options] [command]

[Killed] BlockStatement
lib/help.js:549:19
     return str;
   }
 
-  styleUsage(str) {
-    // Usage has lots of parts the user might like to color separately! Assume default usage string which is formed like:
-    //    command subcommand [options] [command] <foo> [bar]
-    return str
-      .split(' ')
-      .map((word) => {
-        if (word === '[options]') return this.styleOptionText(word);
-        if (word === '[command]') return this.styleSubcommandText(word);
-        if (word[0] === '[' || word[0] === '<')
-          return this.styleArgumentText(word);
-        return this.styleCommandText(word); // Restrict to initial words?
-      })
-      .join(' ');
-  }
+  styleUsage(str) {}
   styleCommandDescription(str) {
     return this.styleDescriptionText(str);
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

@@ -1,6 +1,6 @@
- Usage: test [options] [command]
+ Usage: undefined

[Killed] BlockStatement
lib/help.js:554:22
     //    command subcommand [options] [command] <foo> [bar]
     return str
       .split(' ')
-      .map((word) => {
-        if (word === '[options]') return this.styleOptionText(word);
-        if (word === '[command]') return this.styleSubcommandText(word);
-        if (word[0] === '[' || word[0] === '<')
-          return this.styleArgumentText(word);
-        return this.styleCommandText(word); // Restrict to initial words?
-      })
+      .map((word) => {})
       .join(' ');
   }
killedBy: when call helpInformation for program then help format is as expected (usage, options, commands)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

@@ -1,6 +1,6 @@
- Usage: test [options] [command]
+ Usage:

[Killed] ConditionalExpression
lib/help.js:555:13
     return str
       .split(' ')
       .map((word) => {
-        if (word === '[options]') return this.styleOptionText(word);
+        if (true) return this.styleOptionText(word);
         if (word === '[command]') return this.styleSubcommandText(word);
         if (word[0] === '[' || word[0] === '<')
killedBy: override style methods and check help information styleOptionText
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,6 +1,6 @@
- Usage: program RED [options] DER [command] <file>
+ Usage: RED program DER RED [options] DER RED [command] DER RED <file> DER

[Killed] EqualityOperator
lib/help.js:555:13
     return str
       .split(' ')
       .map((word) => {
-        if (word === '[options]') return this.styleOptionText(word);
+        if (word !== '[options]') return this.styleOptionText(word);
         if (word === '[command]') return this.styleSubcommandText(word);
         if (word[0] === '[' || word[0] === '<')
killedBy: override style methods and check help information styleOptionText
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,6 +1,6 @@
- Usage: program RED [options] DER [command] <file>
+ Usage: RED program DER [options] RED [command] DER RED <file> DER

[Killed] ConditionalExpression
lib/help.js:556:13
       .split(' ')
       .map((word) => {
         if (word === '[options]') return this.styleOptionText(word);
-        if (word === '[command]') return this.styleSubcommandText(word);
+        if (true) return this.styleSubcommandText(word);
         if (word[0] === '[' || word[0] === '<')
           return this.styleArgumentText(word);
killedBy: override style methods and check help information styleArgumentText
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,6 +1,6 @@
- Usage: program [options] [command] RED <file> DER
+ Usage: program [options] [command] <file>
