[Killed] BlockStatement
lib/option.js:102:50
    */
   implies(impliedOptionValues) {
     let newImplied = impliedOptionValues;
-    if (typeof impliedOptionValues === 'string') {
-      // string is not documented, but easy mistake and we can do what user probably intended.
-      newImplied = { [impliedOptionValues]: true };
-    }
+    if (typeof impliedOptionValues === 'string') {}
     this.implied = Object.assign(this.implied || {}, newImplied);
     return this;
killedBy: when passed string then treat as boolean
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: undefined

[Killed] EqualityOperator
lib/option.js:166:9
    */
 
   _concatValue(value, previous) {
-    if (previous === this.defaultValue || !Array.isArray(previous)) {
+    if (previous !== this.defaultValue || !Array.isArray(previous)) {
       return [value];
     }
killedBy: when option-argument for short optional... is -.1 then consumed=true
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
-   "first",
    "-.1",

[Survived] Regex
lib/option.js:204:32
 
   name() {
     if (this.long) {
-      return this.long.replace(/^--/, '');
+      return this.long.replace(/--/, '');
     }
     return this.short.replace(/^-/, '');

[Survived] Regex
lib/option.js:206:31
     if (this.long) {
       return this.long.replace(/^--/, '');
     }
-    return this.short.replace(/^-/, '');
+    return this.short.replace(/-/, '');
   }
 

[Killed] ConditionalExpression
lib/option.js:217:9
    */
 
   attributeName() {
-    if (this.negate) {
+    if (false) {
       return camelcase(this.name().replace(/^no-/, ''));
     }
killedBy: boolean flag on program when negatable boolean flag not specified then value is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Survived] Regex
lib/option.js:218:44
 
   attributeName() {
     if (this.negate) {
-      return camelcase(this.name().replace(/^no-/, ''));
+      return camelcase(this.name().replace(/no-/, ''));
     }
     return camelcase(this.name());

[Killed] BooleanLiteral
lib/option.js:256:30
    */
 
   isBoolean() {
-    return !this.required && !this.optional && !this.negate;
+    return !this.required && this.optional && !this.negate;
   }
 }
killedBy: required program option with mandatory value specified when program has mandatory-yes/no flag specified with flag then true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: ""

[Killed] ConditionalExpression
lib/option.js:283:11
       }
     });
     this.negativeOptions.forEach((value, key) => {
-      if (this.positiveOptions.has(key)) {
+      if (true) {
         this.dualOptions.add(key);
       }
killedBy: when negative option then stored in negativeOptions
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] BooleanLiteral
lib/option.js:298:9
    */
   valueFromOption(value, option) {
     const optionKey = option.attributeName();
-    if (!this.dualOptions.has(optionKey)) return true;
+    if (this.dualOptions.has(optionKey)) return true;
 
     // Use the value to deduce if (probably) came from the option.
killedBy: check priorities when source from env and implied undefined then implied is implied
statusReason: TypeError: Cannot read properties of undefined (reading 'presetArg')

[Killed] ConditionalExpression
lib/option.js:298:9
    */
   valueFromOption(value, option) {
     const optionKey = option.attributeName();
-    if (!this.dualOptions.has(optionKey)) return true;
+    if (false) return true;
 
     // Use the value to deduce if (probably) came from the option.
killedBy: check priorities when source from env and implied undefined then implied is implied
statusReason: TypeError: Cannot read properties of undefined (reading 'presetArg')

[Killed] ConditionalExpression
lib/option.js:302:27
 
     // Use the value to deduce if (probably) came from the option.
     const preset = this.negativeOptions.get(optionKey).presetArg;
-    const negativeValue = preset !== undefined ? preset : false;
+    const negativeValue = true ? preset : false;
     return option.negate === (negativeValue === value);
   }
killedBy: when imply from negative option then negative implied
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "foo": false,
-   "implied": "NEGATIVE",

[Killed] ConditionalExpression
lib/option.js:303:12
     // Use the value to deduce if (probably) came from the option.
     const preset = this.negativeOptions.get(optionKey).presetArg;
     const negativeValue = preset !== undefined ? preset : false;
-    return option.negate === (negativeValue === value);
+    return false;
   }
 }
killedBy: when imply from positive option then positive implied
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Object {
    "foo": true,
-   "implied": "POSITIVE",

[Killed] ArithmeticOperator
lib/option.js:317:12
 
 function camelcase(str) {
   return str.split('-').reduce((str, word) => {
-    return str + word[0].toUpperCase() + word.slice(1);
+    return str + word[0].toUpperCase() - word.slice(1);
   });
 }
killedBy: required program option with mandatory value specified when program has option with name different than property then still recognised
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "blue"
Received: undefined

[Killed] Regex
lib/option.js:331:24
   let shortFlag;
   let longFlag;
   // short flag, single dash and single character
-  const shortFlagExp = /^-[^-]$/;
+  const shortFlagExp = /^-[^-]/;
   // long flag, double dash and at least one character
   const longFlagExp = /^--[^-]/;
killedBy: when construct Option with flags {"flags": "-ws"} then throw
statusReason: Error: expect(received).toThrow(expected)

Expected pattern: /^option creation failed/

Received function did not throw

[Survived] StringLiteral
lib/option.js:335:50
   // long flag, double dash and at least one character
   const longFlagExp = /^--[^-]/;
 
-  const flagParts = flags.split(/[ |,]+/).concat('guard');
+  const flagParts = flags.split(/[ |,]+/).concat("");
   // Normal is short and/or long.
   if (shortFlagExp.test(flagParts[0])) shortFlag = flagParts.shift();

[Killed] ConditionalExpression
lib/option.js:340:7
   if (shortFlagExp.test(flagParts[0])) shortFlag = flagParts.shift();
   if (longFlagExp.test(flagParts[0])) longFlag = flagParts.shift();
   // Long then short. Rarely used but fine.
-  if (!shortFlag && shortFlagExp.test(flagParts[0]))
+  if (false)
     shortFlag = flagParts.shift();
   // Allow two long flags, like '--ws, --workspace'
killedBy: when construct Option with flags {"flags": "--both, -b"} then do not throw
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "option creation failed due to '-b' in option flags '--both, -b'
- too many short flags"

      577 |   - either use a single dash and a single character (for a short flag)
      578 |   - or use a double dash for a long option (and can have two, like '--ws, --workspace')`));

[Killed] BlockStatement
lib/option.js:344:53
     shortFlag = flagParts.shift();
   // Allow two long flags, like '--ws, --workspace'
   // This is the supported way to have a shortish option flag.
-  if (!shortFlag && longFlagExp.test(flagParts[0])) {
-    shortFlag = longFlag;
-    longFlag = flagParts.shift();
-  }
+  if (!shortFlag && longFlagExp.test(flagParts[0])) {}
 
   // Check for unprocessed flag. Fail noisily rather than silently ignore.
killedBy: when construct Option with flags {"flags": "--ws, --workspace"} then do not throw
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "option creation failed due to '--workspace' in option flags '--ws, --workspace'
- too many long flags"

      579 |         if (stryMutAct_9fa48("2229") ? false : stryMutAct_9fa48("2228") ? true : (stryCov_9fa48("2228", "2229"), shortFlagExp.test(unsupportedFlag))) throw new Error(stryMutAct_9fa48("2230") ? `` : (stryCov

[Killed] MethodExpression
lib/option.js:350:7
   }
 
   // Check for unprocessed flag. Fail noisily rather than silently ignore.
-  if (flagParts[0].startsWith('-')) {
+  if (flagParts[0].endsWith('-')) {
     const unsupportedFlag = flagParts[0];
     const baseError = `option creation failed due to '${unsupportedFlag}' in option flags '${flags}'`;
killedBy: when construct Option with flags {"flags": "-a, -b"} then throw
statusReason: Error: expect(received).toThrow(expected)

Expected pattern: /^option creation failed/

Received function did not throw

[Killed] BlockStatement
lib/option.js:350:37
   }
 
   // Check for unprocessed flag. Fail noisily rather than silently ignore.
-  if (flagParts[0].startsWith('-')) {
-    const unsupportedFlag = flagParts[0];
-    const baseError = `option creation failed due to '${unsupportedFlag}' in option flags '${flags}'`;
-    if (/^-[^-][^-]/.test(unsupportedFlag))
-      throw new Error(
-        `${baseError}
-- a short flag is a single dash and a single character
-  - either use a single dash and a single character (for a short flag)
-  - or use a double dash for a long option (and can have two, like '--ws, --workspace')`,
-      );
-    if (shortFlagExp.test(unsupportedFlag))
-      throw new Error(`${baseError}
-- too many short flags`);
-    if (longFlagExp.test(unsupportedFlag))
-      throw new Error(`${baseError}
-- too many long flags`);
-
-    throw new Error(`${baseError}
-- unrecognised flag format`);
-  }
+  if (flagParts[0].startsWith('-')) {}
   if (shortFlag === undefined && longFlag === undefined)
     throw new Error(
killedBy: when construct Option with flags {"flags": "-a, -b"} then throw
statusReason: Error: expect(received).toThrow(expected)

Expected pattern: /^option creation failed/

Received function did not throw

[Killed] StringLiteral
lib/option.js:367:21
       throw new Error(`${baseError}
 - too many long flags`);
 
-    throw new Error(`${baseError}
-- unrecognised flag format`);
+    throw new Error(``);
   }
   if (shortFlag === undefined && longFlag === undefined)
killedBy: when construct Option with flags {"flags": "---triple"} then throw
statusReason: Error: expect(received).toThrow(expected)

Expected pattern: /^option creation failed/
Received message: ""

      581 |         if (stryMutAct_9fa48("2232") ? false : stryMutAct_9fa48("2231") ? true : (stryCov_9fa48("2231", "2232"), longFlagExp.test(unsupportedFlag))) throw new Error(stryMutAct_9fa48("2233") ? `` : (stryCov_9fa48("2233"), `${baseError}
      582 | - too many long flags`));
    >

[Killed] ConditionalExpression
lib/option.js:370:7
     throw new Error(`${baseError}
 - unrecognised flag format`);
   }
-  if (shortFlag === undefined && longFlag === undefined)
+  if (true && longFlag === undefined)
     throw new Error(
       `option creation failed due to no flags found in '${flags}'.`,
killedBy: when construct Option with flags {"flags": "-s"} then do not throw
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "option creation failed due to no flags found in '-s'."

      585 |       }
      586 |     }

[Killed] EqualityOperator
lib/option.js:370:7
     throw new Error(`${baseError}
 - unrecognised flag format`);
   }
-  if (shortFlag === undefined && longFlag === undefined)
+  if (shortFlag !== undefined && longFlag === undefined)
     throw new Error(
       `option creation failed due to no flags found in '${flags}'.`,
killedBy: when construct Option with flags {"flags": "sdkjhskjh"} then throw
statusReason: Error: expect(received).toThrow(expected)

Expected pattern: /^option creation failed/

Received function did not throw
