[Killed] EqualityOperator
lib/suggestSimilar.js:9:7
   // (Simple implementation.)
 
   // Quick early exit, return worst case.
-  if (Math.abs(a.length - b.length) > maxDistance)
+  if (Math.abs(a.length - b.length) <= maxDistance)
     return Math.max(a.length, b.length);
 
killedBy: when cli of a and commands ["ab"] then suggest ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: null

[Killed] ConditionalExpression
lib/suggestSimilar.js:9:7
   // (Simple implementation.)
 
   // Quick early exit, return worst case.
-  if (Math.abs(a.length - b.length) > maxDistance)
+  if (true)
     return Math.max(a.length, b.length);
 
killedBy: when cli of a and commands ["ab"] then suggest ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: null

[Survived] MethodExpression
lib/suggestSimilar.js:10:12
 
   // Quick early exit, return worst case.
   if (Math.abs(a.length - b.length) > maxDistance)
-    return Math.max(a.length, b.length);
+    return Math.min(a.length, b.length);
 
   // distance between prefix substrings of a and b

[Killed] ConditionalExpression
lib/suggestSimilar.js:16:19
   const d = [];
 
   // pure deletions turn a into empty string
-  for (let i = 0; i <= a.length; i++) {
+  for (let i = 0; false; i++) {
     d[i] = [i];
   }
killedBy: when cli of a and commands ["ab"] then suggest ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: null

[Killed] EqualityOperator
lib/suggestSimilar.js:16:19
   const d = [];
 
   // pure deletions turn a into empty string
-  for (let i = 0; i <= a.length; i++) {
+  for (let i = 0; i > a.length; i++) {
     d[i] = [i];
   }
killedBy: when cli of a and commands ["ab"] then suggest ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: null

[Killed] EqualityOperator
lib/suggestSimilar.js:20:19
     d[i] = [i];
   }
   // pure insertions turn empty string into b
-  for (let j = 0; j <= b.length; j++) {
+  for (let j = 0; j < b.length; j++) {
     d[0][j] = j;
   }
killedBy: when cli of a and commands ["ab"] then suggest ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: null

[Killed] ConditionalExpression
lib/suggestSimilar.js:20:19
     d[i] = [i];
   }
   // pure insertions turn empty string into b
-  for (let j = 0; j <= b.length; j++) {
+  for (let j = 0; false; j++) {
     d[0][j] = j;
   }
killedBy: when cli of a and commands ["ab"] then suggest ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: null

[Killed] BlockStatement
lib/suggestSimilar.js:25:39
   }
 
   // fill matrix
-  for (let j = 1; j <= b.length; j++) {
-    for (let i = 1; i <= a.length; i++) {
-      let cost = 1;
-      if (a[i - 1] === b[j - 1]) {
-        cost = 0;
-      } else {
-        cost = 1;
-      }
-      d[i][j] = Math.min(
-        d[i - 1][j] + 1, // deletion
-        d[i][j - 1] + 1, // insertion
-        d[i - 1][j - 1] + cost, // substitution
-      );
-      // transposition
-      if (i > 1 && j > 1 && a[i - 1] === b[j - 2] && a[i - 2] === b[j - 1]) {
-        d[i][j] = Math.min(d[i][j], d[i - 2][j - 2] + 1);
-      }
-    }
-  }
+  for (let j = 1; j <= b.length; j++) {}
 
   return d[a.length][b.length];
killedBy: when cli of a and commands ["ab"] then suggest ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: null

[Killed] EqualityOperator
lib/suggestSimilar.js:25:19
   }
 
   // fill matrix
-  for (let j = 1; j <= b.length; j++) {
+  for (let j = 1; j < b.length; j++) {
     for (let i = 1; i <= a.length; i++) {
       let cost = 1;
killedBy: when cli of a and commands ["ab"] then suggest ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: null

[Killed] EqualityOperator
lib/suggestSimilar.js:26:21
 
   // fill matrix
   for (let j = 1; j <= b.length; j++) {
-    for (let i = 1; i <= a.length; i++) {
+    for (let i = 1; i > a.length; i++) {
       let cost = 1;
       if (a[i - 1] === b[j - 1]) {
killedBy: when cli of a and commands ["ab"] then suggest ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: null

[Killed] EqualityOperator
lib/suggestSimilar.js:26:21
 
   // fill matrix
   for (let j = 1; j <= b.length; j++) {
-    for (let i = 1; i <= a.length; i++) {
+    for (let i = 1; i < a.length; i++) {
       let cost = 1;
       if (a[i - 1] === b[j - 1]) {
killedBy: when cli of a and commands ["ab"] then suggest ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: null

[Killed] ConditionalExpression
lib/suggestSimilar.js:28:11
   for (let j = 1; j <= b.length; j++) {
     for (let i = 1; i <= a.length; i++) {
       let cost = 1;
-      if (a[i - 1] === b[j - 1]) {
+      if (false) {
         cost = 0;
       } else {
killedBy: when cli of a and commands ["ab"] then suggest ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: null

[Killed] ArithmeticOperator
lib/suggestSimilar.js:28:13
   for (let j = 1; j <= b.length; j++) {
     for (let i = 1; i <= a.length; i++) {
       let cost = 1;
-      if (a[i - 1] === b[j - 1]) {
+      if (a[i + 1] === b[j - 1]) {
         cost = 0;
       } else {
killedBy: when cli of a and commands ["ab"] then suggest ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: null

[Survived] BlockStatement
lib/suggestSimilar.js:30:14
       let cost = 1;
       if (a[i - 1] === b[j - 1]) {
         cost = 0;
-      } else {
-        cost = 1;
-      }
+      } else {}
       d[i][j] = Math.min(
         d[i - 1][j] + 1, // deletion

[Killed] MethodExpression
lib/suggestSimilar.js:33:17
       } else {
         cost = 1;
       }
-      d[i][j] = Math.min(
-        d[i - 1][j] + 1, // deletion
-        d[i][j - 1] + 1, // insertion
-        d[i - 1][j - 1] + cost, // substitution
-      );
+      d[i][j] = Math.max(d[i - 1][j] + 1,
+// deletion
+d[i][j - 1] + 1,
+// insertion
+d[i - 1][j - 1] + cost // substitution
+);
       // transposition
       if (i > 1 && j > 1 && a[i - 1] === b[j - 2] && a[i - 2] === b[j - 1]) {
killedBy: when cli of a and commands ["ab"] then suggest ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: null

[Killed] ArithmeticOperator
lib/suggestSimilar.js:34:9
         cost = 1;
       }
       d[i][j] = Math.min(
-        d[i - 1][j] + 1, // deletion
+        d[i - 1][j] - 1, // deletion
         d[i][j - 1] + 1, // insertion
         d[i - 1][j - 1] + cost, // substitution
killedBy: when cli of yyy and commands ["zzz"] then suggest null because none similar
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "zzz"

[Killed] ArithmeticOperator
lib/suggestSimilar.js:34:11
         cost = 1;
       }
       d[i][j] = Math.min(
-        d[i - 1][j] + 1, // deletion
+        d[i + 1][j] + 1, // deletion
         d[i][j - 1] + 1, // insertion
         d[i - 1][j - 1] + cost, // substitution
killedBy: when cli of a and commands ["ab"] then suggest ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: null

[Killed] ArithmeticOperator
lib/suggestSimilar.js:35:14
       }
       d[i][j] = Math.min(
         d[i - 1][j] + 1, // deletion
-        d[i][j - 1] + 1, // insertion
+        d[i][j + 1] + 1, // insertion
         d[i - 1][j - 1] + cost, // substitution
       );
killedBy: when cli of a and commands ["ab"] then suggest ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: null

[Killed] ArithmeticOperator
lib/suggestSimilar.js:35:9
       }
       d[i][j] = Math.min(
         d[i - 1][j] + 1, // deletion
-        d[i][j - 1] + 1, // insertion
+        // deletion
+d[i][j - 1] - 1, // insertion
         d[i - 1][j - 1] + cost, // substitution
       );
killedBy: when cli of yyy and commands ["zzz"] then suggest null because none similar
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "help"

[Killed] ArithmeticOperator
lib/suggestSimilar.js:36:9
       d[i][j] = Math.min(
         d[i - 1][j] + 1, // deletion
         d[i][j - 1] + 1, // insertion
-        d[i - 1][j - 1] + cost, // substitution
+        // insertion
+d[i - 1][j - 1] - cost // substitution, // substitution
       );
       // transposition
killedBy: when cli of yyy and commands ["zzz"] then suggest null because none similar
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "zzz"

[Killed] ArithmeticOperator
lib/suggestSimilar.js:36:18
       d[i][j] = Math.min(
         d[i - 1][j] + 1, // deletion
         d[i][j - 1] + 1, // insertion
-        d[i - 1][j - 1] + cost, // substitution
+        d[i - 1][j + 1] + cost, // substitution
       );
       // transposition
killedBy: when cli of a and commands ["ab"] then suggest ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: null

[Killed] ArithmeticOperator
lib/suggestSimilar.js:39:56
         d[i - 1][j - 1] + cost, // substitution
       );
       // transposition
-      if (i > 1 && j > 1 && a[i - 1] === b[j - 2] && a[i - 2] === b[j - 1]) {
+      if (i > 1 && j > 1 && a[i - 1] === b[j - 2] && a[i + 2] === b[j - 1]) {
         d[i][j] = Math.min(d[i][j], d[i - 2][j - 2] + 1);
       }
killedBy: when cli of act and commands ["cat"] then suggest cat because 1 transposition
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "cat"
Received: null

[Killed] ArithmeticOperator
lib/suggestSimilar.js:39:44
         d[i - 1][j - 1] + cost, // substitution
       );
       // transposition
-      if (i > 1 && j > 1 && a[i - 1] === b[j - 2] && a[i - 2] === b[j - 1]) {
+      if (i > 1 && j > 1 && a[i - 1] === b[j + 2] && a[i - 2] === b[j - 1]) {
         d[i][j] = Math.min(d[i][j], d[i - 2][j - 2] + 1);
       }
killedBy: when cli of act and commands ["cat"] then suggest cat because 1 transposition
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "cat"
Received: null

[Killed] MethodExpression
lib/suggestSimilar.js:40:19
       );
       // transposition
       if (i > 1 && j > 1 && a[i - 1] === b[j - 2] && a[i - 2] === b[j - 1]) {
-        d[i][j] = Math.min(d[i][j], d[i - 2][j - 2] + 1);
+        d[i][j] = Math.max(d[i][j], d[i - 2][j - 2] + 1);
       }
     }
killedBy: when cli of act and commands ["cat"] then suggest cat because 1 transposition
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "cat"
Received: null

[Killed] ArithmeticOperator
lib/suggestSimilar.js:40:37
       );
       // transposition
       if (i > 1 && j > 1 && a[i - 1] === b[j - 2] && a[i - 2] === b[j - 1]) {
-        d[i][j] = Math.min(d[i][j], d[i - 2][j - 2] + 1);
+        d[i][j] = Math.min(d[i][j], d[i - 2][j - 2] - 1);
       }
     }
killedBy: when similar hidden alias then not suggested
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "help"

[Killed] ConditionalExpression
lib/suggestSimilar.js:57:7
  */
 
 function suggestSimilar(word, candidates) {
-  if (!candidates || candidates.length === 0) return '';
+  if (true) return '';
   // remove possible duplicates
   candidates = Array.from(new Set(candidates));
killedBy: when cli of a and commands ["ab"] then suggest ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: null

[Killed] BooleanLiteral
lib/suggestSimilar.js:57:7
  */
 
 function suggestSimilar(word, candidates) {
-  if (!candidates || candidates.length === 0) return '';
+  if (candidates || candidates.length === 0) return '';
   // remove possible duplicates
   candidates = Array.from(new Set(candidates));
killedBy: when cli of a and commands ["ab"] then suggest ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: null

[Killed] MethodExpression
lib/suggestSimilar.js:61:28
   // remove possible duplicates
   candidates = Array.from(new Set(candidates));
 
-  const searchingOptions = word.startsWith('--');
+  const searchingOptions = word.endsWith('--');
   if (searchingOptions) {
     word = word.slice(2);
killedBy: when cli of --a and options ["--b"] then suggest null because one edit away but not similar
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "--b"

[Killed] BlockStatement
lib/suggestSimilar.js:62:25
   candidates = Array.from(new Set(candidates));
 
   const searchingOptions = word.startsWith('--');
-  if (searchingOptions) {
-    word = word.slice(2);
-    candidates = candidates.map((candidate) => candidate.slice(2));
-  }
+  if (searchingOptions) {}
 
   let similar = [];
killedBy: when default help option then --help is candidate for suggestion
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "--help"
Received: "----help"

[Killed] ConditionalExpression
lib/suggestSimilar.js:62:7
   candidates = Array.from(new Set(candidates));
 
   const searchingOptions = word.startsWith('--');
-  if (searchingOptions) {
+  if (true) {
     word = word.slice(2);
     candidates = candidates.map((candidate) => candidate.slice(2));
killedBy: when cli of a and commands ["ab"] then suggest ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: null

[Killed] MethodExpression
lib/suggestSimilar.js:63:12
 
   const searchingOptions = word.startsWith('--');
   if (searchingOptions) {
-    word = word.slice(2);
+    word = word;
     candidates = candidates.map((candidate) => candidate.slice(2));
   }
killedBy: when cli of --a and options ["--ab"] then suggest --ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "--ab"
Received: null

[Killed] MethodExpression
lib/suggestSimilar.js:64:48
   const searchingOptions = word.startsWith('--');
   if (searchingOptions) {
     word = word.slice(2);
-    candidates = candidates.map((candidate) => candidate.slice(2));
+    candidates = candidates.map((candidate) => candidate);
   }
 
killedBy: when default help option then --help is candidate for suggestion
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "--help"
Received: "----help"

[Killed] ArrowFunction
lib/suggestSimilar.js:64:33
   const searchingOptions = word.startsWith('--');
   if (searchingOptions) {
     word = word.slice(2);
-    candidates = candidates.map((candidate) => candidate.slice(2));
+    candidates = candidates.map(() => undefined);
   }
 
killedBy: when default writeErr() then error on stderr
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
lib/suggestSimilar.js:70:37
   let similar = [];
   let bestDistance = maxDistance;
   const minSimilarity = 0.4;
-  candidates.forEach((candidate) => {
-    if (candidate.length <= 1) return; // no one character guesses
-
-    const distance = editDistance(word, candidate);
-    const length = Math.max(word.length, candidate.length);
-    const similarity = (length - distance) / length;
-    if (similarity > minSimilarity) {
-      if (distance < bestDistance) {
-        // better edit distance, throw away previous worse matches
-        bestDistance = distance;
-        similar = [candidate];
-      } else if (distance === bestDistance) {
-        similar.push(candidate);
-      }
-    }
-  });
+  candidates.forEach((candidate) => {});
 
   similar.sort((a, b) => a.localeCompare(b));
killedBy: when cli of a and commands ["ab"] then suggest ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: null

[Killed] EqualityOperator
lib/suggestSimilar.js:71:9
   let bestDistance = maxDistance;
   const minSimilarity = 0.4;
   candidates.forEach((candidate) => {
-    if (candidate.length <= 1) return; // no one character guesses
+    if (candidate.length > 1) return; // no one character guesses
 
     const distance = editDistance(word, candidate);
killedBy: when cli of a and commands ["ab"] then suggest ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: null

[Killed] EqualityOperator
lib/suggestSimilar.js:71:9
   let bestDistance = maxDistance;
   const minSimilarity = 0.4;
   candidates.forEach((candidate) => {
-    if (candidate.length <= 1) return; // no one character guesses
+    if (candidate.length < 1) return; // no one character guesses
 
     const distance = editDistance(word, candidate);
killedBy: when cli of ab and commands ["a"] then suggest null because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "a"

[Killed] MethodExpression
lib/suggestSimilar.js:74:20
     if (candidate.length <= 1) return; // no one character guesses
 
     const distance = editDistance(word, candidate);
-    const length = Math.max(word.length, candidate.length);
+    const length = Math.min(word.length, candidate.length);
     const similarity = (length - distance) / length;
     if (similarity > minSimilarity) {
killedBy: when cli of a and commands ["ab"] then suggest ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: null

[Killed] ArithmeticOperator
lib/suggestSimilar.js:75:24
 
     const distance = editDistance(word, candidate);
     const length = Math.max(word.length, candidate.length);
-    const similarity = (length - distance) / length;
+    const similarity = (length - distance) * length;
     if (similarity > minSimilarity) {
       if (distance < bestDistance) {
killedBy: when cli of cxx and commands ["cat"] then suggest null because 2 edits away and short string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "cat"

[Killed] ArithmeticOperator
lib/suggestSimilar.js:75:25
 
     const distance = editDistance(word, candidate);
     const length = Math.max(word.length, candidate.length);
-    const similarity = (length - distance) / length;
+    const similarity = (length + distance) / length;
     if (similarity > minSimilarity) {
       if (distance < bestDistance) {
killedBy: when cli of yyy and commands ["zzz"] then suggest null because none similar
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "zzz"

[Killed] EqualityOperator
lib/suggestSimilar.js:76:9
     const distance = editDistance(word, candidate);
     const length = Math.max(word.length, candidate.length);
     const similarity = (length - distance) / length;
-    if (similarity > minSimilarity) {
+    if (similarity <= minSimilarity) {
       if (distance < bestDistance) {
         // better edit distance, throw away previous worse matches
killedBy: when cli of yyy and commands ["zzz"] then suggest null because none similar
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "zzz"

[Killed] BlockStatement
lib/suggestSimilar.js:76:37
     const distance = editDistance(word, candidate);
     const length = Math.max(word.length, candidate.length);
     const similarity = (length - distance) / length;
-    if (similarity > minSimilarity) {
-      if (distance < bestDistance) {
-        // better edit distance, throw away previous worse matches
-        bestDistance = distance;
-        similar = [candidate];
-      } else if (distance === bestDistance) {
-        similar.push(candidate);
-      }
-    }
+    if (similarity > minSimilarity) {}
   });
 
killedBy: when cli of a and commands ["ab"] then suggest ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: null

[Killed] ConditionalExpression
lib/suggestSimilar.js:77:11
     const length = Math.max(word.length, candidate.length);
     const similarity = (length - distance) / length;
     if (similarity > minSimilarity) {
-      if (distance < bestDistance) {
+      if (true) {
         // better edit distance, throw away previous worse matches
         bestDistance = distance;
killedBy: when cli of xat and commands ["rat","cat","bat"] then suggest bat, cat, rat because sorted possibles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bat, cat, rat"
Received: "bat"

[Killed] EqualityOperator
lib/suggestSimilar.js:77:11
     const length = Math.max(word.length, candidate.length);
     const similarity = (length - distance) / length;
     if (similarity > minSimilarity) {
-      if (distance < bestDistance) {
+      if (distance <= bestDistance) {
         // better edit distance, throw away previous worse matches
         bestDistance = distance;
killedBy: when cli of xat and commands ["rat","cat","bat"] then suggest bat, cat, rat because sorted possibles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bat, cat, rat"
Received: "bat"

[Killed] ConditionalExpression
lib/suggestSimilar.js:81:18
         // better edit distance, throw away previous worse matches
         bestDistance = distance;
         similar = [candidate];
-      } else if (distance === bestDistance) {
+      } else if (false) {
         similar.push(candidate);
       }
killedBy: when cli of 1234567 and commands ["1234567890"] then suggest 1234567890 because 3 edits away is similar for long string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1234567890"
Received: null

[Killed] EqualityOperator
lib/suggestSimilar.js:81:18
         // better edit distance, throw away previous worse matches
         bestDistance = distance;
         similar = [candidate];
-      } else if (distance === bestDistance) {
+      } else if (distance !== bestDistance) {
         similar.push(candidate);
       }
killedBy: when cli of 1234567 and commands ["1234567890"] then suggest 1234567890 because 3 edits away is similar for long string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1234567890"
Received: null

[Killed] ArrowFunction
lib/suggestSimilar.js:87:16
     }
   });
 
-  similar.sort((a, b) => a.localeCompare(b));
+  similar.sort(() => undefined);
   if (searchingOptions) {
     similar = similar.map((candidate) => `--${candidate}`);
killedBy: when cli of xat and commands ["rat","cat","bat"] then suggest bat, cat, rat because sorted possibles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bat, cat, rat"
Received: "rat, cat, bat"

[Killed] MethodExpression
lib/suggestSimilar.js:87:3
     }
   });
 
-  similar.sort((a, b) => a.localeCompare(b));
+  similar;
   if (searchingOptions) {
     similar = similar.map((candidate) => `--${candidate}`);
killedBy: when cli of xat and commands ["rat","cat","bat"] then suggest bat, cat, rat because sorted possibles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bat, cat, rat"
Received: "rat, cat, bat"

[Killed] ConditionalExpression
lib/suggestSimilar.js:88:7
   });
 
   similar.sort((a, b) => a.localeCompare(b));
-  if (searchingOptions) {
+  if (true) {
     similar = similar.map((candidate) => `--${candidate}`);
   }
killedBy: when cli of a and commands ["ab"] then suggest ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: "--ab"

[Killed] BlockStatement
lib/suggestSimilar.js:88:25
   });
 
   similar.sort((a, b) => a.localeCompare(b));
-  if (searchingOptions) {
-    similar = similar.map((candidate) => `--${candidate}`);
-  }
+  if (searchingOptions) {}
 
   if (similar.length > 1) {
killedBy: when default help option then --help is candidate for suggestion
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "--help"
Received: "help"

[Killed] ArrowFunction
lib/suggestSimilar.js:89:27
 
   similar.sort((a, b) => a.localeCompare(b));
   if (searchingOptions) {
-    similar = similar.map((candidate) => `--${candidate}`);
+    similar = similar.map(() => undefined);
   }
 
killedBy: when default help option then --help is candidate for suggestion
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "--help"
Received: "undefined"

[Killed] ConditionalExpression
lib/suggestSimilar.js:92:7
     similar = similar.map((candidate) => `--${candidate}`);
   }
 
-  if (similar.length > 1) {
+  if (true) {
     return `\n(Did you mean one of ${similar.join(', ')}?)`;
   }
killedBy: when cli of yyy and commands ["zzz"] then suggest null because none similar
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: ""

[Killed] EqualityOperator
lib/suggestSimilar.js:92:7
     similar = similar.map((candidate) => `--${candidate}`);
   }
 
-  if (similar.length > 1) {
+  if (similar.length <= 1) {
     return `\n(Did you mean one of ${similar.join(', ')}?)`;
   }
killedBy: when cli of yyy and commands ["zzz"] then suggest null because none similar
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: ""

[Killed] EqualityOperator
lib/suggestSimilar.js:95:7
   if (similar.length > 1) {
     return `\n(Did you mean one of ${similar.join(', ')}?)`;
   }
-  if (similar.length === 1) {
+  if (similar.length !== 1) {
     return `\n(Did you mean ${similar[0]}?)`;
   }
killedBy: when cli of yyy and commands ["zzz"] then suggest null because none similar
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "undefined"

[Killed] ConditionalExpression
lib/suggestSimilar.js:95:7
   if (similar.length > 1) {
     return `\n(Did you mean one of ${similar.join(', ')}?)`;
   }
-  if (similar.length === 1) {
+  if (true) {
     return `\n(Did you mean ${similar[0]}?)`;
   }
killedBy: when cli of yyy and commands ["zzz"] then suggest null because none similar
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "undefined"

[Killed] StringLiteral
lib/suggestSimilar.js:96:12
     return `\n(Did you mean one of ${similar.join(', ')}?)`;
   }
   if (similar.length === 1) {
-    return `\n(Did you mean ${similar[0]}?)`;
+    return ``;
   }
   return '';
killedBy: when cli of a and commands ["ab"] then suggest ab because one edit away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: null

[Killed] StringLiteral
lib/suggestSimilar.js:98:10
   if (similar.length === 1) {
     return `\n(Did you mean ${similar[0]}?)`;
   }
-  return '';
+  return "Stryker was here!";
 }
 
killedBy: .exitOverride and error details when specify unknown command then throw CommanderError
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "error: unknown command 'oops'"
Received: "error: unknown command 'oops'Stryker was here!"
