[Killed] BlockStatement
index.js:3:60
 import process from 'process'; // eslint-disable-line node/prefer-global/process
 
-export default function hasFlag(flag, argv = process.argv) {
-	const prefix = flag.startsWith('-') ? '' : (flag.length === 1 ? '-' : '--');
-	const position = argv.indexOf(prefix + flag);
-	const terminatorPosition = argv.indexOf('--');
-	return position !== -1 && (terminatorPosition === -1 || position < terminatorPosition);
-}
+export default function hasFlag(flag, argv = process.argv) {}
 
killedBy: All tests
statusReason: > has-flag@5.0.1 test
> ava




  × main

[Killed] MethodExpression
index.js:4:17
 import process from 'process'; // eslint-disable-line node/prefer-global/process
 
 export default function hasFlag(flag, argv = process.argv) {
-	const prefix = flag.startsWith('-') ? '' : (flag.length === 1 ? '-' : '--');
+	const prefix = flag.endsWith('-') ? '' : (flag.length === 1 ? '-' : '--');
 	const position = argv.indexOf(prefix + flag);
 	const terminatorPosition = argv.indexOf('--');
killedBy: All tests
statusReason: > has-flag@5.0.1 test
> ava




  × main optional prefix

[Killed] ConditionalExpression
index.js:4:46
 import process from 'process'; // eslint-disable-line node/prefer-global/process
 
 export default function hasFlag(flag, argv = process.argv) {
-	const prefix = flag.startsWith('-') ? '' : (flag.length === 1 ? '-' : '--');
+	const prefix = flag.startsWith('-') ? '' : (true ? '-' : '--');
 	const position = argv.indexOf(prefix + flag);
 	const terminatorPosition = argv.indexOf('--');
killedBy: All tests
statusReason: > has-flag@5.0.1 test
> ava




  × main

[Killed] ArithmeticOperator
index.js:5:32
 
 export default function hasFlag(flag, argv = process.argv) {
 	const prefix = flag.startsWith('-') ? '' : (flag.length === 1 ? '-' : '--');
-	const position = argv.indexOf(prefix + flag);
+	const position = argv.indexOf(prefix - flag);
 	const terminatorPosition = argv.indexOf('--');
 	return position !== -1 && (terminatorPosition === -1 || position < terminatorPosition);
killedBy: All tests
statusReason: > has-flag@5.0.1 test
> ava




  × main

[Killed] EqualityOperator
index.js:7:9
 	const prefix = flag.startsWith('-') ? '' : (flag.length === 1 ? '-' : '--');
 	const position = argv.indexOf(prefix + flag);
 	const terminatorPosition = argv.indexOf('--');
-	return position !== -1 && (terminatorPosition === -1 || position < terminatorPosition);
+	return position === -1 && (terminatorPosition === -1 || position < terminatorPosition);
 }
 
killedBy: All tests
statusReason: > has-flag@5.0.1 test
> ava




  × main

[Killed] EqualityOperator
index.js:7:29
 	const prefix = flag.startsWith('-') ? '' : (flag.length === 1 ? '-' : '--');
 	const position = argv.indexOf(prefix + flag);
 	const terminatorPosition = argv.indexOf('--');
-	return position !== -1 && (terminatorPosition === -1 || position < terminatorPosition);
+	return position !== -1 && (terminatorPosition !== -1 || position < terminatorPosition);
 }
 
killedBy: All tests
statusReason: > has-flag@5.0.1 test
> ava




  × main
