[Killed] Regex
index.js:7:40
 
 const segmenter = new Intl.Segmenter();
 
-const defaultIgnorableCodePointRegex = /^\p{Default_Ignorable_Code_Point}$/u;
+const defaultIgnorableCodePointRegex = /\p{Default_Ignorable_Code_Point}$/u;
 
 export default function stringWidth(string, options = {}) {
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main ↔️ default text presentation character rendered as emoji

[Killed] EqualityOperator
index.js:10:36
 const defaultIgnorableCodePointRegex = /^\p{Default_Ignorable_Code_Point}$/u;
 
 export default function stringWidth(string, options = {}) {
-	if (typeof string !== 'string' || string.length === 0) {
+	if (typeof string !== 'string' || string.length !== 0) {
 		return 0;
 	}
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main

[Killed] EqualityOperator
index.js:10:6
 const defaultIgnorableCodePointRegex = /^\p{Default_Ignorable_Code_Point}$/u;
 
 export default function stringWidth(string, options = {}) {
-	if (typeof string !== 'string' || string.length === 0) {
+	if (typeof string === 'string' || string.length === 0) {
 		return 0;
 	}
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main

[Killed] BooleanLiteral
index.js:15:23
 	}
 
 	const {
-		ambiguousIsNarrow = true,
+		ambiguousIsNarrow = false,
 		countAnsiEscapeCodes = false,
 	} = options;
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main

[Killed] BooleanLiteral
index.js:16:26
 
 	const {
 		ambiguousIsNarrow = true,
-		countAnsiEscapeCodes = false,
+		countAnsiEscapeCodes = true,
 	} = options;
 
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main

[Killed] BlockStatement
index.js:19:29
 		countAnsiEscapeCodes = false,
 	} = options;
 
-	if (!countAnsiEscapeCodes) {
-		string = stripAnsi(string);
-	}
+	if (!countAnsiEscapeCodes) {}
 
 	if (string.length === 0) {
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main

[Killed] ConditionalExpression
index.js:19:6
 		countAnsiEscapeCodes = false,
 	} = options;
 
-	if (!countAnsiEscapeCodes) {
+	if (true) {
 		string = stripAnsi(string);
 	}
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main

[Killed] EqualityOperator
index.js:23:6
 		string = stripAnsi(string);
 	}
 
-	if (string.length === 0) {
+	if (string.length !== 0) {
 		return 0;
 	}
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main

[Killed] ConditionalExpression
index.js:23:6
 		string = stripAnsi(string);
 	}
 
-	if (string.length === 0) {
+	if (true) {
 		return 0;
 	}
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main
  ✔ ignores control characters

[Killed] BooleanLiteral
index.js:28:50
 	}
 
 	let width = 0;
-	const eastAsianWidthOptions = {ambiguousAsWide: !ambiguousIsNarrow};
+	const eastAsianWidthOptions = {ambiguousAsWide: ambiguousIsNarrow};
 
 	for (const {segment: character} of segmenter.segment(string)) {
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main

[Killed] ConditionalExpression
index.js:34:7
 		const codePoint = character.codePointAt(0);
 
 		// Ignore control characters
-		if (codePoint <= 0x1F || (codePoint >= 0x7F && codePoint <= 0x9F)) {
+		if (true) {
 			continue;
 		}
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main

[Killed] EqualityOperator
index.js:34:7
 		const codePoint = character.codePointAt(0);
 
 		// Ignore control characters
-		if (codePoint <= 0x1F || (codePoint >= 0x7F && codePoint <= 0x9F)) {
+		if (codePoint > 0x1F || (codePoint >= 0x7F && codePoint <= 0x9F)) {
 			continue;
 		}
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main

[Killed] ConditionalExpression
index.js:40:5
 
 		// Ignore zero-width characters
 		if (
-			(codePoint >= 0x20_0B && codePoint <= 0x20_0F) // Zero-width space, non-joiner, joiner, left-to-right mark, right-to-left mark
+			(true && codePoint <= 0x20_0F) // Zero-width space, non-joiner, joiner, left-to-right mark, right-to-left mark
 			|| codePoint === 0xFE_FF // Zero-width no-break space
 		) {
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main

[Killed] ConditionalExpression
index.js:40:29
 
 		// Ignore zero-width characters
 		if (
-			(codePoint >= 0x20_0B && codePoint <= 0x20_0F) // Zero-width space, non-joiner, joiner, left-to-right mark, right-to-left mark
+			(codePoint >= 0x20_0B && true) // Zero-width space, non-joiner, joiner, left-to-right mark, right-to-left mark
 			|| codePoint === 0xFE_FF // Zero-width no-break space
 		) {
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main

[Killed] EqualityOperator
index.js:41:7
 		// Ignore zero-width characters
 		if (
 			(codePoint >= 0x20_0B && codePoint <= 0x20_0F) // Zero-width space, non-joiner, joiner, left-to-right mark, right-to-left mark
-			|| codePoint === 0xFE_FF // Zero-width no-break space
+			|| codePoint !== 0xFE_FF // Zero-width no-break space
 		) {
 			continue;
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main

[Survived] ConditionalExpression
index.js:41:7
 		// Ignore zero-width characters
 		if (
 			(codePoint >= 0x20_0B && codePoint <= 0x20_0F) // Zero-width space, non-joiner, joiner, left-to-right mark, right-to-left mark
-			|| codePoint === 0xFE_FF // Zero-width no-break space
+			|| false // Zero-width no-break space
 		) {
 			continue;

[Survived] BlockStatement
index.js:42:5
 		if (
 			(codePoint >= 0x20_0B && codePoint <= 0x20_0F) // Zero-width space, non-joiner, joiner, left-to-right mark, right-to-left mark
 			|| codePoint === 0xFE_FF // Zero-width no-break space
-		) {
-			continue;
-		}
+		) {}
 
 		// Ignore combining characters

[Killed] ConditionalExpression
index.js:48:4
 
 		// Ignore combining characters
 		if (
-			(codePoint >= 0x3_00 && codePoint <= 0x3_6F) // Combining diacritical marks
-			|| (codePoint >= 0x1A_B0 && codePoint <= 0x1A_FF) // Combining diacritical marks extended
-			|| (codePoint >= 0x1D_C0 && codePoint <= 0x1D_FF) // Combining diacritical marks supplement
-			|| (codePoint >= 0x20_D0 && codePoint <= 0x20_FF) // Combining diacritical marks for symbols
-			|| (codePoint >= 0xFE_20 && codePoint <= 0xFE_2F) // Combining half marks
+			true // Combining half marks
 		) {
 			continue;
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main

[Killed] EqualityOperator
index.js:48:28
 
 		// Ignore combining characters
 		if (
-			(codePoint >= 0x3_00 && codePoint <= 0x3_6F) // Combining diacritical marks
+			(codePoint >= 0x3_00 && codePoint > 0x3_6F) // Combining diacritical marks
 			|| (codePoint >= 0x1A_B0 && codePoint <= 0x1A_FF) // Combining diacritical marks extended
 			|| (codePoint >= 0x1D_C0 && codePoint <= 0x1D_FF) // Combining diacritical marks supplement
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main

[Killed] ConditionalExpression
index.js:49:8
 		// Ignore combining characters
 		if (
 			(codePoint >= 0x3_00 && codePoint <= 0x3_6F) // Combining diacritical marks
-			|| (codePoint >= 0x1A_B0 && codePoint <= 0x1A_FF) // Combining diacritical marks extended
+			|| (true && codePoint <= 0x1A_FF) // Combining diacritical marks extended
 			|| (codePoint >= 0x1D_C0 && codePoint <= 0x1D_FF) // Combining diacritical marks supplement
 			|| (codePoint >= 0x20_D0 && codePoint <= 0x20_FF) // Combining diacritical marks for symbols
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main

[Killed] EqualityOperator
index.js:49:8
 		// Ignore combining characters
 		if (
 			(codePoint >= 0x3_00 && codePoint <= 0x3_6F) // Combining diacritical marks
-			|| (codePoint >= 0x1A_B0 && codePoint <= 0x1A_FF) // Combining diacritical marks extended
+			|| (codePoint < 0x1A_B0 && codePoint <= 0x1A_FF) // Combining diacritical marks extended
 			|| (codePoint >= 0x1D_C0 && codePoint <= 0x1D_FF) // Combining diacritical marks supplement
 			|| (codePoint >= 0x20_D0 && codePoint <= 0x20_FF) // Combining diacritical marks for symbols
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main

[Killed] EqualityOperator
index.js:50:8
 		if (
 			(codePoint >= 0x3_00 && codePoint <= 0x3_6F) // Combining diacritical marks
 			|| (codePoint >= 0x1A_B0 && codePoint <= 0x1A_FF) // Combining diacritical marks extended
-			|| (codePoint >= 0x1D_C0 && codePoint <= 0x1D_FF) // Combining diacritical marks supplement
+			|| (codePoint < 0x1D_C0 && codePoint <= 0x1D_FF) // Combining diacritical marks supplement
 			|| (codePoint >= 0x20_D0 && codePoint <= 0x20_FF) // Combining diacritical marks for symbols
 			|| (codePoint >= 0xFE_20 && codePoint <= 0xFE_2F) // Combining half marks
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main

[Killed] EqualityOperator
index.js:50:32
 		if (
 			(codePoint >= 0x3_00 && codePoint <= 0x3_6F) // Combining diacritical marks
 			|| (codePoint >= 0x1A_B0 && codePoint <= 0x1A_FF) // Combining diacritical marks extended
-			|| (codePoint >= 0x1D_C0 && codePoint <= 0x1D_FF) // Combining diacritical marks supplement
+			|| (codePoint >= 0x1D_C0 && codePoint > 0x1D_FF) // Combining diacritical marks supplement
 			|| (codePoint >= 0x20_D0 && codePoint <= 0x20_FF) // Combining diacritical marks for symbols
 			|| (codePoint >= 0xFE_20 && codePoint <= 0xFE_2F) // Combining half marks
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main

[Killed] EqualityOperator
index.js:51:32
 			(codePoint >= 0x3_00 && codePoint <= 0x3_6F) // Combining diacritical marks
 			|| (codePoint >= 0x1A_B0 && codePoint <= 0x1A_FF) // Combining diacritical marks extended
 			|| (codePoint >= 0x1D_C0 && codePoint <= 0x1D_FF) // Combining diacritical marks supplement
-			|| (codePoint >= 0x20_D0 && codePoint <= 0x20_FF) // Combining diacritical marks for symbols
+			|| (codePoint >= 0x20_D0 && codePoint > 0x20_FF) // Combining diacritical marks for symbols
 			|| (codePoint >= 0xFE_20 && codePoint <= 0xFE_2F) // Combining half marks
 		) {
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main

[Killed] EqualityOperator
index.js:51:8
 			(codePoint >= 0x3_00 && codePoint <= 0x3_6F) // Combining diacritical marks
 			|| (codePoint >= 0x1A_B0 && codePoint <= 0x1A_FF) // Combining diacritical marks extended
 			|| (codePoint >= 0x1D_C0 && codePoint <= 0x1D_FF) // Combining diacritical marks supplement
-			|| (codePoint >= 0x20_D0 && codePoint <= 0x20_FF) // Combining diacritical marks for symbols
+			|| (codePoint < 0x20_D0 && codePoint <= 0x20_FF) // Combining diacritical marks for symbols
 			|| (codePoint >= 0xFE_20 && codePoint <= 0xFE_2F) // Combining half marks
 		) {
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main

[Killed] EqualityOperator
index.js:52:8
 			|| (codePoint >= 0x1A_B0 && codePoint <= 0x1A_FF) // Combining diacritical marks extended
 			|| (codePoint >= 0x1D_C0 && codePoint <= 0x1D_FF) // Combining diacritical marks supplement
 			|| (codePoint >= 0x20_D0 && codePoint <= 0x20_FF) // Combining diacritical marks for symbols
-			|| (codePoint >= 0xFE_20 && codePoint <= 0xFE_2F) // Combining half marks
+			|| (codePoint < 0xFE_20 && codePoint <= 0xFE_2F) // Combining half marks
 		) {
 			continue;
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main

[Killed] ConditionalExpression
index.js:52:32
 			|| (codePoint >= 0x1A_B0 && codePoint <= 0x1A_FF) // Combining diacritical marks extended
 			|| (codePoint >= 0x1D_C0 && codePoint <= 0x1D_FF) // Combining diacritical marks supplement
 			|| (codePoint >= 0x20_D0 && codePoint <= 0x20_FF) // Combining diacritical marks for symbols
-			|| (codePoint >= 0xFE_20 && codePoint <= 0xFE_2F) // Combining half marks
+			|| (codePoint >= 0xFE_20 && true) // Combining half marks
 		) {
 			continue;
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main surrogate

[Killed] BlockStatement
index.js:53:5
 			|| (codePoint >= 0x1D_C0 && codePoint <= 0x1D_FF) // Combining diacritical marks supplement
 			|| (codePoint >= 0x20_D0 && codePoint <= 0x20_FF) // Combining diacritical marks for symbols
 			|| (codePoint >= 0xFE_20 && codePoint <= 0xFE_2F) // Combining half marks
-		) {
-			continue;
-		}
+		) {}
 
 		// Ignore surrogate pairs
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✔ main

[Killed] LogicalOperator
index.js:58:7
 		}
 
 		// Ignore surrogate pairs
-		if (codePoint >= 0xD8_00 && codePoint <= 0xDF_FF) {
+		if (codePoint >= 0xD8_00 || codePoint <= 0xDF_FF) {
 			continue;
 		}
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main

[Killed] ConditionalExpression
index.js:58:31
 		}
 
 		// Ignore surrogate pairs
-		if (codePoint >= 0xD8_00 && codePoint <= 0xDF_FF) {
+		if (codePoint >= 0xD8_00 && true) {
 			continue;
 		}
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main surrogate

[Killed] ConditionalExpression
index.js:63:31
 		}
 
 		// Ignore variation selectors
-		if (codePoint >= 0xFE_00 && codePoint <= 0xFE_0F) {
+		if (codePoint >= 0xFE_00 && true) {
 			continue;
 		}
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main surrogate

[Killed] LogicalOperator
index.js:63:7
 		}
 
 		// Ignore variation selectors
-		if (codePoint >= 0xFE_00 && codePoint <= 0xFE_0F) {
+		if (codePoint >= 0xFE_00 || codePoint <= 0xFE_0F) {
 			continue;
 		}
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main

[Killed] BlockStatement
index.js:68:55
 		}
 
 		// This covers some of the above cases, but we still keep them for performance reasons.
-		if (defaultIgnorableCodePointRegex.test(character)) {
-			continue;
-		}
+		if (defaultIgnorableCodePointRegex.test(character)) {}
 
 		// TODO: Use `/\p{RGI_Emoji}/v` when targeting Node.js 20.
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✔ main

[Killed] ConditionalExpression
index.js:68:7
 		}
 
 		// This covers some of the above cases, but we still keep them for performance reasons.
-		if (defaultIgnorableCodePointRegex.test(character)) {
+		if (true) {
 			continue;
 		}
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main

[Killed] ConditionalExpression
index.js:73:7
 		}
 
 		// TODO: Use `/\p{RGI_Emoji}/v` when targeting Node.js 20.
-		if (emojiRegex().test(character)) {
+		if (false) {
 			width += 2;
 			continue;
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main ↔️ default text presentation character rendered as emoji

[Killed] BlockStatement
index.js:73:37
 		}
 
 		// TODO: Use `/\p{RGI_Emoji}/v` when targeting Node.js 20.
-		if (emojiRegex().test(character)) {
-			width += 2;
-			continue;
-		}
+		if (emojiRegex().test(character)) {}
 
 		width += eastAsianWidth(codePoint, eastAsianWidthOptions);
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main ↔️ default text presentation character rendered as emoji

[Killed] AssignmentOperator
index.js:74:4
 
 		// TODO: Use `/\p{RGI_Emoji}/v` when targeting Node.js 20.
 		if (emojiRegex().test(character)) {
-			width += 2;
+			width -= 2;
 			continue;
 		}
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main ⌚ default emoji presentation character (Emoji_Presentation)

[Killed] AssignmentOperator
index.js:78:3
 			continue;
 		}
 
-		width += eastAsianWidth(codePoint, eastAsianWidthOptions);
+		width -= eastAsianWidth(codePoint, eastAsianWidthOptions);
 	}
 
killedBy: All tests
statusReason: > string-width@7.2.0 test
> ava




  ✘ [fail]: main
