[Survived] BlockStatement
browser.js:4:22
 /* eslint-env browser */
 /* eslint-disable n/no-unsupported-features/node-builtins */
 
-const level = (() => {
-	if (!('navigator' in globalThis)) {
-		return 0;
-	}
-
-	if (globalThis.navigator.userAgentData) {
-		const brand = navigator.userAgentData.brands.find(({brand}) => brand === 'Chromium');
-		if (brand?.version > 93) {
-			return 3;
-		}
-	}
-
-	if (/\b(Chrome|Chromium)\//.test(globalThis.navigator.userAgent)) {
-		return 1;
-	}
-
-	return 0;
-})();
+const level = (() => {})();
 
 const colorSupport = level !== 0 && {

[Survived] BlockStatement
browser.js:5:36
 /* eslint-disable n/no-unsupported-features/node-builtins */
 
 const level = (() => {
-	if (!('navigator' in globalThis)) {
-		return 0;
-	}
+	if (!('navigator' in globalThis)) {}
 
 	if (globalThis.navigator.userAgentData) {

[Survived] ConditionalExpression
browser.js:5:6
 /* eslint-disable n/no-unsupported-features/node-builtins */
 
 const level = (() => {
-	if (!('navigator' in globalThis)) {
+	if (true) {
 		return 0;
 	}

[Survived] BlockStatement
browser.js:9:42
 		return 0;
 	}
 
-	if (globalThis.navigator.userAgentData) {
-		const brand = navigator.userAgentData.brands.find(({brand}) => brand === 'Chromium');
-		if (brand?.version > 93) {
-			return 3;
-		}
-	}
+	if (globalThis.navigator.userAgentData) {}
 
 	if (/\b(Chrome|Chromium)\//.test(globalThis.navigator.userAgent)) {

[Survived] ConditionalExpression
browser.js:9:6
 		return 0;
 	}
 
-	if (globalThis.navigator.userAgentData) {
+	if (false) {
 		const brand = navigator.userAgentData.brands.find(({brand}) => brand === 'Chromium');
 		if (brand?.version > 93) {

[Survived] ConditionalExpression
browser.js:10:66
 	}
 
 	if (globalThis.navigator.userAgentData) {
-		const brand = navigator.userAgentData.brands.find(({brand}) => brand === 'Chromium');
+		const brand = navigator.userAgentData.brands.find(({brand}) => false);
 		if (brand?.version > 93) {
 			return 3;

[Survived] ArrowFunction
browser.js:10:53
 	}
 
 	if (globalThis.navigator.userAgentData) {
-		const brand = navigator.userAgentData.brands.find(({brand}) => brand === 'Chromium');
+		const brand = navigator.userAgentData.brands.find(() => undefined);
 		if (brand?.version > 93) {
 			return 3;

[Survived] ConditionalExpression
browser.js:11:7
 
 	if (globalThis.navigator.userAgentData) {
 		const brand = navigator.userAgentData.brands.find(({brand}) => brand === 'Chromium');
-		if (brand?.version > 93) {
+		if (false) {
 			return 3;
 		}

[Survived] BlockStatement
browser.js:11:28
 
 	if (globalThis.navigator.userAgentData) {
 		const brand = navigator.userAgentData.brands.find(({brand}) => brand === 'Chromium');
-		if (brand?.version > 93) {
-			return 3;
-		}
+		if (brand?.version > 93) {}
 	}
 

[Survived] ConditionalExpression
browser.js:16:6
 		}
 	}
 
-	if (/\b(Chrome|Chromium)\//.test(globalThis.navigator.userAgent)) {
+	if (false) {
 		return 1;
 	}

[Timeout] ConditionalExpression
browser.js:16:6
 		}
 	}
 
-	if (/\b(Chrome|Chromium)\//.test(globalThis.navigator.userAgent)) {
+	if (true) {
 		return 1;
 	}

[Survived] EqualityOperator
browser.js:23:22
 	return 0;
 })();
 
-const colorSupport = level !== 0 && {
+const colorSupport = level === 0 && {
 	level,
 	hasBasic: true,

[Survived] ConditionalExpression
browser.js:23:22
 	return 0;
 })();
 
-const colorSupport = level !== 0 && {
-	level,
-	hasBasic: true,
-	has256: level >= 2,
-	has16m: level >= 3,
-};
+const colorSupport = true;
 
 const supportsColor = {

[Survived] BooleanLiteral
browser.js:25:12
 
 const colorSupport = level !== 0 && {
 	level,
-	hasBasic: true,
+	hasBasic: false,
 	has256: level >= 2,
 	has16m: level >= 3,

[Survived] EqualityOperator
browser.js:26:10
 const colorSupport = level !== 0 && {
 	level,
 	hasBasic: true,
-	has256: level >= 2,
+	has256: level < 2,
 	has16m: level >= 3,
 };

[Survived] ConditionalExpression
browser.js:26:10
 const colorSupport = level !== 0 && {
 	level,
 	hasBasic: true,
-	has256: level >= 2,
+	has256: false,
 	has16m: level >= 3,
 };

[Survived] EqualityOperator
browser.js:27:10
 	level,
 	hasBasic: true,
 	has256: level >= 2,
-	has16m: level >= 3,
+	has16m: level > 3,
 };
 

[Survived] ConditionalExpression
browser.js:27:10
 	level,
 	hasBasic: true,
 	has256: level >= 2,
-	has16m: level >= 3,
+	has16m: true,
 };
 

[Survived] ObjectLiteral
browser.js:30:23
 	has16m: level >= 3,
 };
 
-const supportsColor = {
-	stdout: colorSupport,
-	stderr: colorSupport,
-};
+const supportsColor = {};
 
 export default supportsColor;
