[Survived] BlockStatement
index.js:7:86
 
 // From: https://github.com/sindresorhus/has-flag/blob/main/index.js
 /// function hasFlag(flag, argv = globalThis.Deno?.args ?? process.argv) {
-function hasFlag(flag, argv = globalThis.Deno ? globalThis.Deno.args : process.argv) {
-	const prefix = flag.startsWith('-') ? '' : (flag.length === 1 ? '-' : '--');
-	const position = argv.indexOf(prefix + flag);
-	const terminatorPosition = argv.indexOf('--');
-	return position !== -1 && (terminatorPosition === -1 || position < terminatorPosition);
-}
+function hasFlag(flag, argv = globalThis.Deno ? globalThis.Deno.args : process.argv) {}
 
 const {env} = process;

[Survived] MethodExpression
index.js:8:17
 // From: https://github.com/sindresorhus/has-flag/blob/main/index.js
 /// function hasFlag(flag, argv = globalThis.Deno?.args ?? process.argv) {
 function hasFlag(flag, argv = globalThis.Deno ? globalThis.Deno.args : process.argv) {
-	const prefix = flag.startsWith('-') ? '' : (flag.length === 1 ? '-' : '--');
+	const prefix = flag.endsWith('-') ? '' : (flag.length === 1 ? '-' : '--');
 	const position = argv.indexOf(prefix + flag);
 	const terminatorPosition = argv.indexOf('--');

[Survived] ConditionalExpression
index.js:8:46
 // From: https://github.com/sindresorhus/has-flag/blob/main/index.js
 /// function hasFlag(flag, argv = globalThis.Deno?.args ?? process.argv) {
 function hasFlag(flag, argv = globalThis.Deno ? globalThis.Deno.args : process.argv) {
-	const prefix = flag.startsWith('-') ? '' : (flag.length === 1 ? '-' : '--');
+	const prefix = flag.startsWith('-') ? '' : (true ? '-' : '--');
 	const position = argv.indexOf(prefix + flag);
 	const terminatorPosition = argv.indexOf('--');

[Survived] StringLiteral
index.js:10:42
 function hasFlag(flag, argv = globalThis.Deno ? globalThis.Deno.args : process.argv) {
 	const prefix = flag.startsWith('-') ? '' : (flag.length === 1 ? '-' : '--');
 	const position = argv.indexOf(prefix + flag);
-	const terminatorPosition = argv.indexOf('--');
+	const terminatorPosition = argv.indexOf("");
 	return position !== -1 && (terminatorPosition === -1 || position < terminatorPosition);
 }

[Survived] ConditionalExpression
index.js:18:2
 
 let flagForceColor;
 if (
-	hasFlag('no-color')
-	|| hasFlag('no-colors')
-	|| hasFlag('color=false')
-	|| hasFlag('color=never')
+	false
 ) {
 	flagForceColor = 0;

[Survived] ConditionalExpression
index.js:18:2
 
 let flagForceColor;
 if (
-	hasFlag('no-color')
-	|| hasFlag('no-colors')
-	|| hasFlag('color=false')
+	false
 	|| hasFlag('color=never')
 ) {

[Survived] BlockStatement
index.js:22:3
 	|| hasFlag('no-colors')
 	|| hasFlag('color=false')
 	|| hasFlag('color=never')
-) {
-	flagForceColor = 0;
-} else if (
+) {} else if (
 	hasFlag('color')
 	|| hasFlag('colors')

[Survived] ConditionalExpression
index.js:25:2
 ) {
 	flagForceColor = 0;
 } else if (
-	hasFlag('color')
-	|| hasFlag('colors')
-	|| hasFlag('color=true')
-	|| hasFlag('color=always')
+	true
 ) {
 	flagForceColor = 1;

[Survived] ConditionalExpression
index.js:25:2
 ) {
 	flagForceColor = 0;
 } else if (
-	hasFlag('color')
-	|| hasFlag('colors')
-	|| hasFlag('color=true')
-	|| hasFlag('color=always')
+	false
 ) {
 	flagForceColor = 1;

[Survived] StringLiteral
index.js:26:13
 	flagForceColor = 0;
 } else if (
 	hasFlag('color')
-	|| hasFlag('colors')
+	|| hasFlag("")
 	|| hasFlag('color=true')
 	|| hasFlag('color=always')

[Survived] BlockStatement
index.js:29:3
 	|| hasFlag('colors')
 	|| hasFlag('color=true')
 	|| hasFlag('color=always')
-) {
-	flagForceColor = 1;
-}
+) {}
 
 function envForceColor() {

[Survived] BlockStatement
index.js:33:26
 	flagForceColor = 1;
 }
 
-function envForceColor() {
-	if (!('FORCE_COLOR' in env)) {
-		return;
-	}
-
-	if (env.FORCE_COLOR === 'true') {
-		return 1;
-	}
-
-	if (env.FORCE_COLOR === 'false') {
-		return 0;
-	}
-
-	if (env.FORCE_COLOR.length === 0) {
-		return 1;
-	}
-
-	const level = Math.min(Number.parseInt(env.FORCE_COLOR, 10), 3);
-
-	if (![0, 1, 2, 3].includes(level)) {
-		return;
-	}
-
-	return level;
-}
+function envForceColor() {}
 
 function translateLevel(level) {

[Survived] ConditionalExpression
index.js:34:6
 }
 
 function envForceColor() {
-	if (!('FORCE_COLOR' in env)) {
+	if (true) {
 		return;
 	}

[Survived] BooleanLiteral
index.js:34:6
 }
 
 function envForceColor() {
-	if (!('FORCE_COLOR' in env)) {
+	if ('FORCE_COLOR' in env) {
 		return;
 	}

[Survived] ConditionalExpression
index.js:38:6
 		return;
 	}
 
-	if (env.FORCE_COLOR === 'true') {
+	if (true) {
 		return 1;
 	}

[Survived] ConditionalExpression
index.js:38:6
 		return;
 	}
 
-	if (env.FORCE_COLOR === 'true') {
+	if (false) {
 		return 1;
 	}

[Survived] EqualityOperator
index.js:42:6
 		return 1;
 	}
 
-	if (env.FORCE_COLOR === 'false') {
+	if (env.FORCE_COLOR !== 'false') {
 		return 0;
 	}

[Survived] ConditionalExpression
index.js:42:6
 		return 1;
 	}
 
-	if (env.FORCE_COLOR === 'false') {
+	if (false) {
 		return 0;
 	}

[Survived] ConditionalExpression
index.js:46:6
 		return 0;
 	}
 
-	if (env.FORCE_COLOR.length === 0) {
+	if (true) {
 		return 1;
 	}

[Survived] EqualityOperator
index.js:46:6
 		return 0;
 	}
 
-	if (env.FORCE_COLOR.length === 0) {
+	if (env.FORCE_COLOR.length !== 0) {
 		return 1;
 	}

[Survived] MethodExpression
index.js:50:16
 		return 1;
 	}
 
-	const level = Math.min(Number.parseInt(env.FORCE_COLOR, 10), 3);
+	const level = Math.max(Number.parseInt(env.FORCE_COLOR, 10), 3);
 
 	if (![0, 1, 2, 3].includes(level)) {

[Survived] ConditionalExpression
index.js:52:6
 
 	const level = Math.min(Number.parseInt(env.FORCE_COLOR, 10), 3);
 
-	if (![0, 1, 2, 3].includes(level)) {
+	if (false) {
 		return;
 	}

[Survived] ConditionalExpression
index.js:52:6
 
 	const level = Math.min(Number.parseInt(env.FORCE_COLOR, 10), 3);
 
-	if (![0, 1, 2, 3].includes(level)) {
+	if (true) {
 		return;
 	}

[Survived] BlockStatement
index.js:59:32
 	return level;
 }
 
-function translateLevel(level) {
-	if (level === 0) {
-		return false;
-	}
-
-	return {
-		level,
-		hasBasic: true,
-		has256: level >= 2,
-		has16m: level >= 3,
-	};
-}
+function translateLevel(level) {}
 
 function _supportsColor(haveStream, {streamIsTTY, sniffFlags = true} = {}) {

[Survived] ConditionalExpression
index.js:60:6
 }
 
 function translateLevel(level) {
-	if (level === 0) {
+	if (true) {
 		return false;
 	}

[Survived] EqualityOperator
index.js:60:6
 }
 
 function translateLevel(level) {
-	if (level === 0) {
+	if (level !== 0) {
 		return false;
 	}

[Survived] BooleanLiteral
index.js:61:10
 
 function translateLevel(level) {
 	if (level === 0) {
-		return false;
+		return true;
 	}
 

[Survived] ConditionalExpression
index.js:67:11
 	return {
 		level,
 		hasBasic: true,
-		has256: level >= 2,
+		has256: true,
 		has16m: level >= 3,
 	};

[Survived] EqualityOperator
index.js:68:11
 		level,
 		hasBasic: true,
 		has256: level >= 2,
-		has16m: level >= 3,
+		has16m: level < 3,
 	};
 }

[Survived] BooleanLiteral
index.js:72:64
 	};
 }
 
-function _supportsColor(haveStream, {streamIsTTY, sniffFlags = true} = {}) {
+function _supportsColor(haveStream, {streamIsTTY, sniffFlags = false} = {}) {
 	const noFlagForceColor = envForceColor();
 	if (noFlagForceColor !== undefined) {

[Survived] EqualityOperator
index.js:74:6
 
 function _supportsColor(haveStream, {streamIsTTY, sniffFlags = true} = {}) {
 	const noFlagForceColor = envForceColor();
-	if (noFlagForceColor !== undefined) {
+	if (noFlagForceColor === undefined) {
 		flagForceColor = noFlagForceColor;
 	}

[Survived] BlockStatement
index.js:74:38
 
 function _supportsColor(haveStream, {streamIsTTY, sniffFlags = true} = {}) {
 	const noFlagForceColor = envForceColor();
-	if (noFlagForceColor !== undefined) {
-		flagForceColor = noFlagForceColor;
-	}
+	if (noFlagForceColor !== undefined) {}
 
 	const forceColor = sniffFlags ? flagForceColor : noFlagForceColor;

[Survived] ConditionalExpression
index.js:80:6
 
 	const forceColor = sniffFlags ? flagForceColor : noFlagForceColor;
 
-	if (forceColor === 0) {
+	if (false) {
 		return 0;
 	}

[Survived] BlockStatement
index.js:80:24
 
 	const forceColor = sniffFlags ? flagForceColor : noFlagForceColor;
 
-	if (forceColor === 0) {
-		return 0;
-	}
+	if (forceColor === 0) {}
 
 	if (sniffFlags) {

[Survived] ConditionalExpression
index.js:84:6
 		return 0;
 	}
 
-	if (sniffFlags) {
+	if (false) {
 		if (hasFlag('color=16m')
 			|| hasFlag('color=full')

[Survived] ConditionalExpression
index.js:84:6
 		return 0;
 	}
 
-	if (sniffFlags) {
+	if (true) {
 		if (hasFlag('color=16m')
 			|| hasFlag('color=full')

[Survived] ConditionalExpression
index.js:85:7
 	}
 
 	if (sniffFlags) {
-		if (hasFlag('color=16m')
-			|| hasFlag('color=full')
-			|| hasFlag('color=truecolor')) {
+		if (true) {
 			return 3;
 		}

[Survived] ConditionalExpression
index.js:85:7
 	}
 
 	if (sniffFlags) {
-		if (hasFlag('color=16m')
-			|| hasFlag('color=full')
-			|| hasFlag('color=truecolor')) {
+		if (false) {
 			return 3;
 		}

[Survived] StringLiteral
index.js:86:15
 
 	if (sniffFlags) {
 		if (hasFlag('color=16m')
-			|| hasFlag('color=full')
+			|| hasFlag("")
 			|| hasFlag('color=truecolor')) {
 			return 3;

[Survived] BlockStatement
index.js:87:35
 	if (sniffFlags) {
 		if (hasFlag('color=16m')
 			|| hasFlag('color=full')
-			|| hasFlag('color=truecolor')) {
-			return 3;
-		}
+			|| hasFlag('color=truecolor')) {}
 
 		if (hasFlag('color=256')) {

[Survived] BlockStatement
index.js:91:29
 			return 3;
 		}
 
-		if (hasFlag('color=256')) {
-			return 2;
-		}
+		if (hasFlag('color=256')) {}
 	}
 

[Survived] ConditionalExpression
index.js:91:7
 			return 3;
 		}
 
-		if (hasFlag('color=256')) {
+		if (false) {
 			return 2;
 		}

[Survived] ConditionalExpression
index.js:98:6
 
 	// Check for Azure DevOps pipelines.
 	// Has to be above the `!streamIsTTY` check.
-	if ('TF_BUILD' in env && 'AGENT_NAME' in env) {
+	if (false) {
 		return 1;
 	}

[Survived] LogicalOperator
index.js:98:6
 
 	// Check for Azure DevOps pipelines.
 	// Has to be above the `!streamIsTTY` check.
-	if ('TF_BUILD' in env && 'AGENT_NAME' in env) {
+	if ('TF_BUILD' in env || 'AGENT_NAME' in env) {
 		return 1;
 	}

[Survived] BlockStatement
index.js:102:62
 		return 1;
 	}
 
-	if (haveStream && !streamIsTTY && forceColor === undefined) {
-		return 0;
-	}
+	if (haveStream && !streamIsTTY && forceColor === undefined) {}
 
 	const min = forceColor || 0;

[Survived] ConditionalExpression
index.js:102:6
 		return 1;
 	}
 
-	if (haveStream && !streamIsTTY && forceColor === undefined) {
+	if (false) {
 		return 0;
 	}

[Survived] ConditionalExpression
index.js:106:14
 		return 0;
 	}
 
-	const min = forceColor || 0;
+	const min = false;
 
 	if (env.TERM === 'dumb') {

[Survived] LogicalOperator
index.js:106:14
 		return 0;
 	}
 
-	const min = forceColor || 0;
+	const min = forceColor && 0;
 
 	if (env.TERM === 'dumb') {

[Survived] BlockStatement
index.js:108:27
 
 	const min = forceColor || 0;
 
-	if (env.TERM === 'dumb') {
-		return min;
-	}
+	if (env.TERM === 'dumb') {}
 
 	if (process.platform === 'win32') {

[Survived] EqualityOperator
index.js:108:6
 
 	const min = forceColor || 0;
 
-	if (env.TERM === 'dumb') {
+	if (env.TERM !== 'dumb') {
 		return min;
 	}

[Survived] ConditionalExpression
index.js:112:6
 		return min;
 	}
 
-	if (process.platform === 'win32') {
+	if (false) {
 		// Windows 10 build 10586 is the first Windows release that supports 256 colors.
 		// Windows 10 build 14931 is the first release that supports 16m/TrueColor.

[Survived] BlockStatement
index.js:112:36
 		return min;
 	}
 
-	if (process.platform === 'win32') {
-		// Windows 10 build 10586 is the first Windows release that supports 256 colors.
-		// Windows 10 build 14931 is the first release that supports 16m/TrueColor.
-		const osRelease = os.release().split('.');
-		if (
-			Number(osRelease[0]) >= 10
-			&& Number(osRelease[2]) >= 10_586
-		) {
-			return Number(osRelease[2]) >= 14_931 ? 3 : 2;
-		}
-
-		return 1;
-	}
+	if (process.platform === 'win32') {}
 
 	if ('CI' in env) {

[Survived] ConditionalExpression
index.js:117:4
 		// Windows 10 build 14931 is the first release that supports 16m/TrueColor.
 		const osRelease = os.release().split('.');
 		if (
-			Number(osRelease[0]) >= 10
-			&& Number(osRelease[2]) >= 10_586
+			true
 		) {
 			return Number(osRelease[2]) >= 14_931 ? 3 : 2;

[Survived] ConditionalExpression
index.js:117:4
 		// Windows 10 build 14931 is the first release that supports 16m/TrueColor.
 		const osRelease = os.release().split('.');
 		if (
-			Number(osRelease[0]) >= 10
+			true
 			&& Number(osRelease[2]) >= 10_586
 		) {

[Survived] EqualityOperator
index.js:118:7
 		const osRelease = os.release().split('.');
 		if (
 			Number(osRelease[0]) >= 10
-			&& Number(osRelease[2]) >= 10_586
+			&& Number(osRelease[2]) < 10_586
 		) {
 			return Number(osRelease[2]) >= 14_931 ? 3 : 2;

[Survived] ConditionalExpression
index.js:118:7
 		const osRelease = os.release().split('.');
 		if (
 			Number(osRelease[0]) >= 10
-			&& Number(osRelease[2]) >= 10_586
+			&& true
 		) {
 			return Number(osRelease[2]) >= 14_931 ? 3 : 2;

[Survived] BlockStatement
index.js:119:5
 		if (
 			Number(osRelease[0]) >= 10
 			&& Number(osRelease[2]) >= 10_586
-		) {
-			return Number(osRelease[2]) >= 14_931 ? 3 : 2;
-		}
+		) {}
 
 		return 1;

[Survived] ConditionalExpression
index.js:120:11
 			Number(osRelease[0]) >= 10
 			&& Number(osRelease[2]) >= 10_586
 		) {
-			return Number(osRelease[2]) >= 14_931 ? 3 : 2;
+			return false ? 3 : 2;
 		}
 

[Survived] EqualityOperator
index.js:120:11
 			Number(osRelease[0]) >= 10
 			&& Number(osRelease[2]) >= 10_586
 		) {
-			return Number(osRelease[2]) >= 14_931 ? 3 : 2;
+			return Number(osRelease[2]) > 14_931 ? 3 : 2;
 		}
 

[Survived] BlockStatement
index.js:126:19
 		return 1;
 	}
 
-	if ('CI' in env) {
-		if (['GITHUB_ACTIONS', 'GITEA_ACTIONS', 'CIRCLECI'].some(key => key in env)) {
-			return 3;
-		}
-
-		if (['TRAVIS', 'APPVEYOR', 'GITLAB_CI', 'BUILDKITE', 'DRONE'].some(sign => sign in env) || env.CI_NAME === 'codeship') {
-			return 1;
-		}
-
-		return min;
-	}
+	if ('CI' in env) {}
 
 	if ('TEAMCITY_VERSION' in env) {

[Survived] ConditionalExpression
index.js:126:6
 		return 1;
 	}
 
-	if ('CI' in env) {
+	if (false) {
 		if (['GITHUB_ACTIONS', 'GITEA_ACTIONS', 'CIRCLECI'].some(key => key in env)) {
 			return 3;

[Survived] BlockStatement
index.js:127:80
 	}
 
 	if ('CI' in env) {
-		if (['GITHUB_ACTIONS', 'GITEA_ACTIONS', 'CIRCLECI'].some(key => key in env)) {
-			return 3;
-		}
+		if (['GITHUB_ACTIONS', 'GITEA_ACTIONS', 'CIRCLECI'].some(key => key in env)) {}
 
 		if (['TRAVIS', 'APPVEYOR', 'GITLAB_CI', 'BUILDKITE', 'DRONE'].some(sign => sign in env) || env.CI_NAME === 'codeship') {

[Survived] ConditionalExpression
index.js:127:7
 	}
 
 	if ('CI' in env) {
-		if (['GITHUB_ACTIONS', 'GITEA_ACTIONS', 'CIRCLECI'].some(key => key in env)) {
+		if (false) {
 			return 3;
 		}

[Survived] BlockStatement
index.js:131:122
 			return 3;
 		}
 
-		if (['TRAVIS', 'APPVEYOR', 'GITLAB_CI', 'BUILDKITE', 'DRONE'].some(sign => sign in env) || env.CI_NAME === 'codeship') {
-			return 1;
-		}
+		if (['TRAVIS', 'APPVEYOR', 'GITLAB_CI', 'BUILDKITE', 'DRONE'].some(sign => sign in env) || env.CI_NAME === 'codeship') {}
 
 		return min;

[Survived] ArrowFunction
index.js:131:70
 			return 3;
 		}
 
-		if (['TRAVIS', 'APPVEYOR', 'GITLAB_CI', 'BUILDKITE', 'DRONE'].some(sign => sign in env) || env.CI_NAME === 'codeship') {
+		if (['TRAVIS', 'APPVEYOR', 'GITLAB_CI', 'BUILDKITE', 'DRONE'].some(() => undefined) || env.CI_NAME === 'codeship') {
 			return 1;
 		}

[Survived] ConditionalExpression
index.js:138:6
 		return min;
 	}
 
-	if ('TEAMCITY_VERSION' in env) {
+	if (true) {
 		return /^(9\.(0*[1-9]\d*)\.|\d{2,}\.)/.test(env.TEAMCITY_VERSION) ? 1 : 0;
 	}

[Survived] ConditionalExpression
index.js:138:6
 		return min;
 	}
 
-	if ('TEAMCITY_VERSION' in env) {
+	if (false) {
 		return /^(9\.(0*[1-9]\d*)\.|\d{2,}\.)/.test(env.TEAMCITY_VERSION) ? 1 : 0;
 	}

[Survived] Regex
index.js:139:10
 	}
 
 	if ('TEAMCITY_VERSION' in env) {
-		return /^(9\.(0*[1-9]\d*)\.|\d{2,}\.)/.test(env.TEAMCITY_VERSION) ? 1 : 0;
+		return /^(9\.(0*[1-9]\d*)\.|\D{2,}\.)/.test(env.TEAMCITY_VERSION) ? 1 : 0;
 	}
 

[Survived] Regex
index.js:139:10
 	}
 
 	if ('TEAMCITY_VERSION' in env) {
-		return /^(9\.(0*[1-9]\d*)\.|\d{2,}\.)/.test(env.TEAMCITY_VERSION) ? 1 : 0;
+		return /^(9\.(0*[1-9]\d*)\.|\d\.)/.test(env.TEAMCITY_VERSION) ? 1 : 0;
 	}
 

[Survived] ConditionalExpression
index.js:142:6
 		return /^(9\.(0*[1-9]\d*)\.|\d{2,}\.)/.test(env.TEAMCITY_VERSION) ? 1 : 0;
 	}
 
-	if (env.COLORTERM === 'truecolor') {
+	if (true) {
 		return 3;
 	}

[Survived] EqualityOperator
index.js:142:6
 		return /^(9\.(0*[1-9]\d*)\.|\d{2,}\.)/.test(env.TEAMCITY_VERSION) ? 1 : 0;
 	}
 
-	if (env.COLORTERM === 'truecolor') {
+	if (env.COLORTERM !== 'truecolor') {
 		return 3;
 	}

[Survived] ConditionalExpression
index.js:146:6
 		return 3;
 	}
 
-	if (env.TERM === 'xterm-kitty') {
+	if (true) {
 		return 3;
 	}

[Survived] EqualityOperator
index.js:146:6
 		return 3;
 	}
 
-	if (env.TERM === 'xterm-kitty') {
+	if (env.TERM !== 'xterm-kitty') {
 		return 3;
 	}

[Timeout] ConditionalExpression
index.js:150:6
 		return 3;
 	}
 
-	if ('TERM_PROGRAM' in env) {
+	if (true) {
 		const version = Number.parseInt((env.TERM_PROGRAM_VERSION || '').split('.')[0], 10);
 

[Timeout] ConditionalExpression
index.js:150:6
 		return 3;
 	}
 
-	if ('TERM_PROGRAM' in env) {
+	if (false) {
 		const version = Number.parseInt((env.TERM_PROGRAM_VERSION || '').split('.')[0], 10);
 

[Survived] LogicalOperator
index.js:151:36
 	}
 
 	if ('TERM_PROGRAM' in env) {
-		const version = Number.parseInt((env.TERM_PROGRAM_VERSION || '').split('.')[0], 10);
+		const version = Number.parseInt((env.TERM_PROGRAM_VERSION && '').split('.')[0], 10);
 
 		switch (env.TERM_PROGRAM) {

[Timeout] ConditionalExpression
index.js:151:36
 	}
 
 	if ('TERM_PROGRAM' in env) {
-		const version = Number.parseInt((env.TERM_PROGRAM_VERSION || '').split('.')[0], 10);
+		const version = Number.parseInt((true).split('.')[0], 10);
 
 		switch (env.TERM_PROGRAM) {

[Survived] BlockStatement
index.js:154:22
 		const version = Number.parseInt((env.TERM_PROGRAM_VERSION || '').split('.')[0], 10);
 
 		switch (env.TERM_PROGRAM) {
-			case 'iTerm.app': {
-				return version >= 3 ? 3 : 2;
-			}
+			case 'iTerm.app': {}
 
 			case 'Apple_Terminal': {

[Survived] ConditionalExpression
index.js:154:4
 		const version = Number.parseInt((env.TERM_PROGRAM_VERSION || '').split('.')[0], 10);
 
 		switch (env.TERM_PROGRAM) {
-			case 'iTerm.app': {
-				return version >= 3 ? 3 : 2;
-			}
+			case 'iTerm.app':
 
 			case 'Apple_Terminal': {

[Survived] ConditionalExpression
index.js:155:12
 
 		switch (env.TERM_PROGRAM) {
 			case 'iTerm.app': {
-				return version >= 3 ? 3 : 2;
+				return true ? 3 : 2;
 			}
 

[Survived] EqualityOperator
index.js:155:12
 
 		switch (env.TERM_PROGRAM) {
 			case 'iTerm.app': {
-				return version >= 3 ? 3 : 2;
+				return version > 3 ? 3 : 2;
 			}
 

[Timeout] BlockStatement
index.js:158:27
 				return version >= 3 ? 3 : 2;
 			}
 
-			case 'Apple_Terminal': {
-				return 2;
-			}
+			case 'Apple_Terminal': {}
 			// No default
 		}

[Timeout] ConditionalExpression
index.js:158:4
 				return version >= 3 ? 3 : 2;
 			}
 
-			case 'Apple_Terminal': {
-				return 2;
-			}
+			case 'Apple_Terminal':
+// No default
 			// No default
 		}

[Survived] BlockStatement
index.js:165:39
 		}
 	}
 
-	if (/-256(color)?$/i.test(env.TERM)) {
-		return 2;
-	}
+	if (/-256(color)?$/i.test(env.TERM)) {}
 
 	if (/^screen|^xterm|^vt100|^vt220|^rxvt|color|ansi|cygwin|linux/i.test(env.TERM)) {

[Survived] ConditionalExpression
index.js:165:6
 		}
 	}
 
-	if (/-256(color)?$/i.test(env.TERM)) {
+	if (true) {
 		return 2;
 	}

[Survived] BlockStatement
index.js:169:84
 		return 2;
 	}
 
-	if (/^screen|^xterm|^vt100|^vt220|^rxvt|color|ansi|cygwin|linux/i.test(env.TERM)) {
-		return 1;
-	}
+	if (/^screen|^xterm|^vt100|^vt220|^rxvt|color|ansi|cygwin|linux/i.test(env.TERM)) {}
 
 	if ('COLORTERM' in env) {

[Survived] ConditionalExpression
index.js:169:6
 		return 2;
 	}
 
-	if (/^screen|^xterm|^vt100|^vt220|^rxvt|color|ansi|cygwin|linux/i.test(env.TERM)) {
+	if (false) {
 		return 1;
 	}

[Survived] ConditionalExpression
index.js:173:6
 		return 1;
 	}
 
-	if ('COLORTERM' in env) {
+	if (false) {
 		return 1;
 	}

[Survived] BlockStatement
index.js:173:26
 		return 1;
 	}
 
-	if ('COLORTERM' in env) {
-		return 1;
-	}
+	if ('COLORTERM' in env) {}
 
 	return min;

[Survived] BlockStatement
index.js:180:59
 	return min;
 }
 
-export function createSupportsColor(stream, options = {}) {
-	const level = _supportsColor(stream, {
-		streamIsTTY: stream && stream.isTTY,
-		...options,
-	});
-
-	return translateLevel(level);
-}
+export function createSupportsColor(stream, options = {}) {}
 
 const supportsColor = {

[Survived] ObjectLiteral
index.js:181:39
 }
 
 export function createSupportsColor(stream, options = {}) {
-	const level = _supportsColor(stream, {
-		streamIsTTY: stream && stream.isTTY,
-		...options,
-	});
+	const level = _supportsColor(stream, {});
 
 	return translateLevel(level);

[Survived] ConditionalExpression
index.js:182:16
 
 export function createSupportsColor(stream, options = {}) {
 	const level = _supportsColor(stream, {
-		streamIsTTY: stream && stream.isTTY,
+		streamIsTTY: false,
 		...options,
 	});

[Survived] ConditionalExpression
index.js:182:16
 
 export function createSupportsColor(stream, options = {}) {
 	const level = _supportsColor(stream, {
-		streamIsTTY: stream && stream.isTTY,
+		streamIsTTY: true,
 		...options,
 	});

[Survived] ObjectLiteral
index.js:189:23
 	return translateLevel(level);
 }
 
-const supportsColor = {
-	stdout: createSupportsColor({isTTY: tty.isatty(1)}),
-	stderr: createSupportsColor({isTTY: tty.isatty(2)}),
-};
+const supportsColor = {};
 
 export default supportsColor;

[Survived] ObjectLiteral
index.js:190:30
 }
 
 const supportsColor = {
-	stdout: createSupportsColor({isTTY: tty.isatty(1)}),
+	stdout: createSupportsColor({}),
 	stderr: createSupportsColor({isTTY: tty.isatty(2)}),
 };

[Survived] ObjectLiteral
index.js:191:30
 
 const supportsColor = {
 	stdout: createSupportsColor({isTTY: tty.isatty(1)}),
-	stderr: createSupportsColor({isTTY: tty.isatty(2)}),
+	stderr: createSupportsColor({}),
 };
 
