[Timeout] StringLiteral
src/index.js:198:11
  */
 function wdm(compiler, options = {}) {
   validate(/** @type {Schema} */ (schema), options, {
-    name: "Dev Middleware",
+    name: "",
     baseDataPath: "options",
   });

[Timeout] ConditionalExpression
src/index.js:204:7
 
   const { mimeTypes } = options;
 
-  if (mimeTypes) {
+  if (false) {
     const { types } = mime;
 

[Timeout] ConditionalExpression
src/index.js:204:7
 
   const { mimeTypes } = options;
 
-  if (mimeTypes) {
+  if (true) {
     const { types } = mime;
 

[Timeout] ObjectLiteral
src/index.js:210:18
     // mimeTypes from user provided options should take priority
     // over existing, known types
     // @ts-expect-error
-    mime.types = { ...types, ...mimeTypes };
+    mime.types = {};
   }
 

[Timeout] BooleanLiteral
src/index.js:217:12
    * @type {WithOptional<Context<RequestInternal, ResponseInternal>, "watching" | "outputFileSystem">}
    */
   const context = {
-    state: false,
+    state: true,
 
     stats: undefined,

[Timeout] StringLiteral
src/index.js:223:46
     callbacks: [],
     options,
     compiler,
-    logger: compiler.getInfrastructureLogger("webpack-dev-middleware"),
+    logger: compiler.getInfrastructureLogger(""),
   };
 

[Timeout] ConditionalExpression
src/index.js:228:7
 
   setupHooks(context);
 
-  if (options.writeToDisk) {
+  if (false) {
     setupWriteToDisk(context);
   }

[Timeout] ConditionalExpression
src/index.js:228:7
 
   setupHooks(context);
 
-  if (options.writeToDisk) {
+  if (true) {
     setupWriteToDisk(context);
   }

[Timeout] BlockStatement
src/index.js:235:60
   setupOutputFileSystem(context);
 
   // Start watching
-  if (/** @type {Compiler} */ (context.compiler).watching) {
-    context.watching = /** @type {Compiler} */ (context.compiler).watching;
-  } else {
+  if (/** @type {Compiler} */ (context.compiler).watching) {} else {
     /**
      * @param {Error | null | undefined} error error

[Timeout] ConditionalExpression
src/index.js:235:31
   setupOutputFileSystem(context);
 
   // Start watching
-  if (/** @type {Compiler} */ (context.compiler).watching) {
+  if (/** @type {Compiler} */ false) {
     context.watching = /** @type {Compiler} */ (context.compiler).watching;
   } else {

[Timeout] BlockStatement
src/index.js:241:37
     /**
      * @param {Error | null | undefined} error error
      */
-    const errorHandler = (error) => {
-      if (error) {
-        // TODO: improve that in future
-        // For example - `writeToDisk` can throw an error and right now it is ends watching.
-        // We can improve that and keep watching active, but it is require API on webpack side.
-        // Let's implement that in webpack@5 because it is rare case.
-        context.logger.error(error);
-      }
-    };
+    const errorHandler = (error) => {};
 
     if (

[Timeout] ConditionalExpression
src/index.js:242:11
      * @param {Error | null | undefined} error error
      */
     const errorHandler = (error) => {
-      if (error) {
+      if (false) {
         // TODO: improve that in future
         // For example - `writeToDisk` can throw an error and right now it is ends watching.

[Timeout] ConditionalExpression
src/index.js:242:11
      * @param {Error | null | undefined} error error
      */
     const errorHandler = (error) => {
-      if (error) {
+      if (true) {
         // TODO: improve that in future
         // For example - `writeToDisk` can throw an error and right now it is ends watching.

[Timeout] ConditionalExpression
src/index.js:252:7
     };
 
     if (
-      Array.isArray(/** @type {MultiCompiler} */ (context.compiler).compilers)
+      false
     ) {
       const compilers = /** @type {MultiCompiler} */ (context.compiler);

[Timeout] ConditionalExpression
src/index.js:252:7
     };
 
     if (
-      Array.isArray(/** @type {MultiCompiler} */ (context.compiler).compilers)
+      true
     ) {
       const compilers = /** @type {MultiCompiler} */ (context.compiler);

[Timeout] BlockStatement
src/index.js:253:7
 
     if (
       Array.isArray(/** @type {MultiCompiler} */ (context.compiler).compilers)
-    ) {
-      const compilers = /** @type {MultiCompiler} */ (context.compiler);
-      const watchOptions = compilers.compilers.map(
-        (childCompiler) => childCompiler.options.watchOptions || {},
-      );
-
-      context.watching = compiler.watch(watchOptions, errorHandler);
-    } else {
+    ) {} else {
       const oneCompiler = /** @type {Compiler} */ (context.compiler);
       const watchOptions = oneCompiler.options.watchOptions || {};

[Timeout] LogicalOperator
src/index.js:256:28
     ) {
       const compilers = /** @type {MultiCompiler} */ (context.compiler);
       const watchOptions = compilers.compilers.map(
-        (childCompiler) => childCompiler.options.watchOptions || {},
+        (childCompiler) => childCompiler.options.watchOptions && {},
       );
 

[Timeout] ArrowFunction
src/index.js:256:9
     ) {
       const compilers = /** @type {MultiCompiler} */ (context.compiler);
       const watchOptions = compilers.compilers.map(
-        (childCompiler) => childCompiler.options.watchOptions || {},
+        () => undefined,
       );
 

[Timeout] BlockStatement
src/index.js:260:12
       );
 
       context.watching = compiler.watch(watchOptions, errorHandler);
-    } else {
-      const oneCompiler = /** @type {Compiler} */ (context.compiler);
-      const watchOptions = oneCompiler.options.watchOptions || {};
-
-      context.watching = compiler.watch(watchOptions, errorHandler);
-    }
+    } else {}
   }
 

[Timeout] ConditionalExpression
src/index.js:262:28
       context.watching = compiler.watch(watchOptions, errorHandler);
     } else {
       const oneCompiler = /** @type {Compiler} */ (context.compiler);
-      const watchOptions = oneCompiler.options.watchOptions || {};
+      const watchOptions = false;
 
       context.watching = compiler.watch(watchOptions, errorHandler);

[Timeout] ConditionalExpression
src/index.js:262:28
       context.watching = compiler.watch(watchOptions, errorHandler);
     } else {
       const oneCompiler = /** @type {Compiler} */ (context.compiler);
-      const watchOptions = oneCompiler.options.watchOptions || {};
+      const watchOptions = true;
 
       context.watching = compiler.watch(watchOptions, errorHandler);

[Timeout] ArrowFunction
src/index.js:277:33
     (middleware(filledContext));
 
   // API
-  instance.getFilenameFromUrl = (url, extra) =>
-    getFilenameFromUrl(filledContext, url, extra);
+  instance.getFilenameFromUrl = () => undefined;
 
   instance.waitUntilValid = (callback = noop) => {

[Timeout] BlockStatement
src/index.js:280:50
   instance.getFilenameFromUrl = (url, extra) =>
     getFilenameFromUrl(filledContext, url, extra);
 
-  instance.waitUntilValid = (callback = noop) => {
-    ready(filledContext, callback);
-  };
+  instance.waitUntilValid = (callback = noop) => {};
 
   instance.invalidate = (callback = noop) => {

[Timeout] BlockStatement
src/index.js:284:46
     ready(filledContext, callback);
   };
 
-  instance.invalidate = (callback = noop) => {
-    ready(filledContext, callback);
-
-    filledContext.watching.invalidate();
-  };
+  instance.invalidate = (callback = noop) => {};
 
   instance.close = (callback = noop) => {

[Timeout] BlockStatement
src/index.js:290:41
     filledContext.watching.invalidate();
   };
 
-  instance.close = (callback = noop) => {
-    filledContext.watching.close(callback);
-  };
+  instance.close = (callback = noop) => {};
 
   instance.context = filledContext;

[Timeout] ObjectLiteral
src/index.js:323:10
  */
 function hapiWrapper() {
   return {
-    pkg: {
-      name: "webpack-dev-middleware",
-    },
+    pkg: {},
     // Allow to have multiple middleware
     multiple: true,

[Timeout] StringLiteral
src/index.js:324:13
 function hapiWrapper() {
   return {
     pkg: {
-      name: "webpack-dev-middleware",
+      name: "",
     },
     // Allow to have multiple middleware

[Timeout] BooleanLiteral
src/index.js:327:15
       name: "webpack-dev-middleware",
     },
     // Allow to have multiple middleware
-    multiple: true,
+    multiple: false,
     register(server, options) {
       const { compiler, ...rest } = options;

[Timeout] ConditionalExpression
src/index.js:331:11
     register(server, options) {
       const { compiler, ...rest } = options;
 
-      if (!compiler) {
+      if (true) {
         throw new Error("The compiler options is required.");
       }

[NoCoverage] BlockStatement
src/index.js:331:22
     register(server, options) {
       const { compiler, ...rest } = options;
 
-      if (!compiler) {
-        throw new Error("The compiler options is required.");
-      }
+      if (!compiler) {}
 
       const devMiddleware = wdm(compiler, rest);

[NoCoverage] StringLiteral
src/index.js:332:25
       const { compiler, ...rest } = options;
 
       if (!compiler) {
-        throw new Error("The compiler options is required.");
+        throw new Error("");
       }
 

[Timeout] BlockStatement
src/index.js:338:72
       const devMiddleware = wdm(compiler, rest);
 
       // @ts-expect-error
-      if (!server.decorations.server.includes("webpackDevMiddleware")) {
-        // @ts-expect-error
-        server.decorate("server", "webpackDevMiddleware", devMiddleware);
-      }
+      if (!server.decorations.server.includes("webpackDevMiddleware")) {}
 
       // @ts-expect-error

[Timeout] BooleanLiteral
src/index.js:338:11
       const devMiddleware = wdm(compiler, rest);
 
       // @ts-expect-error
-      if (!server.decorations.server.includes("webpackDevMiddleware")) {
+      if (server.decorations.server.includes("webpackDevMiddleware")) {
         // @ts-expect-error
         server.decorate("server", "webpackDevMiddleware", devMiddleware);

[Timeout] BooleanLiteral
src/index.js:347:28
       // eslint-disable-next-line id-length
       server.ext("onRequest", (request, h) =>
         new Promise((resolve, reject) => {
-          let isFinished = false;
+          let isFinished = true;
 
           /**

[Killed] BlockStatement
src/index.js:353:44
            * @param {(string | Buffer)=} data
            */
 
-          request.raw.res.send = (data) => {
-            isFinished = true;
-            request.raw.res.end(data);
-          };
+          request.raw.res.send = (data) => {};
 
           /**
killedBy: hapi framework: middleware basic should work without `fs.createReadStream` should return the "200" code for the "GET" request to the bundle file
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] BooleanLiteral
src/index.js:354:26
            */
 
           request.raw.res.send = (data) => {
-            isFinished = true;
+            isFinished = false;
             request.raw.res.end(data);
           };
killedBy: hapi framework: middleware basic should work without `fs.createReadStream` should return the "200" code for the "GET" request to the bundle file
statusReason: AssertError: Cannot wrap non-Error object

[Killed] BlockStatement
src/index.js:362:46
            * @param {(string | Buffer)=} data
            */
 
-          request.raw.res.finish = (data) => {
-            isFinished = true;
-            request.raw.res.end(data);
-          };
+          request.raw.res.finish = (data) => {};
 
           devMiddleware(request.raw.req, request.raw.res, (error) => {
killedBy: hapi framework: middleware basic should work should return the "200" code for the "HEAD" request to the bundle file
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] BooleanLiteral
src/index.js:363:26
            */
 
           request.raw.res.finish = (data) => {
-            isFinished = true;
+            isFinished = false;
             request.raw.res.end(data);
           };
killedBy: hapi framework: middleware basic should work should return the "200" code for the "HEAD" request to the bundle file
statusReason: AssertError: Cannot wrap non-Error object

[Timeout] BlockStatement
src/index.js:367:70
             request.raw.res.end(data);
           };
 
-          devMiddleware(request.raw.req, request.raw.res, (error) => {
-            if (error) {
-              reject(error);
-              return;
-            }
-
-            if (!isFinished) {
-              resolve(request);
-            }
-          });
+          devMiddleware(request.raw.req, request.raw.res, (error) => {});
         })
           .then(() => h.continue)

[Killed] ConditionalExpression
src/index.js:368:17
           };
 
           devMiddleware(request.raw.req, request.raw.res, (error) => {
-            if (error) {
+            if (true) {
               reject(error);
               return;
killedBy: hapi framework: middleware basic should work should return the "200" code for the "HEAD" request to the bundle file
statusReason: AssertError: Cannot wrap non-Error object

[Survived] ConditionalExpression
src/index.js:368:17
           };
 
           devMiddleware(request.raw.req, request.raw.res, (error) => {
-            if (error) {
+            if (false) {
               reject(error);
               return;

[Killed] ConditionalExpression
src/index.js:373:17
               return;
             }
 
-            if (!isFinished) {
+            if (true) {
               resolve(request);
             }
killedBy: hapi framework: middleware basic should work should return the "200" code for the "HEAD" request to the bundle file
statusReason: AssertError: Cannot wrap non-Error object

[Timeout] ConditionalExpression
src/index.js:373:17
               return;
             }
 
-            if (!isFinished) {
+            if (false) {
               resolve(request);
             }

[Killed] ArrowFunction
src/index.js:378:17
             }
           });
         })
-          .then(() => h.continue)
+          .then(() => undefined)
           .catch((error) => {
             throw error;
killedBy: hapi framework: middleware basic should work should return the "404" code for the "POST" request to the bundle file
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 500

[NoCoverage] BlockStatement
src/index.js:379:29
           });
         })
           .then(() => h.continue)
-          .catch((error) => {
-            throw error;
-          }),
+          .catch((error) => {}),
       );
     },

[Timeout] ArrowFunction
src/index.js:416:25
     /**
      * @returns {number} code
      */
-    res.getStatusCode = () => status;
+    res.getStatusCode = () => undefined;
 
     /**

[Timeout] BlockStatement
src/index.js:421:41
     /**
      * @param {number} statusCode status code
      */
-    res.setStatusCode = (statusCode) => {
-      status = statusCode;
-
-      ctx.status = statusCode;
-    };
+    res.setStatusCode = (statusCode) => {};
 
     res.getReadyReadableStreamState = () => "open";

[Timeout] ArrowFunction
src/index.js:427:39
       ctx.status = statusCode;
     };
 
-    res.getReadyReadableStreamState = () => "open";
+    res.getReadyReadableStreamState = () => undefined;
 
     try {

[Timeout] BlockStatement
src/index.js:439:36
           /**
            * @param {import("fs").ReadStream} stream readable stream
            */
-          res.stream = (stream) => {
-            ctx.body = stream;
-          };
+          res.stream = (stream) => {};
           /**
            * @param {string | Buffer} data data

[Killed] BlockStatement
src/index.js:445:32
           /**
            * @param {string | Buffer} data data
            */
-          res.send = (data) => {
-            ctx.body = data;
-          };
+          res.send = (data) => {};
 
           /**
killedBy: koa framework: middleware basic should work without `fs.createReadStream` should return the "200" code for the "GET" request to the bundle file
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "6442"
Received: "2"

[Killed] BlockStatement
src/index.js:452:34
           /**
            * @param {(string | Buffer)=} data data
            */
-          res.finish = (data) => {
-            ctx.status = status;
-            res.end(data);
-          };
+          res.finish = (data) => {};
 
           devMiddleware(req, res, (err) => {
killedBy: koa framework: middleware basic should work should return the "416" code for the "GET" request with the invalid range header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "text/html; charset=utf-8"
Received: "text/plain; charset=utf-8"

[Timeout] BlockStatement
src/index.js:457:44
             res.end(data);
           };
 
-          devMiddleware(req, res, (err) => {
-            if (err) {
-              reject(err);
-              return;
-            }
-
-            resolve();
-          });
+          devMiddleware(req, res, (err) => {});
         },
       );

[Timeout] ConditionalExpression
src/index.js:458:17
           };
 
           devMiddleware(req, res, (err) => {
-            if (err) {
+            if (true) {
               reject(err);
               return;

[Timeout] ConditionalExpression
src/index.js:458:17
           };
 
           devMiddleware(req, res, (err) => {
-            if (err) {
+            if (false) {
               reject(err);
               return;

[NoCoverage] BlockStatement
src/index.js:467:19
           });
         },
       );
-    } catch (err) {
-      ctx.status =
-        /** @type {Error & { statusCode: number }} */ (err).statusCode ||
-        /** @type {Error & { status: number }} */ (err).status ||
-        500;
-
-      ctx.body = {
-        message: /** @type {Error} */ (err).message,
-      };
-    }
+    } catch (err) {}
 
     await next();

[NoCoverage] LogicalOperator
src/index.js:469:55
       );
     } catch (err) {
       ctx.status =
-        /** @type {Error & { statusCode: number }} */ (err).statusCode ||
-        /** @type {Error & { status: number }} */ (err).status ||
+        /** @type {Error & { statusCode: number }} */ err.statusCode && /** @type {Error & { status: number }} */err.status ||
         500;
 

[NoCoverage] ConditionalExpression
src/index.js:469:55
       );
     } catch (err) {
       ctx.status =
-        /** @type {Error & { statusCode: number }} */ (err).statusCode ||
-        /** @type {Error & { status: number }} */ (err).status ||
-        500;
+        /** @type {Error & { statusCode: number }} */ false;
 
       ctx.body = {

[NoCoverage] ObjectLiteral
src/index.js:473:18
         /** @type {Error & { status: number }} */ (err).status ||
         500;
 
-      ctx.body = {
-        message: /** @type {Error} */ (err).message,
-      };
+      ctx.body = {};
     }
 

[Timeout] ObjectLiteral
src/index.js:508:28
   async function webpackDevMiddleware(context, next) {
     const { req, res } = context;
 
-    context.set("webpack", { devMiddleware: devMiddleware.context });
+    context.set("webpack", {});
 
     /**

[Timeout] ArrowFunction
src/index.js:513:21
     /**
      * @returns {string | undefined} method
      */
-    req.getMethod = () => context.req.method;
+    req.getMethod = () => undefined;
 
     /**

[Timeout] ArrowFunction
src/index.js:519:21
      * @param {string} name name
      * @returns {string | string[] | undefined} header value
      */
-    req.getHeader = (name) => context.req.header(name);
+    req.getHeader = () => undefined;
 
     /**

[Timeout] ArrowFunction
src/index.js:524:18
     /**
      * @returns {string | undefined} URL
      */
-    req.getURL = () => context.req.url;
+    req.getURL = () => undefined;
 
     let { status } = context.res;

[Timeout] BlockStatement
src/index.js:536:35
     /**
      * @param {number} code code
      */
-    res.setStatusCode = (code) => {
-      status = code;
-    };
+    res.setStatusCode = (code) => {};
 
     /**

[Timeout] ArrowFunction
src/index.js:544:21
      * @param {string} name header name
      * @returns {string | string[] | undefined} header
      */
-    res.getHeader = (name) => context.res.headers.get(name);
+    res.getHeader = () => undefined;
 
     // eslint-disable-next-line jsdoc/no-restricted-syntax

[Timeout] BlockStatement
src/index.js:552:38
      * @param {string | number | Readonly<string[]>} value value
      * @returns {ResponseInternal & import("./utils/compatibleAPI").ExpectedServerResponse & { headers: any, status: any }} response
      */
-    res.setHeader = (name, value) => {
-      context.res.headers.append(name, value);
-      return context.res;
-    };
+    res.setHeader = (name, value) => {};
 
     /**

[Timeout] BlockStatement
src/index.js:560:34
     /**
      * @param {string} name header name
      */
-    res.removeHeader = (name) => {
-      context.res.headers.delete(name);
-    };
+    res.removeHeader = (name) => {};
 
     /**

[Timeout] ArrowFunction
src/index.js:567:30
     /**
      * @returns {string[]} response headers
      */
-    res.getResponseHeaders = () => [...context.res.headers.keys()];
+    res.getResponseHeaders = () => undefined;
 
     /**

[Timeout] ArrowFunction
src/index.js:572:23
     /**
      * @returns {ServerResponse} server response
      */
-    res.getOutgoing = () => context.env.outgoing;
+    res.getOutgoing = () => undefined;
 
     res.setState = () => {

[Timeout] ArrowFunction
src/index.js:578:39
       // Do nothing, because we set it before
     };
 
-    res.getReadyReadableStreamState = () => "readable";
+    res.getReadyReadableStreamState = () => undefined;
 
     res.getHeadersSent = () => context.env.outgoing.headersSent;

[Timeout] ArrowFunction
src/index.js:580:26
 
     res.getReadyReadableStreamState = () => "readable";
 
-    res.getHeadersSent = () => context.env.outgoing.headersSent;
+    res.getHeadersSent = () => undefined;
 
     let body;

[Timeout] BlockStatement
src/index.js:594:36
           /**
            * @param {import("fs").ReadStream} stream readable stream
            */
-          res.stream = (stream) => {
-            body = stream;
-            // responseHandler(stream);
-          };
+          res.stream = (stream) => {};
 
           /**

[Killed] BlockStatement
src/index.js:602:32
           /**
            * @param {string | Buffer} data data
            */
-          res.send = (data) => {
-            // Hono sets `Content-Length` by default
-            context.res.headers.delete("Content-Length");
-
-            body = data;
-          };
+          res.send = (data) => {};
 
           /**
killedBy: hono framework: middleware basic should work without `fs.createReadStream` should return the "200" code for the "GET" request to the bundle file
statusReason: Error: aborted

[Timeout] BlockStatement
src/index.js:612:34
           /**
            * @param {(string | Buffer)=} data data
            */
-          res.finish = (data) => {
-            const isDataExist = typeof data !== "undefined";
-
-            // Hono sets `Content-Length` by default
-            if (isDataExist) {
-              context.res.headers.delete("Content-Length");
-            }
-
-            body = isDataExist ? data : null;
-          };
+          res.finish = (data) => {};
 
           devMiddleware(req, res, (err) => {

[Timeout] ConditionalExpression
src/index.js:613:33
            * @param {(string | Buffer)=} data data
            */
           res.finish = (data) => {
-            const isDataExist = typeof data !== "undefined";
+            const isDataExist = true;
 
             // Hono sets `Content-Length` by default

[Timeout] EqualityOperator
src/index.js:613:33
            * @param {(string | Buffer)=} data data
            */
           res.finish = (data) => {
-            const isDataExist = typeof data !== "undefined";
+            const isDataExist = typeof data === "undefined";
 
             // Hono sets `Content-Length` by default

[Killed] ConditionalExpression
src/index.js:616:17
             const isDataExist = typeof data !== "undefined";
 
             // Hono sets `Content-Length` by default
-            if (isDataExist) {
+            if (true) {
               context.res.headers.delete("Content-Length");
             }
killedBy: hono framework: middleware basic should work should return the "200" code for the "HEAD" request to the bundle file
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "6442"
Received: undefined

[Killed] ConditionalExpression
src/index.js:616:17
             const isDataExist = typeof data !== "undefined";
 
             // Hono sets `Content-Length` by default
-            if (isDataExist) {
+            if (false) {
               context.res.headers.delete("Content-Length");
             }
killedBy: hono framework: middleware basic should work should return the "416" code for the "GET" request with the invalid range header
statusReason: Error: Parse Error: Duplicate Content-Length

[NoCoverage] BlockStatement
src/index.js:624:22
           };
 
           devMiddleware(req, res, (err) => {
-            if (err) {
-              reject(err);
-              return;
-            }
+            if (err) {}
 
             resolve();

[NoCoverage] BlockStatement
src/index.js:633:19
           });
         },
       );
-    } catch (err) {
-      context.status(500);
-
-      return context.json({ message: /** @type {Error} */ (err).message });
-    }
+    } catch (err) {}
 
     if (typeof body !== "undefined") {

[Timeout] BlockStatement
src/index.js:639:38
       return context.json({ message: /** @type {Error} */ (err).message });
     }
 
-    if (typeof body !== "undefined") {
-      return context.body(body, status);
-    }
+    if (typeof body !== "undefined") {}
 
     await next();

[Timeout] ConditionalExpression
src/index.js:639:9
       return context.json({ message: /** @type {Error} */ (err).message });
     }
 
-    if (typeof body !== "undefined") {
+    if (true) {
       return context.body(body, status);
     }
