[Timeout] BlockStatement
src/middleware.js:46:56
  * @param {import("range-parser").Range=} range range
  * @returns {string} value of content range header
  */
-function getValueContentRangeHeader(type, size, range) {
-  return `${type} ${range ? `${range.start}-${range.end}` : "*"}/${size}`;
-}
+function getValueContentRangeHeader(type, size, range) {}
 
 /**

[Timeout] StringLiteral
src/middleware.js:47:61
  * @returns {string} value of content range header
  */
 function getValueContentRangeHeader(type, size, range) {
-  return `${type} ${range ? `${range.start}-${range.end}` : "*"}/${size}`;
+  return `${type} ${range ? `${range.start}-${range.end}` : ""}/${size}`;
 }
 

[Timeout] StringLiteral
src/middleware.js:47:29
  * @returns {string} value of content range header
  */
 function getValueContentRangeHeader(type, size, range) {
-  return `${type} ${range ? `${range.start}-${range.end}` : "*"}/${size}`;
+  return `${type} ${range ? `` : "*"}/${size}`;
 }
 

[Timeout] BlockStatement
src/middleware.js:55:30
  * @param {string} date date
  * @returns {number} timestamp
  */
-function parseHttpDate(date) {
-  const timestamp = date && Date.parse(date);
-
-  // istanbul ignore next: guard against date.js Date.parse patching
-  return typeof timestamp === "number" ? timestamp : Number.NaN;
-}
+function parseHttpDate(date) {}
 
 const CACHE_CONTROL_NO_CACHE_REGEXP = /(?:^|,)\s*?no-cache\s*?(?:,|$)/;

[Timeout] ConditionalExpression
src/middleware.js:56:21
  * @returns {number} timestamp
  */
 function parseHttpDate(date) {
-  const timestamp = date && Date.parse(date);
+  const timestamp = false;
 
   // istanbul ignore next: guard against date.js Date.parse patching

[Timeout] LogicalOperator
src/middleware.js:56:21
  * @returns {number} timestamp
  */
 function parseHttpDate(date) {
-  const timestamp = date && Date.parse(date);
+  const timestamp = date || Date.parse(date);
 
   // istanbul ignore next: guard against date.js Date.parse patching

[Killed] EqualityOperator
src/middleware.js:59:10
   const timestamp = date && Date.parse(date);
 
   // istanbul ignore next: guard against date.js Date.parse patching
-  return typeof timestamp === "number" ? timestamp : Number.NaN;
+  return typeof timestamp !== "number" ? timestamp : Number.NaN;
 }
 
killedBy: connect framework: middleware lastModified should work and generate Last-Modified header should return the "304" code for the "GET" request to the bundle file with "Last-Modified" and "if-modified-sin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 304
Received: 200

[Timeout] ConditionalExpression
src/middleware.js:59:10
   const timestamp = date && Date.parse(date);
 
   // istanbul ignore next: guard against date.js Date.parse patching
-  return typeof timestamp === "number" ? timestamp : Number.NaN;
+  return false ? timestamp : Number.NaN;
 }
 

[Timeout] Regex
src/middleware.js:62:39
   return typeof timestamp === "number" ? timestamp : Number.NaN;
 }
 
-const CACHE_CONTROL_NO_CACHE_REGEXP = /(?:^|,)\s*?no-cache\s*?(?:,|$)/;
+const CACHE_CONTROL_NO_CACHE_REGEXP = /(?:^|,)\s*?no-cache\s*?(?:,)/;
 
 /**

[Timeout] ConditionalExpression
src/middleware.js:70:7
  * @returns {void}
  */
 function destroyStream(stream, suppress) {
-  if (typeof stream.destroy === "function") {
+  if (true) {
     stream.destroy();
   }

[Timeout] BlockStatement
src/middleware.js:70:45
  * @returns {void}
  */
 function destroyStream(stream, suppress) {
-  if (typeof stream.destroy === "function") {
-    stream.destroy();
-  }
+  if (typeof stream.destroy === "function") {}
 
   if (typeof stream.close === "function") {

[Timeout] ConditionalExpression
src/middleware.js:74:7
     stream.destroy();
   }
 
-  if (typeof stream.close === "function") {
+  if (false) {
     // Node.js core bug workaround
     stream.on(

[Timeout] BlockStatement
src/middleware.js:74:43
     stream.destroy();
   }
 
-  if (typeof stream.close === "function") {
-    // Node.js core bug workaround
-    stream.on(
-      "open",
-      /**
-       * @this {import("fs").ReadStream}
-       */
-      function onOpenClose() {
-        // @ts-expect-error
-        if (typeof this.fd === "number") {
-          // actually close down the fd
-          this.close();
-        }
-      },
-    );
-  }
+  if (typeof stream.close === "function") {}
 
   if (typeof stream.addListener === "function" && suppress) {

[Timeout] StringLiteral
src/middleware.js:77:7
   if (typeof stream.close === "function") {
     // Node.js core bug workaround
     stream.on(
-      "open",
+      "",
       /**
        * @this {import("fs").ReadStream}

[NoCoverage] BlockStatement
src/middleware.js:81:30
       /**
        * @this {import("fs").ReadStream}
        */
-      function onOpenClose() {
-        // @ts-expect-error
-        if (typeof this.fd === "number") {
-          // actually close down the fd
-          this.close();
-        }
-      },
+      function onOpenClose() {},
     );
   }

[NoCoverage] BlockStatement
src/middleware.js:83:42
        */
       function onOpenClose() {
         // @ts-expect-error
-        if (typeof this.fd === "number") {
-          // actually close down the fd
-          this.close();
-        }
+        if (typeof this.fd === "number") {}
       },
     );

[NoCoverage] ConditionalExpression
src/middleware.js:83:13
        */
       function onOpenClose() {
         // @ts-expect-error
-        if (typeof this.fd === "number") {
+        if (true) {
           // actually close down the fd
           this.close();

[Timeout] BlockStatement
src/middleware.js:91:61
     );
   }
 
-  if (typeof stream.addListener === "function" && suppress) {
-    stream.removeAllListeners("error");
-    stream.addListener("error", () => {});
-  }
+  if (typeof stream.addListener === "function" && suppress) {}
 }
 

[Timeout] ConditionalExpression
src/middleware.js:91:7
     );
   }
 
-  if (typeof stream.addListener === "function" && suppress) {
+  if (false) {
     stream.removeAllListeners("error");
     stream.addListener("error", () => {});

[Timeout] StringLiteral
src/middleware.js:102:8
   400: "Bad Request",
   403: "Forbidden",
   404: "Not Found",
-  416: "Range Not Satisfiable",
+  416: "",
   500: "Internal Server Error",
 };

[Timeout] BlockStatement
src/middleware.js:111:14
    * @param {string} value value
    * @returns {import("range-parser").Result | import("range-parser").Ranges} ranges
    */
-  (value) => {
-    const [len, rangeHeader] = value.split("|");
-
-    return require("range-parser")(Number(len), rangeHeader, {
-      combine: true,
-    });
-  },
+  (value) => {},
 );
 

[Timeout] StringLiteral
src/middleware.js:112:44
    * @returns {import("range-parser").Result | import("range-parser").Ranges} ranges
    */
   (value) => {
-    const [len, rangeHeader] = value.split("|");
+    const [len, rangeHeader] = value.split("");
 
     return require("range-parser")(Number(len), rangeHeader, {

[Timeout] BooleanLiteral
src/middleware.js:115:16
     const [len, rangeHeader] = value.split("|");
 
     return require("range-parser")(Number(len), rangeHeader, {
-      combine: true,
+      combine: false,
     });
   },

[Timeout] LogicalOperator
src/middleware.js:138:29
  */
 function wrapper(context) {
   return async function middleware(req, res, next) {
-    const acceptedMethods = context.options.methods || ["GET", "HEAD"];
+    const acceptedMethods = context.options.methods && ["GET", "HEAD"];
 
     initState(res);

[Timeout] ConditionalExpression
src/middleware.js:138:29
  */
 function wrapper(context) {
   return async function middleware(req, res, next) {
-    const acceptedMethods = context.options.methods || ["GET", "HEAD"];
+    const acceptedMethods = true;
 
     initState(res);

[Timeout] BlockStatement
src/middleware.js:145:29
     /**
      * @returns {Promise<void>}
      */
-    async function goNext() {
-      if (!context.options.serverSideRender) {
-        return next();
-      }
-
-      return new Promise((resolve) => {
-        ready(
-          context,
-          () => {
-            setState(res, "webpack", { devMiddleware: context });
-            resolve(next());
-          },
-          req,
-        );
-      });
-    }
+    async function goNext() {}
 
     const method = getRequestMethod(req);

[Timeout] BlockStatement
src/middleware.js:146:46
      * @returns {Promise<void>}
      */
     async function goNext() {
-      if (!context.options.serverSideRender) {
-        return next();
-      }
+      if (!context.options.serverSideRender) {}
 
       return new Promise((resolve) => {

[Timeout] BooleanLiteral
src/middleware.js:146:11
      * @returns {Promise<void>}
      */
     async function goNext() {
-      if (!context.options.serverSideRender) {
+      if (context.options.serverSideRender) {
         return next();
       }

[Timeout] BlockStatement
src/middleware.js:150:39
         return next();
       }
 
-      return new Promise((resolve) => {
-        ready(
-          context,
-          () => {
-            setState(res, "webpack", { devMiddleware: context });
-            resolve(next());
-          },
-          req,
-        );
-      });
+      return new Promise((resolve) => {});
     }
 

[Timeout] BlockStatement
src/middleware.js:153:17
       return new Promise((resolve) => {
         ready(
           context,
-          () => {
-            setState(res, "webpack", { devMiddleware: context });
-            resolve(next());
-          },
+          () => {},
           req,
         );

[Timeout] ConditionalExpression
src/middleware.js:164:9
 
     const method = getRequestMethod(req);
 
-    if (method && !acceptedMethods.includes(method)) {
+    if (false) {
       await goNext();
       return;

[Timeout] BooleanLiteral
src/middleware.js:164:19
 
     const method = getRequestMethod(req);
 
-    if (method && !acceptedMethods.includes(method)) {
+    if (method && acceptedMethods.includes(method)) {
       await goNext();
       return;

[Timeout] ConditionalExpression
src/middleware.js:177:23
     function sendError(status, options) {
       const escapeHtml = require("./utils/escapeHtml");
 
-      const content = statuses[status] || String(status);
+      const content = false;
       let document = Buffer.from(
         `<!DOCTYPE html>

[Timeout] LogicalOperator
src/middleware.js:177:23
     function sendError(status, options) {
       const escapeHtml = require("./utils/escapeHtml");
 
-      const content = statuses[status] || String(status);
+      const content = statuses[status] && String(status);
       let document = Buffer.from(
         `<!DOCTYPE html>

[Timeout] StringLiteral
src/middleware.js:179:9
 
       const content = statuses[status] || String(status);
       let document = Buffer.from(
-        `<!DOCTYPE html>
-<html lang="en">
-<head>
-<meta charset="utf-8">
-<title>Error</title>
-</head>
-<body>
-<pre>${escapeHtml(content)}</pre>
-</body>
-</html>`,
+        ``,
         "utf8",
       );

[Timeout] ConditionalExpression
src/middleware.js:195:23
       // Clear existing headers
       const headers = getResponseHeaders(res);
 
-      for (let i = 0; i < headers.length; i++) {
+      for (let i = 0; false; i++) {
         removeResponseHeader(res, headers[i]);
       }

[Timeout] EqualityOperator
src/middleware.js:195:23
       // Clear existing headers
       const headers = getResponseHeaders(res);
 
-      for (let i = 0; i < headers.length; i++) {
+      for (let i = 0; i >= headers.length; i++) {
         removeResponseHeader(res, headers[i]);
       }

[Killed] BlockStatement
src/middleware.js:199:39
         removeResponseHeader(res, headers[i]);
       }
 
-      if (options && options.headers) {
-        const keys = Object.keys(options.headers);
-
-        for (let i = 0; i < keys.length; i++) {
-          const key = keys[i];
-          const value = options.headers[key];
-
-          if (typeof value !== "undefined") {
-            setResponseHeader(res, key, value);
-          }
-        }
-      }
+      if (options && options.headers) {}
 
       // Send basic response
killedBy: connect framework: middleware basic should work should return the "416" code for the "GET" request with the invalid range header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bytes */6442"
Received: undefined

[Timeout] ConditionalExpression
src/middleware.js:199:11
         removeResponseHeader(res, headers[i]);
       }
 
-      if (options && options.headers) {
+      if (false) {
         const keys = Object.keys(options.headers);
 

[Killed] BlockStatement
src/middleware.js:202:47
       if (options && options.headers) {
         const keys = Object.keys(options.headers);
 
-        for (let i = 0; i < keys.length; i++) {
-          const key = keys[i];
-          const value = options.headers[key];
-
-          if (typeof value !== "undefined") {
-            setResponseHeader(res, key, value);
-          }
-        }
+        for (let i = 0; i < keys.length; i++) {}
       }
 
killedBy: connect framework: middleware basic should work should return the "416" code for the "GET" request with the invalid range header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bytes */6442"
Received: undefined

[Timeout] UpdateOperator
src/middleware.js:202:42
       if (options && options.headers) {
         const keys = Object.keys(options.headers);
 
-        for (let i = 0; i < keys.length; i++) {
+        for (let i = 0; i < keys.length; i--) {
           const key = keys[i];
           const value = options.headers[key];

[Killed] EqualityOperator
src/middleware.js:206:15
           const key = keys[i];
           const value = options.headers[key];
 
-          if (typeof value !== "undefined") {
+          if (typeof value === "undefined") {
             setResponseHeader(res, key, value);
           }
killedBy: connect framework: middleware basic should work should return the "416" code for the "GET" request with the invalid range header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bytes */6442"
Received: undefined

[Timeout] BlockStatement
src/middleware.js:206:45
           const key = keys[i];
           const value = options.headers[key];
 
-          if (typeof value !== "undefined") {
-            setResponseHeader(res, key, value);
-          }
+          if (typeof value !== "undefined") {}
         }
       }

[Timeout] StringLiteral
src/middleware.js:215:57
       // Send basic response
       setStatusCode(res, status);
       setResponseHeader(res, "Content-Type", "text/html; charset=utf-8");
-      setResponseHeader(res, "Content-Security-Policy", "default-src 'none'");
+      setResponseHeader(res, "Content-Security-Policy", "");
       setResponseHeader(res, "X-Content-Type-Options", "nosniff");
 

[Timeout] StringLiteral
src/middleware.js:216:30
       setStatusCode(res, status);
       setResponseHeader(res, "Content-Type", "text/html; charset=utf-8");
       setResponseHeader(res, "Content-Security-Policy", "default-src 'none'");
-      setResponseHeader(res, "X-Content-Type-Options", "nosniff");
+      setResponseHeader(res, "", "nosniff");
 
       let byteLength = Buffer.byteLength(document);

[NoCoverage] BlockStatement
src/middleware.js:220:50
 
       let byteLength = Buffer.byteLength(document);
 
-      if (options && options.modifyResponseData) {
-        ({ data: document, byteLength } =
-          /** @type {{ data: Buffer<ArrayBuffer>, byteLength: number }} */
-          (options.modifyResponseData(req, res, document, byteLength)));
-      }
+      if (options && options.modifyResponseData) {}
 
       setResponseHeader(res, "Content-Length", byteLength);

[Timeout] LogicalOperator
src/middleware.js:220:11
 
       let byteLength = Buffer.byteLength(document);
 
-      if (options && options.modifyResponseData) {
+      if (options || options.modifyResponseData) {
         ({ data: document, byteLength } =
           /** @type {{ data: Buffer<ArrayBuffer>, byteLength: number }} */

[Timeout] BlockStatement
src/middleware.js:235:34
      * @param {NodeJS.ErrnoException} error error
      * @returns {void}
      */
-    function errorHandler(error) {
-      switch (error.code) {
-        case "ENAMETOOLONG":
-        case "ENOENT":
-        case "ENOTDIR":
-          sendError(404, {
-            modifyResponseData: context.options.modifyResponseData,
-          });
-          break;
-        default:
-          sendError(500, {
-            modifyResponseData: context.options.modifyResponseData,
-          });
-          break;
-      }
-    }
+    function errorHandler(error) {}
 
     /**

[Timeout] StringLiteral
src/middleware.js:237:14
      */
     function errorHandler(error) {
       switch (error.code) {
-        case "ENAMETOOLONG":
+        case "":
         case "ENOENT":
         case "ENOTDIR":

[Timeout] StringLiteral
src/middleware.js:238:14
     function errorHandler(error) {
       switch (error.code) {
         case "ENAMETOOLONG":
-        case "ENOENT":
+        case "":
         case "ENOTDIR":
           sendError(404, {

[Timeout] ConditionalExpression
src/middleware.js:239:9
       switch (error.code) {
         case "ENAMETOOLONG":
         case "ENOENT":
-        case "ENOTDIR":
-          sendError(404, {
-            modifyResponseData: context.options.modifyResponseData,
-          });
-          break;
+        case "ENOTDIR":
         default:
           sendError(500, {

[Timeout] ConditionalExpression
src/middleware.js:244:9
             modifyResponseData: context.options.modifyResponseData,
           });
           break;
-        default:
-          sendError(500, {
-            modifyResponseData: context.options.modifyResponseData,
-          });
-          break;
+        default:
       }
     }

[Timeout] BlockStatement
src/middleware.js:255:33
     /**
      * @returns {string | string[] | undefined} something when conditional get exist
      */
-    function isConditionalGET() {
-      return (
-        getRequestHeader(req, "if-match") ||
-        getRequestHeader(req, "if-unmodified-since") ||
-        getRequestHeader(req, "if-none-match") ||
-        getRequestHeader(req, "if-modified-since")
-      );
-    }
+    function isConditionalGET() {}
 
     /**

[Timeout] LogicalOperator
src/middleware.js:257:9
      */
     function isConditionalGET() {
       return (
-        getRequestHeader(req, "if-match") ||
-        getRequestHeader(req, "if-unmodified-since") ||
+        getRequestHeader(req, "if-match") && getRequestHeader(req, "if-unmodified-since") ||
         getRequestHeader(req, "if-none-match") ||
         getRequestHeader(req, "if-modified-since")

[Timeout] LogicalOperator
src/middleware.js:257:9
      */
     function isConditionalGET() {
       return (
-        getRequestHeader(req, "if-match") ||
-        getRequestHeader(req, "if-unmodified-since") ||
-        getRequestHeader(req, "if-none-match") ||
+        (getRequestHeader(req, "if-match") || getRequestHeader(req, "if-unmodified-since")) && getRequestHeader(req, "if-none-match") ||
         getRequestHeader(req, "if-modified-since")
       );

[Timeout] StringLiteral
src/middleware.js:258:31
     function isConditionalGET() {
       return (
         getRequestHeader(req, "if-match") ||
-        getRequestHeader(req, "if-unmodified-since") ||
+        getRequestHeader(req, "") ||
         getRequestHeader(req, "if-none-match") ||
         getRequestHeader(req, "if-modified-since")

[Timeout] StringLiteral
src/middleware.js:260:31
         getRequestHeader(req, "if-match") ||
         getRequestHeader(req, "if-unmodified-since") ||
         getRequestHeader(req, "if-none-match") ||
-        getRequestHeader(req, "if-modified-since")
+        getRequestHeader(req, "")
       );
     }

[Killed] ConditionalExpression
src/middleware.js:276:11
       // be a more accurate replacement for the condition in
       // If-Unmodified-Since, and the two are only combined for the sake of
       // interoperating with older intermediaries that might not implement If-Match.
-      if (ifMatch) {
+      if (false) {
         const etag = getResponseHeader(res, "ETag");
 
killedBy: connect framework: middleware etag should work and generate weak etag should return the "200" code for the "GET" request to the bundle file with etag and "if-match" header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 412
Received: 200

[Killed] BlockStatement
src/middleware.js:276:20
       // be a more accurate replacement for the condition in
       // If-Unmodified-Since, and the two are only combined for the sake of
       // interoperating with older intermediaries that might not implement If-Match.
-      if (ifMatch) {
-        const etag = getResponseHeader(res, "ETag");
-
-        return (
-          !etag ||
-          (ifMatch !== "*" &&
-            parseTokenList(ifMatch).every(
-              (match) =>
-                match !== etag &&
-                match !== `W/${etag}` &&
-                `W/${match}` !== etag,
-            ))
-        );
-      }
+      if (ifMatch) {}
 
       // if-unmodified-since
killedBy: connect framework: middleware etag should work and generate weak etag should return the "200" code for the "GET" request to the bundle file with etag and "if-match" header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 412
Received: 200

[Timeout] ConditionalExpression
src/middleware.js:280:11
         const etag = getResponseHeader(res, "ETag");
 
         return (
-          !etag ||
-          (ifMatch !== "*" &&
-            parseTokenList(ifMatch).every(
-              (match) =>
-                match !== etag &&
-                match !== `W/${etag}` &&
-                `W/${match}` !== etag,
-            ))
+          false
         );
       }

[Timeout] LogicalOperator
src/middleware.js:280:11
         const etag = getResponseHeader(res, "ETag");
 
         return (
-          !etag ||
-          (ifMatch !== "*" &&
-            parseTokenList(ifMatch).every(
-              (match) =>
-                match !== etag &&
-                match !== `W/${etag}` &&
-                `W/${match}` !== etag,
-            ))
+          !etag && ifMatch !== "*" && parseTokenList(ifMatch).every(match => match !== etag && match !== `W/${etag}` && `W/${match}` !== etag)
         );
       }

[Killed] ConditionalExpression
src/middleware.js:281:12
 
         return (
           !etag ||
-          (ifMatch !== "*" &&
-            parseTokenList(ifMatch).every(
-              (match) =>
-                match !== etag &&
-                match !== `W/${etag}` &&
-                `W/${match}` !== etag,
-            ))
+          (false)
         );
       }
killedBy: connect framework: middleware etag should work and generate weak etag should return the "200" code for the "GET" request to the bundle file with etag and "if-match" header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 412
Received: 200

[Timeout] ConditionalExpression
src/middleware.js:281:12
 
         return (
           !etag ||
-          (ifMatch !== "*" &&
+          (true &&
             parseTokenList(ifMatch).every(
               (match) =>

[Killed] MethodExpression
src/middleware.js:282:13
         return (
           !etag ||
           (ifMatch !== "*" &&
-            parseTokenList(ifMatch).every(
-              (match) =>
-                match !== etag &&
-                match !== `W/${etag}` &&
-                `W/${match}` !== etag,
-            ))
+            parseTokenList(ifMatch).some(match => match !== etag && match !== `W/${etag}` && `W/${match}` !== etag))
         );
       }
killedBy: connect framework: middleware etag should work and generate weak etag should return the "200" code for the "GET" request to the bundle file with etag and "if-match" header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 412

[Timeout] ArrowFunction
src/middleware.js:283:15
           !etag ||
           (ifMatch !== "*" &&
             parseTokenList(ifMatch).every(
-              (match) =>
-                match !== etag &&
-                match !== `W/${etag}` &&
-                `W/${match}` !== etag,
+              () => undefined,
             ))
         );

[Killed] EqualityOperator
src/middleware.js:284:17
           (ifMatch !== "*" &&
             parseTokenList(ifMatch).every(
               (match) =>
-                match !== etag &&
+                match === etag &&
                 match !== `W/${etag}` &&
                 `W/${match}` !== etag,
killedBy: connect framework: middleware etag should work and generate weak etag should return the "200" code for the "GET" request to the bundle file with etag and "if-match" header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 412

[Killed] ConditionalExpression
src/middleware.js:284:17
           (ifMatch !== "*" &&
             parseTokenList(ifMatch).every(
               (match) =>
-                match !== etag &&
-                match !== `W/${etag}` &&
-                `W/${match}` !== etag,
+                true,
             ))
         );
killedBy: connect framework: middleware etag should work and generate weak etag should return the "200" code for the "GET" request to the bundle file with etag and "if-match" header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 412

[Survived] ConditionalExpression
src/middleware.js:285:17
             parseTokenList(ifMatch).every(
               (match) =>
                 match !== etag &&
-                match !== `W/${etag}` &&
+                true &&
                 `W/${match}` !== etag,
             ))

[Timeout] EqualityOperator
src/middleware.js:285:17
             parseTokenList(ifMatch).every(
               (match) =>
                 match !== etag &&
-                match !== `W/${etag}` &&
+                match === `W/${etag}` &&
                 `W/${match}` !== etag,
             ))

[Survived] ConditionalExpression
src/middleware.js:286:17
               (match) =>
                 match !== etag &&
                 match !== `W/${etag}` &&
-                `W/${match}` !== etag,
+                true,
             ))
         );

[Timeout] EqualityOperator
src/middleware.js:286:17
               (match) =>
                 match !== etag &&
                 match !== `W/${etag}` &&
-                `W/${match}` !== etag,
+                `W/${match}` === etag,
             ))
         );

[Killed] ConditionalExpression
src/middleware.js:296:11
         /** @type {string} */
         (getRequestHeader(req, "if-unmodified-since"));
 
-      if (ifUnmodifiedSince) {
+      if (false) {
         const unmodifiedSince = parseHttpDate(ifUnmodifiedSince);
 
killedBy: connect framework: middleware lastModified should work and generate Last-Modified header should return the "200" code for the "GET" request to the bundle file with "Last-Modified" and "if-unmodified-s
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 412
Received: 200

[Timeout] BlockStatement
src/middleware.js:296:30
         /** @type {string} */
         (getRequestHeader(req, "if-unmodified-since"));
 
-      if (ifUnmodifiedSince) {
-        const unmodifiedSince = parseHttpDate(ifUnmodifiedSince);
-
-        // A recipient MUST ignore the If-Unmodified-Since header field if the
-        // received field-value is not a valid HTTP-date.
-        if (!Number.isNaN(unmodifiedSince)) {
-          const lastModified = parseHttpDate(
-            /** @type {string} */ (getResponseHeader(res, "Last-Modified")),
-          );
-
-          return Number.isNaN(lastModified) || lastModified > unmodifiedSince;
-        }
-      }
+      if (ifUnmodifiedSince) {}
 
       return false;

[Killed] BooleanLiteral
src/middleware.js:301:13
 
         // A recipient MUST ignore the If-Unmodified-Since header field if the
         // received field-value is not a valid HTTP-date.
-        if (!Number.isNaN(unmodifiedSince)) {
+        if (Number.isNaN(unmodifiedSince)) {
           const lastModified = parseHttpDate(
             /** @type {string} */ (getResponseHeader(res, "Last-Modified")),
killedBy: connect framework: middleware lastModified should work and generate Last-Modified header should return the "200" code for the "GET" request to the bundle file with "Last-Modified" and "if-unmodified-s
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 412
Received: 200

[Timeout] ConditionalExpression
src/middleware.js:301:13
 
         // A recipient MUST ignore the If-Unmodified-Since header field if the
         // received field-value is not a valid HTTP-date.
-        if (!Number.isNaN(unmodifiedSince)) {
+        if (true) {
           const lastModified = parseHttpDate(
             /** @type {string} */ (getResponseHeader(res, "Last-Modified")),

[Killed] EqualityOperator
src/middleware.js:306:48
             /** @type {string} */ (getResponseHeader(res, "Last-Modified")),
           );
 
-          return Number.isNaN(lastModified) || lastModified > unmodifiedSince;
+          return Number.isNaN(lastModified) || lastModified >= unmodifiedSince;
         }
       }
killedBy: connect framework: middleware lastModified should work and generate Last-Modified header should return the "200" code for the "GET" request to the bundle file with "Last-Modified" and "if-unmodified-s
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 412
