[Timeout] LogicalOperator
src/middleware.js:306:18
             /** @type {string} */ (getResponseHeader(res, "Last-Modified")),
           );
 
-          return Number.isNaN(lastModified) || lastModified > unmodifiedSince;
+          return Number.isNaN(lastModified) && lastModified > unmodifiedSince;
         }
       }

[Timeout] BlockStatement
src/middleware.js:316:27
     /**
      * @returns {boolean} is cachable
      */
-    function isCachable() {
-      const statusCode = getStatusCode(res);
-      return (
-        (statusCode >= 200 && statusCode < 300) ||
-        statusCode === 304 ||
-        // For Koa and Hono, because by default status code is 404, but we already found a file
-        statusCode === 404
-      );
-    }
+    function isCachable() {}
 
     /**

[Killed] EqualityOperator
src/middleware.js:319:31
     function isCachable() {
       const statusCode = getStatusCode(res);
       return (
-        (statusCode >= 200 && statusCode < 300) ||
+        (statusCode >= 200 && statusCode >= 300) ||
         statusCode === 304 ||
         // For Koa and Hono, because by default status code is 404, but we already found a file
killedBy: connect framework: middleware etag should work and generate weak etag should return the "304" code for the "GET" request to the bundle file with etag and "if-none-match" header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 304
Received: 200

[Killed] ConditionalExpression
src/middleware.js:319:9
     function isCachable() {
       const statusCode = getStatusCode(res);
       return (
-        (statusCode >= 200 && statusCode < 300) ||
-        statusCode === 304 ||
+        false ||
         // For Koa and Hono, because by default status code is 404, but we already found a file
         statusCode === 404
killedBy: connect framework: middleware etag should work and generate weak etag should return the "304" code for the "GET" request to the bundle file with etag and "if-none-match" header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 304
Received: 200

[Timeout] EqualityOperator
src/middleware.js:320:9
       const statusCode = getStatusCode(res);
       return (
         (statusCode >= 200 && statusCode < 300) ||
-        statusCode === 304 ||
+        statusCode !== 304 ||
         // For Koa and Hono, because by default status code is 404, but we already found a file
         statusCode === 404

[Timeout] ConditionalExpression
src/middleware.js:320:9
       const statusCode = getStatusCode(res);
       return (
         (statusCode >= 200 && statusCode < 300) ||
-        statusCode === 304 ||
+        false ||
         // For Koa and Hono, because by default status code is 404, but we already found a file
         statusCode === 404

[Killed] EqualityOperator
src/middleware.js:322:9
         (statusCode >= 200 && statusCode < 300) ||
         statusCode === 304 ||
         // For Koa and Hono, because by default status code is 404, but we already found a file
-        statusCode === 404
+        // For Koa and Hono, because by default status code is 404, but we already found a file
+statusCode !== 404
       );
     }
killedBy: koa framework: middleware etag should work and generate weak etag should return the "304" code for the "GET" request to the bundle file with etag and "if-none-match" header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 304
Received: 200

[Timeout] ConditionalExpression
src/middleware.js:322:9
         (statusCode >= 200 && statusCode < 300) ||
         statusCode === 304 ||
         // For Koa and Hono, because by default status code is 404, but we already found a file
-        statusCode === 404
+        false
       );
     }

[Timeout] StringLiteral
src/middleware.js:335:32
       // https://tools.ietf.org/html/rfc2616#section-14.9.4
       const cacheControl =
         /** @type {string} */
-        (getRequestHeader(req, "cache-control"));
+        (getRequestHeader(req, ""));
 
       if (cacheControl && CACHE_CONTROL_NO_CACHE_REGEXP.test(cacheControl)) {

[Killed] ConditionalExpression
src/middleware.js:337:11
         /** @type {string} */
         (getRequestHeader(req, "cache-control"));
 
-      if (cacheControl && CACHE_CONTROL_NO_CACHE_REGEXP.test(cacheControl)) {
+      if (true) {
         return false;
       }
killedBy: connect framework: middleware etag should work and generate weak etag should return the "304" code for the "GET" request to the bundle file with etag and "if-none-match" header
statusReason: Error: listen EADDRINUSE: address already in use :::3000

[Survived] LogicalOperator
src/middleware.js:337:11
         /** @type {string} */
         (getRequestHeader(req, "cache-control"));
 
-      if (cacheControl && CACHE_CONTROL_NO_CACHE_REGEXP.test(cacheControl)) {
+      if (cacheControl || CACHE_CONTROL_NO_CACHE_REGEXP.test(cacheControl)) {
         return false;
       }

[Killed] BooleanLiteral
src/middleware.js:338:16
         (getRequestHeader(req, "cache-control"));
 
       if (cacheControl && CACHE_CONTROL_NO_CACHE_REGEXP.test(cacheControl)) {
-        return false;
+        return true;
       }
 
killedBy: connect framework: middleware etag should work and generate weak etag should return the "200" code for the "GET" request to the bundle file with etag and "if-match" and "cache-control: no-cache" heade
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 304

[Killed] BooleanLiteral
src/middleware.js:350:11
         (getRequestHeader(req, "if-modified-since"));
 
       // unconditional request
-      if (!noneMatch && !modifiedSince) {
+      if (noneMatch && !modifiedSince) {
         return false;
       }
killedBy: connect framework: middleware etag should work and generate weak etag should return the "304" code for the "GET" request to the bundle file with etag and "if-none-match" header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 304
Received: 200

[Timeout] BlockStatement
src/middleware.js:350:41
         (getRequestHeader(req, "if-modified-since"));
 
       // unconditional request
-      if (!noneMatch && !modifiedSince) {
-        return false;
-      }
+      if (!noneMatch && !modifiedSince) {}
 
       // if-none-match

[Timeout] BooleanLiteral
src/middleware.js:351:16
 
       // unconditional request
       if (!noneMatch && !modifiedSince) {
-        return false;
+        return true;
       }
 

[Timeout] EqualityOperator
src/middleware.js:355:24
       }
 
       // if-none-match
-      if (noneMatch && noneMatch !== "*") {
+      if (noneMatch && noneMatch === "*") {
         if (!resHeaders.etag) {
           return false;

[Timeout] LogicalOperator
src/middleware.js:355:11
       }
 
       // if-none-match
-      if (noneMatch && noneMatch !== "*") {
+      if (noneMatch || noneMatch !== "*") {
         if (!resHeaders.etag) {
           return false;

[Killed] ConditionalExpression
src/middleware.js:356:13
 
       // if-none-match
       if (noneMatch && noneMatch !== "*") {
-        if (!resHeaders.etag) {
+        if (true) {
           return false;
         }
killedBy: connect framework: middleware etag should work and generate weak etag should return the "304" code for the "GET" request to the bundle file with etag and "if-none-match" header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 304
Received: 200

[Timeout] ConditionalExpression
src/middleware.js:356:13
 
       // if-none-match
       if (noneMatch && noneMatch !== "*") {
-        if (!resHeaders.etag) {
+        if (false) {
           return false;
         }

[Timeout] BooleanLiteral
src/middleware.js:357:18
       // if-none-match
       if (noneMatch && noneMatch !== "*") {
         if (!resHeaders.etag) {
-          return false;
+          return true;
         }
 

[Timeout] BooleanLiteral
src/middleware.js:362:25
 
         const matches = parseTokenList(noneMatch);
 
-        let etagStale = true;
+        let etagStale = false;
 
         for (let i = 0; i < matches.length; i++) {

[Timeout] ConditionalExpression
src/middleware.js:364:25
 
         let etagStale = true;
 
-        for (let i = 0; i < matches.length; i++) {
+        for (let i = 0; false; i++) {
           const match = matches[i];
 

[Timeout] UpdateOperator
src/middleware.js:364:45
 
         let etagStale = true;
 
-        for (let i = 0; i < matches.length; i++) {
+        for (let i = 0; i < matches.length; i--) {
           const match = matches[i];
 

[Killed] LogicalOperator
src/middleware.js:368:13
           const match = matches[i];
 
           if (
-            match === resHeaders.etag ||
-            match === `W/${resHeaders.etag}` ||
+            match === resHeaders.etag && match === `W/${resHeaders.etag}` ||
             `W/${match}` === resHeaders.etag
           ) {
killedBy: connect framework: middleware etag should work and generate weak etag should return the "304" code for the "GET" request to the bundle file with etag and "if-none-match" header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 304
Received: 200

[Timeout] LogicalOperator
src/middleware.js:368:13
           const match = matches[i];
 
           if (
-            match === resHeaders.etag ||
-            match === `W/${resHeaders.etag}` ||
-            `W/${match}` === resHeaders.etag
+            (match === resHeaders.etag || match === `W/${resHeaders.etag}`) && `W/${match}` === resHeaders.etag
           ) {
             etagStale = false;

[Killed] EqualityOperator
src/middleware.js:369:13
 
           if (
             match === resHeaders.etag ||
-            match === `W/${resHeaders.etag}` ||
+            match !== `W/${resHeaders.etag}` ||
             `W/${match}` === resHeaders.etag
           ) {
killedBy: connect framework: middleware etag should work and generate weak etag should return the "304" code for the "GET" request to the bundle file with etag and "if-none-match" header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 304

[Survived] ConditionalExpression
src/middleware.js:369:13
 
           if (
             match === resHeaders.etag ||
-            match === `W/${resHeaders.etag}` ||
+            false ||
             `W/${match}` === resHeaders.etag
           ) {

[Timeout] EqualityOperator
src/middleware.js:370:13
           if (
             match === resHeaders.etag ||
             match === `W/${resHeaders.etag}` ||
-            `W/${match}` === resHeaders.etag
+            `W/${match}` !== resHeaders.etag
           ) {
             etagStale = false;

[Survived] ConditionalExpression
src/middleware.js:370:13
           if (
             match === resHeaders.etag ||
             match === `W/${resHeaders.etag}` ||
-            `W/${match}` === resHeaders.etag
+            false
           ) {
             etagStale = false;

[Timeout] BlockStatement
src/middleware.js:371:13
             match === resHeaders.etag ||
             match === `W/${resHeaders.etag}` ||
             `W/${match}` === resHeaders.etag
-          ) {
-            etagStale = false;
-            break;
-          }
+          ) {}
         }
 

[Killed] BooleanLiteral
src/middleware.js:372:25
             match === `W/${resHeaders.etag}` ||
             `W/${match}` === resHeaders.etag
           ) {
-            etagStale = false;
+            etagStale = true;
             break;
           }
killedBy: connect framework: middleware etag should work and generate weak etag should return the "304" code for the "GET" request to the bundle file with etag and "if-none-match" header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 304
Received: 200

[Killed] BlockStatement
src/middleware.js:377:24
           }
         }
 
-        if (etagStale) {
-          return false;
-        }
+        if (etagStale) {}
       }
 
killedBy: connect framework: middleware etag should work and generate weak etag should return the "304" code for the "GET" request to the bundle file with etag and "if-none-match" header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 304

[Timeout] ConditionalExpression
src/middleware.js:377:13
           }
         }
 
-        if (etagStale) {
+        if (false) {
           return false;
         }

[Timeout] BooleanLiteral
src/middleware.js:378:18
         }
 
         if (etagStale) {
-          return false;
+          return true;
         }
       }

[Killed] ConditionalExpression
src/middleware.js:385:11
       // A recipient MUST ignore If-Modified-Since if the request contains an If-None-Match header field;
       // the condition in If-None-Match is considered to be a more accurate replacement for the condition in If-Modified-Since,
       // and the two are only combined for the sake of interoperating with older intermediaries that might not implement If-None-Match.
-      if (noneMatch) {
+      if (true) {
         return true;
       }
killedBy: connect framework: middleware lastModified should work and generate Last-Modified header should return the "304" code for the "GET" request to the bundle file with "Last-Modified" and "if-modified-sin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 304

[Killed] BlockStatement
src/middleware.js:385:22
       // A recipient MUST ignore If-Modified-Since if the request contains an If-None-Match header field;
       // the condition in If-None-Match is considered to be a more accurate replacement for the condition in If-Modified-Since,
       // and the two are only combined for the sake of interoperating with older intermediaries that might not implement If-None-Match.
-      if (noneMatch) {
-        return true;
-      }
+      if (noneMatch) {}
 
       // if-modified-since
killedBy: connect framework: middleware lastModified should work and prefer "if-match" and "if-none-match" should return the "304" code for the "GET" request to the bundle file and prefer "if-none-match" over "
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 304
Received: 200

[Timeout] BooleanLiteral
src/middleware.js:386:16
       // the condition in If-None-Match is considered to be a more accurate replacement for the condition in If-Modified-Since,
       // and the two are only combined for the sake of interoperating with older intermediaries that might not implement If-None-Match.
       if (noneMatch) {
-        return true;
+        return false;
       }
 

[Killed] ConditionalExpression
src/middleware.js:390:11
       }
 
       // if-modified-since
-      if (modifiedSince) {
+      if (false) {
         const lastModified = resHeaders["last-modified"];
 
killedBy: connect framework: middleware lastModified should work and generate Last-Modified header should return the "304" code for the "GET" request to the bundle file with "Last-Modified" and "if-modified-sin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 304

[Timeout] BlockStatement
src/middleware.js:390:26
       }
 
       // if-modified-since
-      if (modifiedSince) {
-        const lastModified = resHeaders["last-modified"];
-
-        //  A recipient MUST ignore the If-Modified-Since header field if the
-        //  received field-value is not a valid HTTP-date, or if the request
-        //  method is neither GET nor HEAD.
-        const modifiedStale =
-          !lastModified ||
-          !(parseHttpDate(lastModified) <= parseHttpDate(modifiedSince));
-
-        if (modifiedStale) {
-          return false;
-        }
-      }
+      if (modifiedSince) {}
 
       return true;

[Killed] ConditionalExpression
src/middleware.js:397:11
         //  received field-value is not a valid HTTP-date, or if the request
         //  method is neither GET nor HEAD.
         const modifiedStale =
-          !lastModified ||
-          !(parseHttpDate(lastModified) <= parseHttpDate(modifiedSince));
+          true;
 
         if (modifiedStale) {
killedBy: connect framework: middleware lastModified should work and generate Last-Modified header should return the "304" code for the "GET" request to the bundle file with "Last-Modified" and "if-modified-sin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 304
Received: 200

[Killed] ConditionalExpression
src/middleware.js:397:11
         //  received field-value is not a valid HTTP-date, or if the request
         //  method is neither GET nor HEAD.
         const modifiedStale =
-          !lastModified ||
-          !(parseHttpDate(lastModified) <= parseHttpDate(modifiedSince));
+          false;
 
         if (modifiedStale) {
killedBy: connect framework: middleware lastModified should work and generate Last-Modified header should return the "304" code for the "GET" request to the bundle file with "Last-Modified" and "if-modified-sin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 304

[Killed] EqualityOperator
src/middleware.js:398:13
         //  method is neither GET nor HEAD.
         const modifiedStale =
           !lastModified ||
-          !(parseHttpDate(lastModified) <= parseHttpDate(modifiedSince));
+          !(parseHttpDate(lastModified) > parseHttpDate(modifiedSince));
 
         if (modifiedStale) {
killedBy: connect framework: middleware lastModified should work and generate Last-Modified header should return the "304" code for the "GET" request to the bundle file with "Last-Modified" and "if-modified-sin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 304
Received: 200

[Killed] ConditionalExpression
src/middleware.js:398:13
         //  method is neither GET nor HEAD.
         const modifiedStale =
           !lastModified ||
-          !(parseHttpDate(lastModified) <= parseHttpDate(modifiedSince));
+          !(true);
 
         if (modifiedStale) {
killedBy: connect framework: middleware lastModified should work and generate Last-Modified header should return the "304" code for the "GET" request to the bundle file with "Last-Modified" and "if-modified-sin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 304

[Timeout] ConditionalExpression
src/middleware.js:400:13
           !lastModified ||
           !(parseHttpDate(lastModified) <= parseHttpDate(modifiedSince));
 
-        if (modifiedStale) {
+        if (true) {
           return false;
         }

[Timeout] ConditionalExpression
src/middleware.js:400:13
           !lastModified ||
           !(parseHttpDate(lastModified) <= parseHttpDate(modifiedSince));
 
-        if (modifiedStale) {
+        if (false) {
           return false;
         }

[Killed] BooleanLiteral
src/middleware.js:401:18
           !(parseHttpDate(lastModified) <= parseHttpDate(modifiedSince));
 
         if (modifiedStale) {
-          return false;
+          return true;
         }
       }
killedBy: connect framework: middleware lastModified should work and generate Last-Modified header should return the "304" code for the "GET" request to the bundle file with "Last-Modified" and "if-modified-sin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 304

[Killed] ConditionalExpression
src/middleware.js:416:11
         /** @type {string | undefined} */
         (getRequestHeader(req, "if-range"));
 
-      if (!ifRange) {
+      if (true) {
         return true;
       }
killedBy: connect framework: middleware etag should work and generate weak etag should return the "206" code for the "GET" request with the valid range header and "if-range" header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 206

[Timeout] ConditionalExpression
src/middleware.js:416:11
         /** @type {string | undefined} */
         (getRequestHeader(req, "if-range"));
 
-      if (!ifRange) {
+      if (false) {
         return true;
       }

[Timeout] BooleanLiteral
src/middleware.js:417:16
         (getRequestHeader(req, "if-range"));
 
       if (!ifRange) {
-        return true;
+        return false;
       }
 

[Timeout] BlockStatement
src/middleware.js:421:34
       }
 
       // if-range as etag
-      if (ifRange.includes('"')) {
-        const etag =
-          /** @type {string | undefined} */
-          (getResponseHeader(res, "ETag"));
-
-        if (!etag) {
-          return true;
-        }
-
-        return Boolean(etag && ifRange.includes(etag));
-      }
+      if (ifRange.includes('"')) {}
 
       // if-range as modified date

[Timeout] ConditionalExpression
src/middleware.js:421:11
       }
 
       // if-range as etag
-      if (ifRange.includes('"')) {
+      if (true) {
         const etag =
           /** @type {string | undefined} */

[Killed] ConditionalExpression
src/middleware.js:426:13
           /** @type {string | undefined} */
           (getResponseHeader(res, "ETag"));
 
-        if (!etag) {
+        if (true) {
           return true;
         }
killedBy: connect framework: middleware etag should work and generate weak etag should return the "206" code for the "GET" request with the valid range header and "if-range" header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 206

[Timeout] BooleanLiteral
src/middleware.js:426:13
           /** @type {string | undefined} */
           (getResponseHeader(res, "ETag"));
 
-        if (!etag) {
+        if (etag) {
           return true;
         }

[NoCoverage] BooleanLiteral
src/middleware.js:427:18
           (getResponseHeader(res, "ETag"));
 
         if (!etag) {
-          return true;
+          return false;
         }
 

[Killed] ConditionalExpression
src/middleware.js:430:24
           return true;
         }
 
-        return Boolean(etag && ifRange.includes(etag));
+        return Boolean(true);
       }
 
killedBy: connect framework: middleware etag should work and generate weak etag should return the "206" code for the "GET" request with the valid range header and "if-range" header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 206

[Killed] LogicalOperator
src/middleware.js:430:24
           return true;
         }
 
-        return Boolean(etag && ifRange.includes(etag));
+        return Boolean(etag || ifRange.includes(etag));
       }
 
killedBy: connect framework: middleware etag should work and generate weak etag should return the "206" code for the "GET" request with the valid range header and "if-range" header
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 206

[Timeout] StringLiteral
src/middleware.js:436:33
       // if-range as modified date
       const lastModified =
         /** @type {string | undefined} */
-        (getResponseHeader(res, "Last-Modified"));
+        (getResponseHeader(res, ""));
 
       if (!lastModified) {

[NoCoverage] BlockStatement
src/middleware.js:438:26
         /** @type {string | undefined} */
         (getResponseHeader(res, "Last-Modified"));
 
-      if (!lastModified) {
-        return true;
-      }
+      if (!lastModified) {}
 
       return parseHttpDate(lastModified) <= parseHttpDate(ifRange);

[Timeout] ConditionalExpression
src/middleware.js:438:11
         /** @type {string | undefined} */
         (getResponseHeader(res, "Last-Modified"));
 
-      if (!lastModified) {
+      if (false) {
         return true;
       }

[NoCoverage] BooleanLiteral
src/middleware.js:439:16
         (getResponseHeader(res, "Last-Modified"));
 
       if (!lastModified) {
-        return true;
+        return false;
       }
 

[Timeout] EqualityOperator
src/middleware.js:442:14
         return true;
       }
 
-      return parseHttpDate(lastModified) <= parseHttpDate(ifRange);
+      return parseHttpDate(lastModified) < parseHttpDate(ifRange);
     }
 

[Timeout] EqualityOperator
src/middleware.js:442:14
         return true;
       }
 
-      return parseHttpDate(lastModified) <= parseHttpDate(ifRange);
+      return parseHttpDate(lastModified) > parseHttpDate(ifRange);
     }
 

[Timeout] BlockStatement
src/middleware.js:448:31
     /**
      * @returns {string | undefined} range header
      */
-    function getRangeHeader() {
-      const range = /** @type {string} */ (getRequestHeader(req, "range"));
-
-      if (range && BYTES_RANGE_REGEXP.test(range)) {
-        return range;
-      }
-
-      return undefined;
-    }
+    function getRangeHeader() {}
 
     /**

[Timeout] LogicalOperator
src/middleware.js:451:11
     function getRangeHeader() {
       const range = /** @type {string} */ (getRequestHeader(req, "range"));
 
-      if (range && BYTES_RANGE_REGEXP.test(range)) {
+      if (range || BYTES_RANGE_REGEXP.test(range)) {
         return range;
       }

[Timeout] ConditionalExpression
src/middleware.js:451:11
     function getRangeHeader() {
       const range = /** @type {string} */ (getRequestHeader(req, "range"));
 
-      if (range && BYTES_RANGE_REGEXP.test(range)) {
+      if (true) {
         return range;
       }

[Timeout] BlockStatement
src/middleware.js:462:46
      * @param {import("range-parser").Range} range range
      * @returns {[number, number]} offset and length
      */
-    function getOffsetAndLenFromRange(range) {
-      const offset = range.start;
-      const len = range.end - range.start + 1;
-
-      return [offset, len];
-    }
+    function getOffsetAndLenFromRange(range) {}
 
     /**

[Timeout] ArithmeticOperator
src/middleware.js:464:19
      */
     function getOffsetAndLenFromRange(range) {
       const offset = range.start;
-      const len = range.end - range.start + 1;
+      const len = range.end + range.start + 1;
 
       return [offset, len];

[Timeout] ArithmeticOperator
src/middleware.js:464:19
      */
     function getOffsetAndLenFromRange(range) {
       const offset = range.start;
-      const len = range.end - range.start + 1;
+      const len = range.end - range.start - 1;
 
       return [offset, len];

[Timeout] BlockStatement
src/middleware.js:474:43
      * @param {number} len len
      * @returns {[number, number]} start and end
      */
-    function calcStartAndEnd(offset, len) {
-      const start = offset;
-      const end = Math.max(offset, offset + len - 1);
-
-      return [start, end];
-    }
+    function calcStartAndEnd(offset, len) {}
 
     /**

[Timeout] ArithmeticOperator
src/middleware.js:476:36
      */
     function calcStartAndEnd(offset, len) {
       const start = offset;
-      const end = Math.max(offset, offset + len - 1);
+      const end = Math.max(offset, offset + len + 1);
 
       return [start, end];

[Timeout] ArithmeticOperator
src/middleware.js:476:36
      */
     function calcStartAndEnd(offset, len) {
       const start = offset;
-      const end = Math.max(offset, offset + len - 1);
+      const end = Math.max(offset, offset - len - 1);
 
       return [start, end];

[Timeout] ConditionalExpression
src/middleware.js:494:11
         extra,
       );
 
-      if (extra.errorCode) {
+      if (false) {
         if (extra.errorCode === 403) {
           context.logger.error(`Malicious path "${filename}".`);

[Timeout] ConditionalExpression
src/middleware.js:494:11
         extra,
       );
 
-      if (extra.errorCode) {
+      if (true) {
         if (extra.errorCode === 403) {
           context.logger.error(`Malicious path "${filename}".`);

[Timeout] EqualityOperator
src/middleware.js:495:13
       );
 
       if (extra.errorCode) {
-        if (extra.errorCode === 403) {
+        if (extra.errorCode !== 403) {
           context.logger.error(`Malicious path "${filename}".`);
         }

[Timeout] BlockStatement
src/middleware.js:495:38
       );
 
       if (extra.errorCode) {
-        if (extra.errorCode === 403) {
-          context.logger.error(`Malicious path "${filename}".`);
-        }
+        if (extra.errorCode === 403) {}
 
         sendError(extra.errorCode, {

[Timeout] StringLiteral
src/middleware.js:496:32
 
       if (extra.errorCode) {
         if (extra.errorCode === 403) {
-          context.logger.error(`Malicious path "${filename}".`);
+          context.logger.error(``);
         }
 

[Timeout] BooleanLiteral
src/middleware.js:506:11
         return;
       }
 
-      if (!filename) {
+      if (filename) {
         await goNext();
         return;

[Timeout] BlockStatement
src/middleware.js:506:22
         return;
       }
 
-      if (!filename) {
-        await goNext();
-        return;
-      }
+      if (!filename) {}
 
       if (getHeadersSent(res)) {

[Timeout] ConditionalExpression
src/middleware.js:511:11
         return;
       }
 
-      if (getHeadersSent(res)) {
+      if (true) {
         await goNext();
         return;

[Timeout] BlockStatement
src/middleware.js:511:32
         return;
       }
 
-      if (getHeadersSent(res)) {
-        await goNext();
-        return;
-      }
+      if (getHeadersSent(res)) {}
 
       const { size } = /** @type {import("fs").Stats} */ (extra.stats);

[Timeout] ConditionalExpression
src/middleware.js:522:11
       let offset = 0;
 
       // Send logic
-      if (context.options.headers) {
+      if (false) {
         let { headers } = context.options;
 

[Timeout] ConditionalExpression
src/middleware.js:522:11
       let offset = 0;
 
       // Send logic
-      if (context.options.headers) {
+      if (true) {
         let { headers } = context.options;
 
