[Timeout] EqualityOperator
src/middleware.js:525:13
       if (context.options.headers) {
         let { headers } = context.options;
 
-        if (typeof headers === "function") {
+        if (typeof headers !== "function") {
           headers = /** @type {NormalizedHeaders} */ (
             headers(req, res, context)

[Timeout] ConditionalExpression
src/middleware.js:525:13
       if (context.options.headers) {
         let { headers } = context.options;
 
-        if (typeof headers === "function") {
+        if (true) {
           headers = /** @type {NormalizedHeaders} */ (
             headers(req, res, context)

[Killed] EqualityOperator
src/middleware.js:536:13
          */
         const allHeaders = [];
 
-        if (typeof headers !== "undefined") {
+        if (typeof headers === "undefined") {
           if (!Array.isArray(headers)) {
             for (const name in headers) {
killedBy: connect framework: middleware headers option works with object should return the "200" code for the "GET" request to the bundle file and return headers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "yes"
Received: undefined

[Timeout] BlockStatement
src/middleware.js:536:45
          */
         const allHeaders = [];
 
-        if (typeof headers !== "undefined") {
-          if (!Array.isArray(headers)) {
-            for (const name in headers) {
-              allHeaders.push({ key: name, value: headers[name] });
-            }
-
-            headers = allHeaders;
-          }
-
-          for (const { key, value } of headers) {
-            setResponseHeader(res, key, value);
-          }
-        }
+        if (typeof headers !== "undefined") {}
       }
 

[Timeout] ConditionalExpression
src/middleware.js:537:15
         const allHeaders = [];
 
         if (typeof headers !== "undefined") {
-          if (!Array.isArray(headers)) {
+          if (false) {
             for (const name in headers) {
               allHeaders.push({ key: name, value: headers[name] });

[Timeout] BlockStatement
src/middleware.js:537:40
         const allHeaders = [];
 
         if (typeof headers !== "undefined") {
-          if (!Array.isArray(headers)) {
-            for (const name in headers) {
-              allHeaders.push({ key: name, value: headers[name] });
-            }
-
-            headers = allHeaders;
-          }
+          if (!Array.isArray(headers)) {}
 
           for (const { key, value } of headers) {

[Timeout] BlockStatement
src/middleware.js:538:41
 
         if (typeof headers !== "undefined") {
           if (!Array.isArray(headers)) {
-            for (const name in headers) {
-              allHeaders.push({ key: name, value: headers[name] });
-            }
+            for (const name in headers) {}
 
             headers = allHeaders;

[Timeout] BlockStatement
src/middleware.js:545:49
             headers = allHeaders;
           }
 
-          for (const { key, value } of headers) {
-            setResponseHeader(res, key, value);
-          }
+          for (const { key, value } of headers) {}
         }
       }

[Timeout] ConditionalExpression
src/middleware.js:551:11
         }
       }
 
-      if (!getResponseHeader(res, "Accept-Ranges")) {
+      if (true) {
         setResponseHeader(res, "Accept-Ranges", "bytes");
       }

[Timeout] ConditionalExpression
src/middleware.js:551:11
         }
       }
 
-      if (!getResponseHeader(res, "Accept-Ranges")) {
+      if (false) {
         setResponseHeader(res, "Accept-Ranges", "bytes");
       }

[Timeout] StringLiteral
src/middleware.js:552:32
       }
 
       if (!getResponseHeader(res, "Accept-Ranges")) {
-        setResponseHeader(res, "Accept-Ranges", "bytes");
+        setResponseHeader(res, "", "bytes");
       }
 

[Timeout] ConditionalExpression
src/middleware.js:555:11
         setResponseHeader(res, "Accept-Ranges", "bytes");
       }
 
-      if (!getResponseHeader(res, "Cache-Control")) {
+      if (false) {
         // TODO enable the `cacheImmutable` by default for the next major release
         const cacheControl =

[Timeout] ConditionalExpression
src/middleware.js:555:11
         setResponseHeader(res, "Accept-Ranges", "bytes");
       }
 
-      if (!getResponseHeader(res, "Cache-Control")) {
+      if (true) {
         // TODO enable the `cacheImmutable` by default for the next major release
         const cacheControl =

[Timeout] ConditionalExpression
src/middleware.js:558:11
       if (!getResponseHeader(res, "Cache-Control")) {
         // TODO enable the `cacheImmutable` by default for the next major release
         const cacheControl =
-          context.options.cacheImmutable && extra.immutable
+          false
             ? { immutable: true }
             : context.options.cacheControl;

[Timeout] ConditionalExpression
src/middleware.js:558:11
       if (!getResponseHeader(res, "Cache-Control")) {
         // TODO enable the `cacheImmutable` by default for the next major release
         const cacheControl =
-          context.options.cacheImmutable && extra.immutable
+          true
             ? { immutable: true }
             : context.options.cacheControl;

[Timeout] BooleanLiteral
src/middleware.js:559:28
         // TODO enable the `cacheImmutable` by default for the next major release
         const cacheControl =
           context.options.cacheImmutable && extra.immutable
-            ? { immutable: true }
+            ? { immutable: false }
             : context.options.cacheControl;
 

[Timeout] ConditionalExpression
src/middleware.js:562:13
             ? { immutable: true }
             : context.options.cacheControl;
 
-        if (cacheControl) {
+        if (true) {
           let cacheControlValue;
 

[Timeout] ConditionalExpression
src/middleware.js:562:13
             ? { immutable: true }
             : context.options.cacheControl;
 
-        if (cacheControl) {
+        if (false) {
           let cacheControlValue;
 

[Timeout] EqualityOperator
src/middleware.js:565:15
         if (cacheControl) {
           let cacheControlValue;
 
-          if (typeof cacheControl === "boolean") {
+          if (typeof cacheControl !== "boolean") {
             cacheControlValue = "public, max-age=31536000";
           } else if (typeof cacheControl === "number") {

[Timeout] ConditionalExpression
src/middleware.js:565:15
         if (cacheControl) {
           let cacheControlValue;
 
-          if (typeof cacheControl === "boolean") {
+          if (true) {
             cacheControlValue = "public, max-age=31536000";
           } else if (typeof cacheControl === "number") {

[Timeout] StringLiteral
src/middleware.js:566:33
           let cacheControlValue;
 
           if (typeof cacheControl === "boolean") {
-            cacheControlValue = "public, max-age=31536000";
+            cacheControlValue = "";
           } else if (typeof cacheControl === "number") {
             const maxAge = Math.floor(

[Timeout] ConditionalExpression
src/middleware.js:567:22
 
           if (typeof cacheControl === "boolean") {
             cacheControlValue = "public, max-age=31536000";
-          } else if (typeof cacheControl === "number") {
+          } else if (false) {
             const maxAge = Math.floor(
               Math.min(Math.max(0, cacheControl), MAX_MAX_AGE) / 1000,

[Timeout] EqualityOperator
src/middleware.js:567:22
 
           if (typeof cacheControl === "boolean") {
             cacheControlValue = "public, max-age=31536000";
-          } else if (typeof cacheControl === "number") {
+          } else if (typeof cacheControl !== "number") {
             const maxAge = Math.floor(
               Math.min(Math.max(0, cacheControl), MAX_MAX_AGE) / 1000,

[Killed] MethodExpression
src/middleware.js:569:24
             cacheControlValue = "public, max-age=31536000";
           } else if (typeof cacheControl === "number") {
             const maxAge = Math.floor(
-              Math.min(Math.max(0, cacheControl), MAX_MAX_AGE) / 1000,
+              Math.min(Math.min(0, cacheControl), MAX_MAX_AGE) / 1000,
             );
 
killedBy: connect framework: middleware cacheControl should work and generate `Cache-Control` header when it is a number should return the "200" code for the "GET" request to the bundle file and don't generate 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "public, max-age=100"
Received: "public, max-age=0"

[Timeout] MethodExpression
src/middleware.js:569:15
             cacheControlValue = "public, max-age=31536000";
           } else if (typeof cacheControl === "number") {
             const maxAge = Math.floor(
-              Math.min(Math.max(0, cacheControl), MAX_MAX_AGE) / 1000,
+              Math.max(Math.max(0, cacheControl), MAX_MAX_AGE) / 1000,
             );
 

[Timeout] StringLiteral
src/middleware.js:572:33
               Math.min(Math.max(0, cacheControl), MAX_MAX_AGE) / 1000,
             );
 
-            cacheControlValue = `public, max-age=${maxAge}`;
+            cacheControlValue = ``;
           } else if (typeof cacheControl === "string") {
             cacheControlValue = cacheControl;

[Timeout] EqualityOperator
src/middleware.js:573:22
             );
 
             cacheControlValue = `public, max-age=${maxAge}`;
-          } else if (typeof cacheControl === "string") {
+          } else if (typeof cacheControl !== "string") {
             cacheControlValue = cacheControl;
           } else {

[Timeout] ConditionalExpression
src/middleware.js:573:22
             );
 
             cacheControlValue = `public, max-age=${maxAge}`;
-          } else if (typeof cacheControl === "string") {
+          } else if (true) {
             cacheControlValue = cacheControl;
           } else {

[Timeout] BlockStatement
src/middleware.js:575:18
             cacheControlValue = `public, max-age=${maxAge}`;
           } else if (typeof cacheControl === "string") {
             cacheControlValue = cacheControl;
-          } else {
-            const maxAge = cacheControl.maxAge
-              ? Math.floor(
-                  Math.min(Math.max(0, cacheControl.maxAge), MAX_MAX_AGE) /
-                    1000,
-                )
-              : MAX_MAX_AGE / 1000;
-
-            cacheControlValue = `public, max-age=${maxAge}`;
-
-            if (cacheControl.immutable) {
-              cacheControlValue += ", immutable";
-            }
-          }
+          } else {}
 
           setResponseHeader(res, "Cache-Control", cacheControlValue);

[Timeout] ArithmeticOperator
src/middleware.js:578:19
           } else {
             const maxAge = cacheControl.maxAge
               ? Math.floor(
-                  Math.min(Math.max(0, cacheControl.maxAge), MAX_MAX_AGE) /
-                    1000,
+                  Math.min(Math.max(0, cacheControl.maxAge), MAX_MAX_AGE) * 1000,
                 )
               : MAX_MAX_AGE / 1000;

[Timeout] MethodExpression
src/middleware.js:578:28
           } else {
             const maxAge = cacheControl.maxAge
               ? Math.floor(
-                  Math.min(Math.max(0, cacheControl.maxAge), MAX_MAX_AGE) /
+                  Math.min(Math.min(0, cacheControl.maxAge), MAX_MAX_AGE) /
                     1000,
                 )

[Timeout] ArithmeticOperator
src/middleware.js:581:17
                   Math.min(Math.max(0, cacheControl.maxAge), MAX_MAX_AGE) /
                     1000,
                 )
-              : MAX_MAX_AGE / 1000;
+              : MAX_MAX_AGE * 1000;
 
             cacheControlValue = `public, max-age=${maxAge}`;

[Timeout] BlockStatement
src/middleware.js:585:41
 
             cacheControlValue = `public, max-age=${maxAge}`;
 
-            if (cacheControl.immutable) {
-              cacheControlValue += ", immutable";
-            }
+            if (cacheControl.immutable) {}
           }
 

[Timeout] ConditionalExpression
src/middleware.js:585:17
 
             cacheControlValue = `public, max-age=${maxAge}`;
 
-            if (cacheControl.immutable) {
+            if (true) {
               cacheControlValue += ", immutable";
             }

[Timeout] ConditionalExpression
src/middleware.js:595:9
       }
 
       if (
-        context.options.lastModified &&
-        !getResponseHeader(res, "Last-Modified")
+        true
       ) {
         const modified =

[Timeout] ConditionalExpression
src/middleware.js:595:9
       }
 
       if (
-        context.options.lastModified &&
-        !getResponseHeader(res, "Last-Modified")
+        false
       ) {
         const modified =

[Timeout] BooleanLiteral
src/middleware.js:596:9
 
       if (
         context.options.lastModified &&
-        !getResponseHeader(res, "Last-Modified")
+        getResponseHeader(res, "Last-Modified")
       ) {
         const modified =

[Timeout] StringLiteral
src/middleware.js:596:33
 
       if (
         context.options.lastModified &&
-        !getResponseHeader(res, "Last-Modified")
+        !getResponseHeader(res, "")
       ) {
         const modified =

[Timeout] BlockStatement
src/middleware.js:597:9
       if (
         context.options.lastModified &&
         !getResponseHeader(res, "Last-Modified")
-      ) {
-        const modified =
-          /** @type {import("fs").Stats} */
-          (extra.stats).mtime.toUTCString();
-
-        setResponseHeader(res, "Last-Modified", modified);
-      }
+      ) {}
 
       /** @type {number} */

[Timeout] ConditionalExpression
src/middleware.js:617:11
 
       const rangeHeader = getRangeHeader();
 
-      if (context.options.etag && !getResponseHeader(res, "ETag")) {
+      if (true) {
         /** @type {import("fs").Stats | Buffer | ReadStream | undefined} */
         let value;

[Timeout] BooleanLiteral
src/middleware.js:617:35
 
       const rangeHeader = getRangeHeader();
 
-      if (context.options.etag && !getResponseHeader(res, "ETag")) {
+      if (context.options.etag && getResponseHeader(res, "ETag")) {
         /** @type {import("fs").Stats | Buffer | ReadStream | undefined} */
         let value;

[Killed] EqualityOperator
src/middleware.js:622:13
         let value;
 
         // TODO cache etag generation?
-        if (context.options.etag === "weak") {
+        if (context.options.etag !== "weak") {
           value = /** @type {import("fs").Stats} */ (extra.stats);
         } else {
killedBy: connect framework: middleware etag should work and generate weak etag should return the "200" code for the "GET" request to the bundle file and set weak etag
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Timeout] ConditionalExpression
src/middleware.js:622:13
         let value;
 
         // TODO cache etag generation?
-        if (context.options.etag === "weak") {
+        if (false) {
           value = /** @type {import("fs").Stats} */ (extra.stats);
         } else {

[NoCoverage] ConditionalExpression
src/middleware.js:625:15
         if (context.options.etag === "weak") {
           value = /** @type {import("fs").Stats} */ (extra.stats);
         } else {
-          if (rangeHeader) {
+          if (false) {
             const parsedRanges =
               /** @type {import("range-parser").Ranges | import("range-parser").Result} */

[NoCoverage] BlockStatement
src/middleware.js:625:28
         if (context.options.etag === "weak") {
           value = /** @type {import("fs").Stats} */ (extra.stats);
         } else {
-          if (rangeHeader) {
-            const parsedRanges =
-              /** @type {import("range-parser").Ranges | import("range-parser").Result} */
-              (parseRangeHeaders(`${size}|${rangeHeader}`));
-
-            if (
-              parsedRanges !== -2 &&
-              parsedRanges !== -1 &&
-              parsedRanges.length === 1
-            ) {
-              [offset, len] = getOffsetAndLenFromRange(parsedRanges[0]);
-            }
-          }
+          if (rangeHeader) {}
 
           [start, end] = calcStartAndEnd(offset, len);

[NoCoverage] StringLiteral
src/middleware.js:628:34
           if (rangeHeader) {
             const parsedRanges =
               /** @type {import("range-parser").Ranges | import("range-parser").Result} */
-              (parseRangeHeaders(`${size}|${rangeHeader}`));
+              (parseRangeHeaders(``));
 
             if (

[NoCoverage] EqualityOperator
src/middleware.js:631:15
               (parseRangeHeaders(`${size}|${rangeHeader}`));
 
             if (
-              parsedRanges !== -2 &&
+              parsedRanges === -2 &&
               parsedRanges !== -1 &&
               parsedRanges.length === 1

[NoCoverage] ConditionalExpression
src/middleware.js:631:15
               (parseRangeHeaders(`${size}|${rangeHeader}`));
 
             if (
-              parsedRanges !== -2 &&
-              parsedRanges !== -1 &&
-              parsedRanges.length === 1
+              false
             ) {
               [offset, len] = getOffsetAndLenFromRange(parsedRanges[0]);

[NoCoverage] ConditionalExpression
src/middleware.js:632:15
 
             if (
               parsedRanges !== -2 &&
-              parsedRanges !== -1 &&
+              true &&
               parsedRanges.length === 1
             ) {

[NoCoverage] EqualityOperator
src/middleware.js:632:15
 
             if (
               parsedRanges !== -2 &&
-              parsedRanges !== -1 &&
+              parsedRanges === -1 &&
               parsedRanges.length === 1
             ) {

[NoCoverage] EqualityOperator
src/middleware.js:633:15
             if (
               parsedRanges !== -2 &&
               parsedRanges !== -1 &&
-              parsedRanges.length === 1
+              parsedRanges.length !== 1
             ) {
               [offset, len] = getOffsetAndLenFromRange(parsedRanges[0]);

[NoCoverage] ConditionalExpression
src/middleware.js:633:15
             if (
               parsedRanges !== -2 &&
               parsedRanges !== -1 &&
-              parsedRanges.length === 1
+              true
             ) {
               [offset, len] = getOffsetAndLenFromRange(parsedRanges[0]);

[NoCoverage] BlockStatement
src/middleware.js:634:15
               parsedRanges !== -2 &&
               parsedRanges !== -1 &&
               parsedRanges.length === 1
-            ) {
-              [offset, len] = getOffsetAndLenFromRange(parsedRanges[0]);
-            }
+            ) {}
           }
 

[NoCoverage] BlockStatement
src/middleware.js:641:15
 
           [start, end] = calcStartAndEnd(offset, len);
 
-          try {
-            const result = createReadStreamOrReadFileSync(
-              filename,
-              context.outputFileSystem,
-              start,
-              end,
-            );
-
-            value = result.bufferOrStream;
-            ({ bufferOrStream, byteLength } = result);
-          } catch (error) {
+          try {} catch (error) {
             errorHandler(/** @type {NodeJS.ErrnoException} */ (error));
             await goNext();

[NoCoverage] BlockStatement
src/middleware.js:651:27
 
             value = result.bufferOrStream;
             ({ bufferOrStream, byteLength } = result);
-          } catch (error) {
-            errorHandler(/** @type {NodeJS.ErrnoException} */ (error));
-            await goNext();
-            return;
-          }
+          } catch (error) {}
         }
 

[Timeout] BlockStatement
src/middleware.js:658:20
           }
         }
 
-        if (value) {
-          const result = await require("./utils/etag")(value);
-
-          // Because we already read stream, we can cache buffer to avoid extra read from fs
-          if (result.buffer) {
-            bufferOrStream = result.buffer;
-          }
-
-          setResponseHeader(res, "ETag", result.hash);
-        }
+        if (value) {}
       }
 

[Timeout] ConditionalExpression
src/middleware.js:658:13
           }
         }
 
-        if (value) {
+        if (true) {
           const result = await require("./utils/etag")(value);
 

[Timeout] ConditionalExpression
src/middleware.js:662:15
           const result = await require("./utils/etag")(value);
 
           // Because we already read stream, we can cache buffer to avoid extra read from fs
-          if (result.buffer) {
+          if (true) {
             bufferOrStream = result.buffer;
           }

[NoCoverage] BlockStatement
src/middleware.js:662:30
           const result = await require("./utils/etag")(value);
 
           // Because we already read stream, we can cache buffer to avoid extra read from fs
-          if (result.buffer) {
-            bufferOrStream = result.buffer;
-          }
+          if (result.buffer) {}
 
           setResponseHeader(res, "ETag", result.hash);

[Timeout] ConditionalExpression
src/middleware.js:671:9
       }
 
       if (
-        !getResponseHeader(res, "Content-Type") ||
-        getStatusCode(res) === 404
+        true
       ) {
         removeResponseHeader(res, "Content-Type");

[Timeout] LogicalOperator
src/middleware.js:671:9
       }
 
       if (
-        !getResponseHeader(res, "Content-Type") ||
-        getStatusCode(res) === 404
+        !getResponseHeader(res, "Content-Type") && getStatusCode(res) === 404
       ) {
         removeResponseHeader(res, "Content-Type");

[Timeout] EqualityOperator
src/middleware.js:672:9
 
       if (
         !getResponseHeader(res, "Content-Type") ||
-        getStatusCode(res) === 404
+        getStatusCode(res) !== 404
       ) {
         removeResponseHeader(res, "Content-Type");

[Timeout] ConditionalExpression
src/middleware.js:672:9
 
       if (
         !getResponseHeader(res, "Content-Type") ||
-        getStatusCode(res) === 404
+        false
       ) {
         removeResponseHeader(res, "Content-Type");

[Timeout] BlockStatement
src/middleware.js:673:9
       if (
         !getResponseHeader(res, "Content-Type") ||
         getStatusCode(res) === 404
-      ) {
-        removeResponseHeader(res, "Content-Type");
-        // content-type name(like application/javascript; charset=utf-8) or false
-        const contentType = mime.contentType(path.extname(filename));
-
-        // Only set content-type header if media type is known
-        // https://tools.ietf.org/html/rfc7231#section-3.1.1.5
-        if (contentType) {
-          setResponseHeader(res, "Content-Type", contentType);
-        } else if (context.options.mimeTypeDefault) {
-          setResponseHeader(
-            res,
-            "Content-Type",
-            context.options.mimeTypeDefault,
-          );
-        }
-      }
+      ) {}
 
       // Conditional GET support

[Timeout] BlockStatement
src/middleware.js:680:26
 
         // Only set content-type header if media type is known
         // https://tools.ietf.org/html/rfc7231#section-3.1.1.5
-        if (contentType) {
-          setResponseHeader(res, "Content-Type", contentType);
-        } else if (context.options.mimeTypeDefault) {
+        if (contentType) {} else if (context.options.mimeTypeDefault) {
           setResponseHeader(
             res,

[Timeout] ConditionalExpression
src/middleware.js:680:13
 
         // Only set content-type header if media type is known
         // https://tools.ietf.org/html/rfc7231#section-3.1.1.5
-        if (contentType) {
+        if (true) {
           setResponseHeader(res, "Content-Type", contentType);
         } else if (context.options.mimeTypeDefault) {

[Timeout] StringLiteral
src/middleware.js:681:34
         // Only set content-type header if media type is known
         // https://tools.ietf.org/html/rfc7231#section-3.1.1.5
         if (contentType) {
-          setResponseHeader(res, "Content-Type", contentType);
+          setResponseHeader(res, "", contentType);
         } else if (context.options.mimeTypeDefault) {
           setResponseHeader(

[Timeout] BlockStatement
src/middleware.js:682:53
         // https://tools.ietf.org/html/rfc7231#section-3.1.1.5
         if (contentType) {
           setResponseHeader(res, "Content-Type", contentType);
-        } else if (context.options.mimeTypeDefault) {
-          setResponseHeader(
-            res,
-            "Content-Type",
-            context.options.mimeTypeDefault,
-          );
-        }
+        } else if (context.options.mimeTypeDefault) {}
       }
 

[Timeout] ConditionalExpression
src/middleware.js:682:20
         // https://tools.ietf.org/html/rfc7231#section-3.1.1.5
         if (contentType) {
           setResponseHeader(res, "Content-Type", contentType);
-        } else if (context.options.mimeTypeDefault) {
+        } else if (true) {
           setResponseHeader(
             res,

[Timeout] StringLiteral
src/middleware.js:685:13
         } else if (context.options.mimeTypeDefault) {
           setResponseHeader(
             res,
-            "Content-Type",
+            "",
             context.options.mimeTypeDefault,
           );

[Timeout] ConditionalExpression
src/middleware.js:692:11
       }
 
       // Conditional GET support
-      if (isConditionalGET()) {
+      if (false) {
         if (isPreconditionFailure()) {
           sendError(412, {

[Timeout] ConditionalExpression
src/middleware.js:692:11
       }
 
       // Conditional GET support
-      if (isConditionalGET()) {
+      if (true) {
         if (isPreconditionFailure()) {
           sendError(412, {

[Timeout] ConditionalExpression
src/middleware.js:693:13
 
       // Conditional GET support
       if (isConditionalGET()) {
-        if (isPreconditionFailure()) {
+        if (false) {
           sendError(412, {
             modifyResponseData: context.options.modifyResponseData,

[Timeout] BlockStatement
src/middleware.js:693:38
 
       // Conditional GET support
       if (isConditionalGET()) {
-        if (isPreconditionFailure()) {
-          sendError(412, {
-            modifyResponseData: context.options.modifyResponseData,
-          });
-          await goNext();
-          return;
-        }
+        if (isPreconditionFailure()) {}
 
         if (

[Timeout] ObjectLiteral
src/middleware.js:694:26
       // Conditional GET support
       if (isConditionalGET()) {
         if (isPreconditionFailure()) {
-          sendError(412, {
-            modifyResponseData: context.options.modifyResponseData,
-          });
+          sendError(412, {});
           await goNext();
           return;

[Timeout] LogicalOperator
src/middleware.js:702:11
         }
 
         if (
-          isCachable() &&
-          isFresh({
-            etag: /** @type {string | undefined} */ (
-              getResponseHeader(res, "ETag")
-            ),
-            "last-modified":
-              /** @type {string | undefined} */
-              (getResponseHeader(res, "Last-Modified")),
-          })
+          isCachable() || isFresh({
+  etag: (/** @type {string | undefined} */
+  getResponseHeader(res, "ETag")),
+  "last-modified": (/** @type {string | undefined} */
+  getResponseHeader(res, "Last-Modified"))
+})
         ) {
           setStatusCode(res, 304);

[Timeout] ConditionalExpression
src/middleware.js:702:11
         }
 
         if (
-          isCachable() &&
-          isFresh({
-            etag: /** @type {string | undefined} */ (
-              getResponseHeader(res, "ETag")
-            ),
-            "last-modified":
-              /** @type {string | undefined} */
-              (getResponseHeader(res, "Last-Modified")),
-          })
+          false
         ) {
           setStatusCode(res, 304);

[Timeout] StringLiteral
src/middleware.js:709:39
             ),
             "last-modified":
               /** @type {string | undefined} */
-              (getResponseHeader(res, "Last-Modified")),
+              (getResponseHeader(res, "")),
           })
         ) {

[Timeout] BlockStatement
src/middleware.js:711:11
               /** @type {string | undefined} */
               (getResponseHeader(res, "Last-Modified")),
           })
-        ) {
-          setStatusCode(res, 304);
-
-          // Remove content header fields
-          removeResponseHeader(res, "Content-Encoding");
-          removeResponseHeader(res, "Content-Language");
-          removeResponseHeader(res, "Content-Length");
-          removeResponseHeader(res, "Content-Range");
-          removeResponseHeader(res, "Content-Type");
-
-          finish(res);
-          await goNext();
-          return;
-        }
+        ) {}
       }
 

[Timeout] StringLiteral
src/middleware.js:715:37
           setStatusCode(res, 304);
 
           // Remove content header fields
-          removeResponseHeader(res, "Content-Encoding");
+          removeResponseHeader(res, "");
           removeResponseHeader(res, "Content-Language");
           removeResponseHeader(res, "Content-Length");

[Timeout] StringLiteral
src/middleware.js:716:37
 
           // Remove content header fields
           removeResponseHeader(res, "Content-Encoding");
-          removeResponseHeader(res, "Content-Language");
+          removeResponseHeader(res, "");
           removeResponseHeader(res, "Content-Length");
           removeResponseHeader(res, "Content-Range");

[Timeout] StringLiteral
src/middleware.js:717:37
           // Remove content header fields
           removeResponseHeader(res, "Content-Encoding");
           removeResponseHeader(res, "Content-Language");
-          removeResponseHeader(res, "Content-Length");
+          removeResponseHeader(res, "");
           removeResponseHeader(res, "Content-Range");
           removeResponseHeader(res, "Content-Type");

[Timeout] BooleanLiteral
src/middleware.js:727:30
         }
       }
 
-      let isPartialContent = false;
+      let isPartialContent = true;
 
       if (rangeHeader) {
