[Timeout] BlockStatement
src/utils/getPaths.js:26:45
   /** @type {{ outputPath: string, publicPath: string, assetsInfo: Asset["info"] }[]} */
   const publicPaths = [];
 
-  for (const { compilation } of childStats) {
-    if (compilation.options.devServer === false) {
-      continue;
-    }
-
-    // The `output.path` is always present and always absolute
-    const outputPath = compilation.getPath(
-      compilation.outputOptions.path || "",
-    );
-    const publicPath = options.publicPath
-      ? compilation.getPath(options.publicPath)
-      : compilation.outputOptions.publicPath
-        ? compilation.getPath(compilation.outputOptions.publicPath)
-        : "";
-
-    publicPaths.push({
-      outputPath,
-      publicPath,
-      assetsInfo: compilation.assetsInfo,
-    });
-  }
+  for (const { compilation } of childStats) {}
 
   return publicPaths;

[Timeout] ConditionalExpression
src/utils/getPaths.js:27:9
   const publicPaths = [];
 
   for (const { compilation } of childStats) {
-    if (compilation.options.devServer === false) {
+    if (true) {
       continue;
     }

[Timeout] EqualityOperator
src/utils/getPaths.js:27:9
   const publicPaths = [];
 
   for (const { compilation } of childStats) {
-    if (compilation.options.devServer === false) {
+    if (compilation.options.devServer !== false) {
       continue;
     }

[Timeout] LogicalOperator
src/utils/getPaths.js:33:7
 
     // The `output.path` is always present and always absolute
     const outputPath = compilation.getPath(
-      compilation.outputOptions.path || "",
+      compilation.outputOptions.path && "",
     );
     const publicPath = options.publicPath

[Timeout] ConditionalExpression
src/utils/getPaths.js:33:7
 
     // The `output.path` is always present and always absolute
     const outputPath = compilation.getPath(
-      compilation.outputOptions.path || "",
+      true,
     );
     const publicPath = options.publicPath
