[Timeout] BlockStatement
src/utils/setupHooks.js:22:22
   /**
    * @returns {void}
    */
-  function invalid() {
-    if (context.state) {
-      context.logger.log("Compilation starting...");
-    }
-
-    // We are now in invalid state
-
-    context.state = false;
-
-    context.stats = undefined;
-  }
+  function invalid() {}
 
   /**

[Timeout] BlockStatement
src/utils/setupHooks.js:23:24
    * @returns {void}
    */
   function invalid() {
-    if (context.state) {
-      context.logger.log("Compilation starting...");
-    }
+    if (context.state) {}
 
     // We are now in invalid state

[Timeout] ConditionalExpression
src/utils/setupHooks.js:23:9
    * @returns {void}
    */
   function invalid() {
-    if (context.state) {
+    if (false) {
       context.logger.log("Compilation starting...");
     }

[Killed] StringLiteral
src/utils/setupHooks.js:24:26
    */
   function invalid() {
     if (context.state) {
-      context.logger.log("Compilation starting...");
+      context.logger.log("");
     }
 
killedBy: setupHooks logs if state is set on invalidate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Compilation starting..."
Received: ""

[Timeout] BooleanLiteral
src/utils/setupHooks.js:29:21
 
     // We are now in invalid state
 
-    context.state = false;
+    context.state = true;
 
     context.stats = undefined;

[Timeout] BlockStatement
src/utils/setupHooks.js:38:48
    * @param {StatsOptions} statsOptions stats options
    * @returns {StatsObjectOptions} object stats options
    */
-  function normalizeStatsOptions(statsOptions) {
-    if (typeof statsOptions === "undefined") {
-      statsOptions = { preset: "normal" };
-    } else if (typeof statsOptions === "boolean") {
-      statsOptions = statsOptions ? { preset: "normal" } : { preset: "none" };
-    } else if (typeof statsOptions === "string") {
-      statsOptions = { preset: statsOptions };
-    }
-
-    return statsOptions;
-  }
+  function normalizeStatsOptions(statsOptions) {}
 
   /**

[Timeout] ConditionalExpression
src/utils/setupHooks.js:39:9
    * @returns {StatsObjectOptions} object stats options
    */
   function normalizeStatsOptions(statsOptions) {
-    if (typeof statsOptions === "undefined") {
+    if (false) {
       statsOptions = { preset: "normal" };
     } else if (typeof statsOptions === "boolean") {

[NoCoverage] BlockStatement
src/utils/setupHooks.js:39:46
    * @returns {StatsObjectOptions} object stats options
    */
   function normalizeStatsOptions(statsOptions) {
-    if (typeof statsOptions === "undefined") {
-      statsOptions = { preset: "normal" };
-    } else if (typeof statsOptions === "boolean") {
+    if (typeof statsOptions === "undefined") {} else if (typeof statsOptions === "boolean") {
       statsOptions = statsOptions ? { preset: "normal" } : { preset: "none" };
     } else if (typeof statsOptions === "string") {

[Timeout] ConditionalExpression
src/utils/setupHooks.js:41:16
   function normalizeStatsOptions(statsOptions) {
     if (typeof statsOptions === "undefined") {
       statsOptions = { preset: "normal" };
-    } else if (typeof statsOptions === "boolean") {
+    } else if (true) {
       statsOptions = statsOptions ? { preset: "normal" } : { preset: "none" };
     } else if (typeof statsOptions === "string") {

[Timeout] ConditionalExpression
src/utils/setupHooks.js:41:16
   function normalizeStatsOptions(statsOptions) {
     if (typeof statsOptions === "undefined") {
       statsOptions = { preset: "normal" };
-    } else if (typeof statsOptions === "boolean") {
+    } else if (false) {
       statsOptions = statsOptions ? { preset: "normal" } : { preset: "none" };
     } else if (typeof statsOptions === "string") {

[Survived] ObjectLiteral
src/utils/setupHooks.js:42:37
     if (typeof statsOptions === "undefined") {
       statsOptions = { preset: "normal" };
     } else if (typeof statsOptions === "boolean") {
-      statsOptions = statsOptions ? { preset: "normal" } : { preset: "none" };
+      statsOptions = statsOptions ? {} : { preset: "none" };
     } else if (typeof statsOptions === "string") {
       statsOptions = { preset: statsOptions };

[Timeout] ConditionalExpression
src/utils/setupHooks.js:43:16
       statsOptions = { preset: "normal" };
     } else if (typeof statsOptions === "boolean") {
       statsOptions = statsOptions ? { preset: "normal" } : { preset: "none" };
-    } else if (typeof statsOptions === "string") {
+    } else if (false) {
       statsOptions = { preset: statsOptions };
     }

[Timeout] BlockStatement
src/utils/setupHooks.js:43:50
       statsOptions = { preset: "normal" };
     } else if (typeof statsOptions === "boolean") {
       statsOptions = statsOptions ? { preset: "normal" } : { preset: "none" };
-    } else if (typeof statsOptions === "string") {
-      statsOptions = { preset: statsOptions };
-    }
+    } else if (typeof statsOptions === "string") {}
 
     return statsOptions;

[Timeout] BooleanLiteral
src/utils/setupHooks.js:56:21
   function done(stats) {
     // We are now on valid state
 
-    context.state = true;
+    context.state = false;
 
     context.stats = stats;

[Timeout] BooleanLiteral
src/utils/setupHooks.js:65:11
       const { compiler, logger, options, state, callbacks } = context;
 
       // Check if still in valid state
-      if (!state) {
+      if (state) {
         return;
       }

[Timeout] BlockStatement
src/utils/setupHooks.js:65:19
       const { compiler, logger, options, state, callbacks } = context;
 
       // Check if still in valid state
-      if (!state) {
-        return;
-      }
+      if (!state) {}
 
       logger.log("Compilation finished");

[Timeout] StringLiteral
src/utils/setupHooks.js:69:18
         return;
       }
 
-      logger.log("Compilation finished");
+      logger.log("");
 
       const isMultiCompilerMode = Boolean(

[Timeout] EqualityOperator
src/utils/setupHooks.js:81:11
        */
       let statsOptions;
 
-      if (typeof options.stats !== "undefined") {
+      if (typeof options.stats === "undefined") {
         statsOptions = isMultiCompilerMode
           ? {

[Timeout] ConditionalExpression
src/utils/setupHooks.js:81:11
        */
       let statsOptions;
 
-      if (typeof options.stats !== "undefined") {
+      if (false) {
         statsOptions = isMultiCompilerMode
           ? {

[NoCoverage] ArrowFunction
src/utils/setupHooks.js:86:42
           ? {
               children:
                 /** @type {MultiCompiler} */
-                (compiler).compilers.map(() => options.stats),
+                (compiler).compilers.map(() => undefined),
             }
           : options.stats;

[Timeout] BlockStatement
src/utils/setupHooks.js:89:14
                 (compiler).compilers.map(() => options.stats),
             }
           : options.stats;
-      } else {
-        statsOptions = isMultiCompilerMode
-          ? {
-              children:
-                /** @type {MultiCompiler} */
-                (compiler).compilers.map((child) => child.options.stats),
-            }
-          : /** @type {Compiler} */ (compiler).options.stats;
-      }
+      } else {}
 
       if (isMultiCompilerMode) {

[Timeout] ArrowFunction
src/utils/setupHooks.js:94:42
           ? {
               children:
                 /** @type {MultiCompiler} */
-                (compiler).compilers.map((child) => child.options.stats),
+                (compiler).compilers.map(() => undefined),
             }
           : /** @type {Compiler} */ (compiler).options.stats;

[Timeout] ConditionalExpression
src/utils/setupHooks.js:99:11
           : /** @type {Compiler} */ (compiler).options.stats;
       }
 
-      if (isMultiCompilerMode) {
+      if (false) {
         /** @type {MultiStatsOptions} */
         (statsOptions).children =

[Timeout] ConditionalExpression
src/utils/setupHooks.js:99:11
           : /** @type {Compiler} */ (compiler).options.stats;
       }
 
-      if (isMultiCompilerMode) {
+      if (true) {
         /** @type {MultiStatsOptions} */
         (statsOptions).children =

[Timeout] BlockStatement
src/utils/setupHooks.js:108:36
              * @param {StatsOptions} childStatsOptions child stats options
              * @returns {StatsObjectOptions} object child stats options
              */
-            (childStatsOptions) => {
-              childStatsOptions = normalizeStatsOptions(childStatsOptions);
-
-              if (typeof childStatsOptions.colors === "undefined") {
-                childStatsOptions.colors =
-                  require("colorette").isColorSupported;
-              }
-
-              return childStatsOptions;
-            },
+            (childStatsOptions) => {},
           );
       } else {

[Timeout] ConditionalExpression
src/utils/setupHooks.js:111:19
             (childStatsOptions) => {
               childStatsOptions = normalizeStatsOptions(childStatsOptions);
 
-              if (typeof childStatsOptions.colors === "undefined") {
+              if (false) {
                 childStatsOptions.colors =
                   require("colorette").isColorSupported;

[Timeout] BlockStatement
src/utils/setupHooks.js:111:68
             (childStatsOptions) => {
               childStatsOptions = normalizeStatsOptions(childStatsOptions);
 
-              if (typeof childStatsOptions.colors === "undefined") {
-                childStatsOptions.colors =
-                  require("colorette").isColorSupported;
-              }
+              if (typeof childStatsOptions.colors === "undefined") {}
 
               return childStatsOptions;

[Timeout] BlockStatement
src/utils/setupHooks.js:119:14
               return childStatsOptions;
             },
           );
-      } else {
-        statsOptions = normalizeStatsOptions(
-          /** @type {StatsOptions} */ (statsOptions),
-        );
-
-        if (typeof statsOptions.colors === "undefined") {
-          statsOptions.colors = require("colorette").isColorSupported;
-        }
-      }
+      } else {}
 
       const printedStats = stats.toString(

[Timeout] ConditionalExpression
src/utils/setupHooks.js:124:13
           /** @type {StatsOptions} */ (statsOptions),
         );
 
-        if (typeof statsOptions.colors === "undefined") {
+        if (true) {
           statsOptions.colors = require("colorette").isColorSupported;
         }

[Timeout] EqualityOperator
src/utils/setupHooks.js:124:13
           /** @type {StatsOptions} */ (statsOptions),
         );
 
-        if (typeof statsOptions.colors === "undefined") {
+        if (typeof statsOptions.colors !== "undefined") {
           statsOptions.colors = require("colorette").isColorSupported;
         }

[Timeout] BlockStatement
src/utils/setupHooks.js:134:25
       );
 
       // Avoid extra empty line when `stats: 'none'`
-      if (printedStats) {
-        // eslint-disable-next-line no-console
-        console.log(printedStats);
-      }
+      if (printedStats) {}
 
       context.callbacks = [];

[Timeout] ConditionalExpression
src/utils/setupHooks.js:134:11
       );
 
       // Avoid extra empty line when `stats: 'none'`
-      if (printedStats) {
+      if (false) {
         // eslint-disable-next-line no-console
         console.log(printedStats);

[Timeout] BlockStatement
src/utils/setupHooks.js:142:41
       context.callbacks = [];
 
       // Execute callback that are delayed
-      for (const callback of callbacks) {
-        callback(stats);
-      }
+      for (const callback of callbacks) {}
     });
   }

[Timeout] StringLiteral
src/utils/setupHooks.js:154:30
     (context).compiler;
 
   compiler.hooks.watchRun.tap("webpack-dev-middleware", invalid);
-  compiler.hooks.invalid.tap("webpack-dev-middleware", invalid);
+  compiler.hooks.invalid.tap("", invalid);
   compiler.hooks.done.tap("webpack-dev-middleware", done);
 }
