[Timeout] LogicalOperator
src/utils/setupWriteToDisk.js:21:5
    */
   const compilers =
     /** @type {MultiCompiler} */
-    (context.compiler).compilers || [context.compiler];
+    /** @type {MultiCompiler} */
+context.compiler.compilers && [context.compiler];
 
   for (const compiler of compilers) {

[Timeout] ConditionalExpression
src/utils/setupWriteToDisk.js:21:5
    */
   const compilers =
     /** @type {MultiCompiler} */
-    (context.compiler).compilers || [context.compiler];
+    false;
 
   for (const compiler of compilers) {

[Timeout] ConditionalExpression
src/utils/setupWriteToDisk.js:24:9
     (context.compiler).compilers || [context.compiler];
 
   for (const compiler of compilers) {
-    if (compiler.options.devServer === false) {
+    if (true) {
       continue;
     }

[Timeout] EqualityOperator
src/utils/setupWriteToDisk.js:24:9
     (context.compiler).compilers || [context.compiler];
 
   for (const compiler of compilers) {
-    if (compiler.options.devServer === false) {
+    if (compiler.options.devServer !== false) {
       continue;
     }

[Timeout] ConditionalExpression
src/utils/setupWriteToDisk.js:30:11
 
     compiler.hooks.emit.tap("DevMiddleware", () => {
       // @ts-expect-error
-      if (compiler.hasWebpackDevMiddlewareAssetEmittedCallback) {
+      if (true) {
         return;
       }

[Timeout] BlockStatement
src/utils/setupWriteToDisk.js:30:65
 
     compiler.hooks.emit.tap("DevMiddleware", () => {
       // @ts-expect-error
-      if (compiler.hasWebpackDevMiddlewareAssetEmittedCallback) {
-        return;
-      }
+      if (compiler.hasWebpackDevMiddlewareAssetEmittedCallback) {}
 
       compiler.hooks.assetEmitted.tapAsync(

[Timeout] ConditionalExpression
src/utils/setupWriteToDisk.js:40:23
           const { targetPath, content } = info;
           const { writeToDisk: filter } = context.options;
           const allowWrite =
-            filter && typeof filter === "function" ? filter(targetPath) : true;
+            filter && true ? filter(targetPath) : true;
 
           if (!allowWrite) {

[Timeout] EqualityOperator
src/utils/setupWriteToDisk.js:40:23
           const { targetPath, content } = info;
           const { writeToDisk: filter } = context.options;
           const allowWrite =
-            filter && typeof filter === "function" ? filter(targetPath) : true;
+            filter && typeof filter !== "function" ? filter(targetPath) : true;
 
           if (!allowWrite) {

[Timeout] BooleanLiteral
src/utils/setupWriteToDisk.js:42:15
           const allowWrite =
             filter && typeof filter === "function" ? filter(targetPath) : true;
 
-          if (!allowWrite) {
+          if (allowWrite) {
             return callback();
           }

[Timeout] ConditionalExpression
src/utils/setupWriteToDisk.js:42:15
           const allowWrite =
             filter && typeof filter === "function" ? filter(targetPath) : true;
 
-          if (!allowWrite) {
+          if (false) {
             return callback();
           }

[Killed] StringLiteral
src/utils/setupWriteToDisk.js:48:15
 
           const dir = path.dirname(targetPath);
           const name = compiler.options.name
-            ? `Child "${compiler.options.name}": `
+            ? ``
             : "";
 
killedBy: setupWriteToDisk tries to create directories and write file if not filtered out with no write errors
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `setupWriteToDisk tries to create directories and write file if not filtered out with no write errors 2`

- Snapshot  - 1
+ Received  + 1

  [

[Timeout] BooleanLiteral
src/utils/setupWriteToDisk.js:51:45
             ? `Child "${compiler.options.name}": `
             : "";
 
-          return fs.mkdir(dir, { recursive: true }, (mkdirError) => {
+          return fs.mkdir(dir, { recursive: false }, (mkdirError) => {
             if (mkdirError) {
               context.logger.error(

[Timeout] BlockStatement
src/utils/setupWriteToDisk.js:51:69
             ? `Child "${compiler.options.name}": `
             : "";
 
-          return fs.mkdir(dir, { recursive: true }, (mkdirError) => {
-            if (mkdirError) {
-              context.logger.error(
-                `${name}Unable to write "${dir}" directory to disk:\n${mkdirError}`,
-              );
-
-              return callback(mkdirError);
-            }
-
-            return fs.writeFile(targetPath, content, (writeFileError) => {
-              if (writeFileError) {
-                context.logger.error(
-                  `${name}Unable to write "${targetPath}" asset to disk:\n${writeFileError}`,
-                );
-
-                return callback(writeFileError);
-              }
-
-              context.logger.log(
-                `${name}Asset written to disk: "${targetPath}"`,
-              );
-
-              return callback();
-            });
-          });
+          return fs.mkdir(dir, { recursive: true }, (mkdirError) => {});
         },
       );

[Killed] BlockStatement
src/utils/setupWriteToDisk.js:52:29
             : "";
 
           return fs.mkdir(dir, { recursive: true }, (mkdirError) => {
-            if (mkdirError) {
-              context.logger.error(
-                `${name}Unable to write "${dir}" directory to disk:\n${mkdirError}`,
-              );
-
-              return callback(mkdirError);
-            }
+            if (mkdirError) {}
 
             return fs.writeFile(targetPath, content, (writeFileError) => {
killedBy: setupWriteToDisk tries to create directories and write file if not filtered out with mkdir error
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [["/target/path/file", "content", [Function anonymous]]]

[Timeout] ConditionalExpression
src/utils/setupWriteToDisk.js:52:17
             : "";
 
           return fs.mkdir(dir, { recursive: true }, (mkdirError) => {
-            if (mkdirError) {
+            if (true) {
               context.logger.error(
                 `${name}Unable to write "${dir}" directory to disk:\n${mkdirError}`,

[Killed] StringLiteral
src/utils/setupWriteToDisk.js:54:17
           return fs.mkdir(dir, { recursive: true }, (mkdirError) => {
             if (mkdirError) {
               context.logger.error(
-                `${name}Unable to write "${dir}" directory to disk:\n${mkdirError}`,
+                ``,
               );
 
killedBy: setupWriteToDisk tries to create directories and write file if not filtered out with mkdir error
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `setupWriteToDisk tries to create directories and write file if not filtered out with mkdir error 1`

- Snapshot  - 2
+ Received  + 1

  [

[Timeout] BlockStatement
src/utils/setupWriteToDisk.js:60:74
               return callback(mkdirError);
             }
 
-            return fs.writeFile(targetPath, content, (writeFileError) => {
-              if (writeFileError) {
-                context.logger.error(
-                  `${name}Unable to write "${targetPath}" asset to disk:\n${writeFileError}`,
-                );
-
-                return callback(writeFileError);
-              }
-
-              context.logger.log(
-                `${name}Asset written to disk: "${targetPath}"`,
-              );
-
-              return callback();
-            });
+            return fs.writeFile(targetPath, content, (writeFileError) => {});
           });
         },

[Killed] BlockStatement
src/utils/setupWriteToDisk.js:61:35
             }
 
             return fs.writeFile(targetPath, content, (writeFileError) => {
-              if (writeFileError) {
-                context.logger.error(
-                  `${name}Unable to write "${targetPath}" asset to disk:\n${writeFileError}`,
-                );
-
-                return callback(writeFileError);
-              }
+              if (writeFileError) {}
 
               context.logger.log(
killedBy: setupWriteToDisk tries to create directories and write file if not filtered out with writeFile error
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `setupWriteToDisk tries to create directories and write file if not filtered out with writeFile error 1`

- Snapshot  - 6
+ Received  + 1

- [

[Timeout] ConditionalExpression
src/utils/setupWriteToDisk.js:61:19
             }
 
             return fs.writeFile(targetPath, content, (writeFileError) => {
-              if (writeFileError) {
+              if (true) {
                 context.logger.error(
                   `${name}Unable to write "${targetPath}" asset to disk:\n${writeFileError}`,

[Timeout] BooleanLiteral
src/utils/setupWriteToDisk.js:80:62
       );
 
       // @ts-expect-error
-      compiler.hasWebpackDevMiddlewareAssetEmittedCallback = true;
+      compiler.hasWebpackDevMiddlewareAssetEmittedCallback = false;
     });
   }
