[Timeout] BlockStatement
src/utils/compatibleAPI.js:36:38
  * @param {string} name name
  * @returns {string | string[] | undefined} request header
  */
-function getRequestHeader(req, name) {
-  // Pseudo API
-  if (typeof req.getHeader === "function") {
-    return req.getHeader(name);
-  }
-
-  return req.headers[name];
-}
+function getRequestHeader(req, name) {}
 
 /**

[Timeout] EqualityOperator
src/utils/compatibleAPI.js:38:7
  */
 function getRequestHeader(req, name) {
   // Pseudo API
-  if (typeof req.getHeader === "function") {
+  if (typeof req.getHeader !== "function") {
     return req.getHeader(name);
   }

[Timeout] BlockStatement
src/utils/compatibleAPI.js:38:44
  */
 function getRequestHeader(req, name) {
   // Pseudo API
-  if (typeof req.getHeader === "function") {
-    return req.getHeader(name);
-  }
+  if (typeof req.getHeader === "function") {}
 
   return req.headers[name];

[Timeout] BlockStatement
src/utils/compatibleAPI.js:50:32
  * @param {Request} req req
  * @returns {string | undefined} request method
  */
-function getRequestMethod(req) {
-  // Pseudo API
-  if (typeof req.getMethod === "function") {
-    return req.getMethod();
-  }
-
-  return req.method;
-}
+function getRequestMethod(req) {}
 
 /**

[Timeout] EqualityOperator
src/utils/compatibleAPI.js:52:7
  */
 function getRequestMethod(req) {
   // Pseudo API
-  if (typeof req.getMethod === "function") {
+  if (typeof req.getMethod !== "function") {
     return req.getMethod();
   }

[Timeout] BlockStatement
src/utils/compatibleAPI.js:52:44
  */
 function getRequestMethod(req) {
   // Pseudo API
-  if (typeof req.getMethod === "function") {
-    return req.getMethod();
-  }
+  if (typeof req.getMethod === "function") {}
 
   return req.method;

[Timeout] BlockStatement
src/utils/compatibleAPI.js:64:29
  * @param {Request} req req
  * @returns {string | undefined} request URL
  */
-function getRequestURL(req) {
-  // Pseudo API
-  if (typeof req.getURL === "function") {
-    return req.getURL();
-  }
-
-  return req.url;
-}
+function getRequestURL(req) {}
 
 /**

[Timeout] BlockStatement
src/utils/compatibleAPI.js:66:41
  */
 function getRequestURL(req) {
   // Pseudo API
-  if (typeof req.getURL === "function") {
-    return req.getURL();
-  }
+  if (typeof req.getURL === "function") {}
 
   return req.url;

[Timeout] EqualityOperator
src/utils/compatibleAPI.js:66:7
  */
 function getRequestURL(req) {
   // Pseudo API
-  if (typeof req.getURL === "function") {
+  if (typeof req.getURL !== "function") {
     return req.getURL();
   }

[Timeout] BlockStatement
src/utils/compatibleAPI.js:79:35
  * @param {number} code code
  * @returns {void}
  */
-function setStatusCode(res, code) {
-  // Pseudo API
-  if (typeof res.setStatusCode === "function") {
-    res.setStatusCode(code);
-
-    return;
-  }
-
-  // Node.js API
-
-  res.statusCode = code;
-}
+function setStatusCode(res, code) {}
 
 /**

[Timeout] EqualityOperator
src/utils/compatibleAPI.js:81:7
  */
 function setStatusCode(res, code) {
   // Pseudo API
-  if (typeof res.setStatusCode === "function") {
+  if (typeof res.setStatusCode !== "function") {
     res.setStatusCode(code);
 

[Timeout] ConditionalExpression
src/utils/compatibleAPI.js:81:7
  */
 function setStatusCode(res, code) {
   // Pseudo API
-  if (typeof res.setStatusCode === "function") {
+  if (false) {
     res.setStatusCode(code);
 

[Timeout] BlockStatement
src/utils/compatibleAPI.js:97:29
  * @param {Response} res res
  * @returns {number} status code
  */
-function getStatusCode(res) {
-  // Pseudo API
-  if (typeof res.getStatusCode === "function") {
-    return res.getStatusCode();
-  }
-
-  return res.statusCode;
-}
+function getStatusCode(res) {}
 
 /**

[Timeout] ConditionalExpression
src/utils/compatibleAPI.js:99:7
  */
 function getStatusCode(res) {
   // Pseudo API
-  if (typeof res.getStatusCode === "function") {
+  if (true) {
     return res.getStatusCode();
   }

[Timeout] ConditionalExpression
src/utils/compatibleAPI.js:99:7
  */
 function getStatusCode(res) {
   // Pseudo API
-  if (typeof res.getStatusCode === "function") {
+  if (false) {
     return res.getStatusCode();
   }

[Timeout] BlockStatement
src/utils/compatibleAPI.js:112:39
  * @param {string} name name
  * @returns {string | string[] | undefined | number} header
  */
-function getResponseHeader(res, name) {
-  // Real and Pseudo API
-  return res.getHeader(name);
-}
+function getResponseHeader(res, name) {}
 
 /**

[Timeout] BlockStatement
src/utils/compatibleAPI.js:124:46
  * @param {number | string | Readonly<string[]>} value value
  * @returns {Response} response
  */
-function setResponseHeader(res, name, value) {
-  // Real and Pseudo API
-  return res.setHeader(name, value);
-}
+function setResponseHeader(res, name, value) {}
 
 /**

[Timeout] BlockStatement
src/utils/compatibleAPI.js:135:42
  * @param {string} name name
  * @returns {void}
  */
-function removeResponseHeader(res, name) {
-  // Real and Pseudo API
-  res.removeHeader(name);
-}
+function removeResponseHeader(res, name) {}
 
 /**

[Timeout] BlockStatement
src/utils/compatibleAPI.js:145:34
  * @param {Response} res res
  * @returns {string[]} header names
  */
-function getResponseHeaders(res) {
-  // Pseudo API
-  if (typeof res.getResponseHeaders === "function") {
-    return res.getResponseHeaders();
-  }
-
-  return res.getHeaderNames();
-}
+function getResponseHeaders(res) {}
 
 /**

[Timeout] EqualityOperator
src/utils/compatibleAPI.js:147:7
  */
 function getResponseHeaders(res) {
   // Pseudo API
-  if (typeof res.getResponseHeaders === "function") {
+  if (typeof res.getResponseHeaders !== "function") {
     return res.getResponseHeaders();
   }

[Timeout] BlockStatement
src/utils/compatibleAPI.js:147:53
  */
 function getResponseHeaders(res) {
   // Pseudo API
-  if (typeof res.getResponseHeaders === "function") {
-    return res.getResponseHeaders();
-  }
+  if (typeof res.getResponseHeaders === "function") {}
 
   return res.getHeaderNames();

[Timeout] BlockStatement
src/utils/compatibleAPI.js:159:30
  * @param {Response} res res
  * @returns {boolean} true when headers were sent, otherwise false
  */
-function getHeadersSent(res) {
-  // Pseudo API
-  if (typeof res.getHeadersSent === "function") {
-    return res.getHeadersSent();
-  }
-
-  return res.headersSent;
-}
+function getHeadersSent(res) {}
 
 /**

[Timeout] BlockStatement
src/utils/compatibleAPI.js:161:49
  */
 function getHeadersSent(res) {
   // Pseudo API
-  if (typeof res.getHeadersSent === "function") {
-    return res.getHeadersSent();
-  }
+  if (typeof res.getHeadersSent === "function") {}
 
   return res.headersSent;

[Timeout] EqualityOperator
src/utils/compatibleAPI.js:161:7
  */
 function getHeadersSent(res) {
   // Pseudo API
-  if (typeof res.getHeadersSent === "function") {
+  if (typeof res.getHeadersSent !== "function") {
     return res.getHeadersSent();
   }

[Timeout] BlockStatement
src/utils/compatibleAPI.js:173:36
  * @param {Response} res res
  * @param {import("fs").ReadStream} bufferOrStream buffer or stream
  */
-function pipe(res, bufferOrStream) {
-  // Pseudo API and Koa API
-  if (typeof res.stream === "function") {
-    // Writable stream into Readable stream
-    res.stream(bufferOrStream);
-    return;
-  }
-
-  // Node.js API and Express API and Hapi API
-  bufferOrStream.pipe(res);
-}
+function pipe(res, bufferOrStream) {}
 
 /**

[Timeout] BlockStatement
src/utils/compatibleAPI.js:175:41
  */
 function pipe(res, bufferOrStream) {
   // Pseudo API and Koa API
-  if (typeof res.stream === "function") {
-    // Writable stream into Readable stream
-    res.stream(bufferOrStream);
-    return;
-  }
+  if (typeof res.stream === "function") {}
 
   // Node.js API and Express API and Hapi API

[Timeout] ConditionalExpression
src/utils/compatibleAPI.js:175:7
  */
 function pipe(res, bufferOrStream) {
   // Pseudo API and Koa API
-  if (typeof res.stream === "function") {
+  if (true) {
     // Writable stream into Readable stream
     res.stream(bufferOrStream);

[Timeout] BlockStatement
src/utils/compatibleAPI.js:191:36
  * @param {string | Buffer} bufferOrString buffer or string
  * @returns {void}
  */
-function send(res, bufferOrString) {
-  // Pseudo API and Express API and Koa API
-  if (typeof res.send === "function") {
-    res.send(bufferOrString);
-    return;
-  }
-
-  res.end(bufferOrString);
-}
+function send(res, bufferOrString) {}
 
 /**

[Timeout] EqualityOperator
src/utils/compatibleAPI.js:193:7
  */
 function send(res, bufferOrString) {
   // Pseudo API and Express API and Koa API
-  if (typeof res.send === "function") {
+  if (typeof res.send !== "function") {
     res.send(bufferOrString);
     return;

[Timeout] ConditionalExpression
src/utils/compatibleAPI.js:193:7
  */
 function send(res, bufferOrString) {
   // Pseudo API and Express API and Koa API
-  if (typeof res.send === "function") {
+  if (true) {
     res.send(bufferOrString);
     return;

[Timeout] BlockStatement
src/utils/compatibleAPI.js:206:28
  * @param {Response} res res
  * @param {(string | Buffer)=} data data
  */
-function finish(res, data) {
-  // Pseudo API and Express API and Koa API
-  if (typeof res.finish === "function") {
-    res.finish(data);
-    return;
-  }
-
-  // Pseudo API and Express API and Koa API
-  res.end(data);
-}
+function finish(res, data) {}
 
 /**

[Timeout] ConditionalExpression
src/utils/compatibleAPI.js:208:7
  */
 function finish(res, data) {
   // Pseudo API and Express API and Koa API
-  if (typeof res.finish === "function") {
+  if (true) {
     res.finish(data);
     return;

[Timeout] BlockStatement
src/utils/compatibleAPI.js:208:41
  */
 function finish(res, data) {
   // Pseudo API and Express API and Koa API
-  if (typeof res.finish === "function") {
-    res.finish(data);
-    return;
-  }
+  if (typeof res.finish === "function") {}
 
   // Pseudo API and Express API and Koa API

[Timeout] EqualityOperator
src/utils/compatibleAPI.js:237:5
 
   // Stream logic
   const isFsSupportsStream =
-    typeof outputFileSystem.createReadStream === "function";
+    typeof outputFileSystem.createReadStream !== "function";
 
   if (isFsSupportsStream) {

[Timeout] ConditionalExpression
src/utils/compatibleAPI.js:237:5
 
   // Stream logic
   const isFsSupportsStream =
-    typeof outputFileSystem.createReadStream === "function";
+    false;
 
   if (isFsSupportsStream) {

[Timeout] ConditionalExpression
src/utils/compatibleAPI.js:239:7
   const isFsSupportsStream =
     typeof outputFileSystem.createReadStream === "function";
 
-  if (isFsSupportsStream) {
+  if (false) {
     bufferOrStream =
       /** @type {import("fs").createReadStream} */

[Timeout] BlockStatement
src/utils/compatibleAPI.js:239:27
   const isFsSupportsStream =
     typeof outputFileSystem.createReadStream === "function";
 
-  if (isFsSupportsStream) {
-    bufferOrStream =
-      /** @type {import("fs").createReadStream} */
-      (outputFileSystem.createReadStream)(filename, {
-        start,
-        end,
-      });
-
-    // Handle files with zero bytes
-    byteLength = end === 0 ? 0 : end - start + 1;
-  } else {
+  if (isFsSupportsStream) {} else {
     bufferOrStream = outputFileSystem.readFileSync(filename);
     ({ byteLength } = bufferOrStream);

[Timeout] EqualityOperator
src/utils/compatibleAPI.js:248:18
       });
 
     // Handle files with zero bytes
-    byteLength = end === 0 ? 0 : end - start + 1;
+    byteLength = end !== 0 ? 0 : end - start + 1;
   } else {
     bufferOrStream = outputFileSystem.readFileSync(filename);

[Timeout] ConditionalExpression
src/utils/compatibleAPI.js:248:18
       });
 
     // Handle files with zero bytes
-    byteLength = end === 0 ? 0 : end - start + 1;
+    byteLength = false ? 0 : end - start + 1;
   } else {
     bufferOrStream = outputFileSystem.readFileSync(filename);

[Timeout] BlockStatement
src/utils/compatibleAPI.js:249:10
 
     // Handle files with zero bytes
     byteLength = end === 0 ? 0 : end - start + 1;
-  } else {
-    bufferOrStream = outputFileSystem.readFileSync(filename);
-    ({ byteLength } = bufferOrStream);
-  }
+  } else {}
 
   return { bufferOrStream, byteLength };

[Timeout] BlockStatement
src/utils/compatibleAPI.js:262:27
  * @param {Response} res res
  * @returns {Response} res res
  */
-function getOutgoing(res) {
-  // Pseudo API and Express API and Koa API
-  if (typeof res.getOutgoing === "function") {
-    return res.getOutgoing();
-  }
-
-  return res;
-}
+function getOutgoing(res) {}
 
 /**

[Timeout] ConditionalExpression
src/utils/compatibleAPI.js:264:7
  */
 function getOutgoing(res) {
   // Pseudo API and Express API and Koa API
-  if (typeof res.getOutgoing === "function") {
+  if (true) {
     return res.getOutgoing();
   }

[Timeout] EqualityOperator
src/utils/compatibleAPI.js:264:7
  */
 function getOutgoing(res) {
   // Pseudo API and Express API and Koa API
-  if (typeof res.getOutgoing === "function") {
+  if (typeof res.getOutgoing !== "function") {
     return res.getOutgoing();
   }

[Timeout] BlockStatement
src/utils/compatibleAPI.js:275:25
  * @template {ServerResponse & ExpectedServerResponse} Response
  * @param {Response} res res
  */
-function initState(res) {
-  if (typeof res.setState === "function") {
-    return;
-  }
-
-  // fixes #282. credit @cexoso. in certain edge situations res.locals is undefined.
-  res.locals ||= {};
-}
+function initState(res) {}
 
 // eslint-disable-next-line jsdoc/no-restricted-syntax

[Timeout] BlockStatement
src/utils/compatibleAPI.js:276:43
  * @param {Response} res res
  */
 function initState(res) {
-  if (typeof res.setState === "function") {
-    return;
-  }
+  if (typeof res.setState === "function") {}
 
   // fixes #282. credit @cexoso. in certain edge situations res.locals is undefined.

[Timeout] ConditionalExpression
src/utils/compatibleAPI.js:276:7
  * @param {Response} res res
  */
 function initState(res) {
-  if (typeof res.setState === "function") {
+  if (false) {
     return;
   }

[Timeout] AssignmentOperator
src/utils/compatibleAPI.js:281:3
   }
 
   // fixes #282. credit @cexoso. in certain edge situations res.locals is undefined.
-  res.locals ||= {};
+  res.locals &&= {};
 }
 

[Timeout] BlockStatement
src/utils/compatibleAPI.js:292:37
  * @param {any} value state
  * @returns {void}
  */
-function setState(res, name, value) {
-  if (typeof res.setState === "function") {
-    res.setState(name, value);
-
-    return;
-  }
-
-  // eslint-disable-next-line jsdoc/no-restricted-syntax
-  /** @type {any} */
-  (res.locals)[name] = value;
-}
+function setState(res, name, value) {}
 
 /**

[Timeout] ConditionalExpression
src/utils/compatibleAPI.js:293:7
  * @returns {void}
  */
 function setState(res, name, value) {
-  if (typeof res.setState === "function") {
+  if (false) {
     res.setState(name, value);
 

[Timeout] BlockStatement
src/utils/compatibleAPI.js:293:43
  * @returns {void}
  */
 function setState(res, name, value) {
-  if (typeof res.setState === "function") {
-    res.setState(name, value);
-
-    return;
-  }
+  if (typeof res.setState === "function") {}
 
   // eslint-disable-next-line jsdoc/no-restricted-syntax

[Timeout] BlockStatement
src/utils/compatibleAPI.js:309:43
  * @param {Response} res res
  * @returns {"ready" | "open" | "readable"} state
  */
-function getReadyReadableStreamState(res) {
-  // Pseudo API and Express API and Koa API
-  if (typeof res.getReadyReadableStreamState === "function") {
-    return res.getReadyReadableStreamState();
-  }
-
-  return "ready";
-}
+function getReadyReadableStreamState(res) {}
 
 module.exports = {

[Timeout] EqualityOperator
src/utils/compatibleAPI.js:311:7
  */
 function getReadyReadableStreamState(res) {
   // Pseudo API and Express API and Koa API
-  if (typeof res.getReadyReadableStreamState === "function") {
+  if (typeof res.getReadyReadableStreamState !== "function") {
     return res.getReadyReadableStreamState();
   }

[Timeout] ConditionalExpression
src/utils/compatibleAPI.js:311:7
  */
 function getReadyReadableStreamState(res) {
   // Pseudo API and Express API and Koa API
-  if (typeof res.getReadyReadableStreamState === "function") {
+  if (true) {
     return res.getReadyReadableStreamState();
   }

[Timeout] ObjectLiteral
src/utils/compatibleAPI.js:318:18
   return "ready";
 }
 
-module.exports = {
-  createReadStreamOrReadFileSync,
-  finish,
-  getHeadersSent,
-  getOutgoing,
-  getReadyReadableStreamState,
-  getRequestHeader,
-  getRequestMethod,
-  getRequestURL,
-  getResponseHeader,
-  getResponseHeaders,
-  getStatusCode,
-  initState,
-  pipe,
-  removeResponseHeader,
-  send,
-  setResponseHeader,
-  setState,
-  setStatusCode,
-};
+module.exports = {};
 
