[Timeout] StringLiteral
src/utils/escapeHtml.js:8:15
  * @returns {string} escaped HTML
  */
 function escapeHtml(string) {
-  const str = `${string}`;
+  const str = ``;
   const match = matchHtmlRegExp.exec(str);
 

[Timeout] BlockStatement
src/utils/escapeHtml.js:11:15
   const str = `${string}`;
   const match = matchHtmlRegExp.exec(str);
 
-  if (!match) {
-    return str;
-  }
+  if (!match) {}
 
   let escape;

[Killed] StringLiteral
src/utils/escapeHtml.js:16:14
   }
 
   let escape;
-  let html = "";
+  let html = "Stryker was here!";
   let index = 0;
   let lastIndex = 0;
killedBy: escapeHtml should work
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "&quot;&amp;&#39;&lt;&gt;test"
Received: "Stryker was here!&quot;&amp;&#39;&lt;&gt;test"

[Killed] ConditionalExpression
src/utils/escapeHtml.js:20:27
   let index = 0;
   let lastIndex = 0;
 
-  for ({ index } = match; index < str.length; index++) {
+  for ({ index } = match; false; index++) {
     switch (str.charCodeAt(index)) {
       // "
killedBy: escapeHtml should work
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "&quot;&amp;&#39;&lt;&gt;test"
Received: ""

[Killed] EqualityOperator
src/utils/escapeHtml.js:20:27
   let index = 0;
   let lastIndex = 0;
 
-  for ({ index } = match; index < str.length; index++) {
+  for ({ index } = match; index >= str.length; index++) {
     switch (str.charCodeAt(index)) {
       // "
killedBy: escapeHtml should work
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "&quot;&amp;&#39;&lt;&gt;test"
Received: ""

[Killed] ConditionalExpression
src/utils/escapeHtml.js:23:7
   for ({ index } = match; index < str.length; index++) {
     switch (str.charCodeAt(index)) {
       // "
-      case 34:
-        escape = "&quot;";
-        break;
+      // "
+case 34:
+// &
       // &
       case 38:
killedBy: escapeHtml should work
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "&quot;&amp;&#39;&lt;&gt;test"
Received: "&amp;&amp;&#39;&lt;&gt;test"

[Killed] ConditionalExpression
src/utils/escapeHtml.js:27:7
         escape = "&quot;";
         break;
       // &
-      case 38:
-        escape = "&amp;";
-        break;
+      // &
+case 38:
+// '
       // '
       case 39:
killedBy: escapeHtml should work
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "&quot;&amp;&#39;&lt;&gt;test"
Received: "&quot;&#39;&#39;&lt;&gt;test"

[Killed] ConditionalExpression
src/utils/escapeHtml.js:31:7
         escape = "&amp;";
         break;
       // '
-      case 39:
-        escape = "&#39;";
-        break;
+      // '
+case 39:
+// <
       // <
       case 60:
killedBy: escapeHtml should work
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "&quot;&amp;&#39;&lt;&gt;test"
Received: "&quot;&amp;&lt;&lt;&gt;test"

[Killed] ConditionalExpression
src/utils/escapeHtml.js:35:7
         escape = "&#39;";
         break;
       // <
-      case 60:
-        escape = "&lt;";
-        break;
+      // <
+case 60:
+// >
       // >
       case 62:
killedBy: escapeHtml should work
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "&quot;&amp;&#39;&lt;&gt;test"
Received: "&quot;&amp;&#39;&gt;&gt;test"

[Killed] ConditionalExpression
src/utils/escapeHtml.js:39:7
         escape = "&lt;";
         break;
       // >
-      case 62:
-        escape = "&gt;";
-        break;
+      // >
+case 62:
       default:
         continue;
killedBy: escapeHtml should work
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "&quot;&amp;&#39;&lt;&gt;test"
Received: "&quot;&amp;&#39;&lt;>test"

[Killed] ConditionalExpression
src/utils/escapeHtml.js:42:7
       case 62:
         escape = "&gt;";
         break;
-      default:
-        continue;
+      default:
     }
 
killedBy: escapeHtml should work
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "&quot;&amp;&#39;&lt;&gt;test"
Received: "&quot;&amp;&#39;&lt;&gt;&gt;&gt;&gt;&gt;"

[Killed] BlockStatement
src/utils/escapeHtml.js:46:30
         continue;
     }
 
-    if (lastIndex !== index) {
-      // eslint-disable-next-line unicorn/prefer-string-slice
-      html += str.substring(lastIndex, index);
-    }
+    if (lastIndex !== index) {}
 
     lastIndex = index + 1;
killedBy: escapeHtml should work
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "&quot;&amp;&#39;test&lt;&gt;"
Received: "&quot;&amp;&#39;&lt;&gt;"

[Killed] EqualityOperator
src/utils/escapeHtml.js:46:9
         continue;
     }
 
-    if (lastIndex !== index) {
+    if (lastIndex === index) {
       // eslint-disable-next-line unicorn/prefer-string-slice
       html += str.substring(lastIndex, index);
killedBy: escapeHtml should work
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "&quot;&amp;&#39;test&lt;&gt;"
Received: "&quot;&amp;&#39;&lt;&gt;"

[Killed] MethodExpression
src/utils/escapeHtml.js:48:15
 
     if (lastIndex !== index) {
       // eslint-disable-next-line unicorn/prefer-string-slice
-      html += str.substring(lastIndex, index);
+      html += str;
     }
 
killedBy: escapeHtml should work
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "&quot;&amp;&#39;test&lt;&gt;"
Received: "&quot;&amp;&#39;\"&'test<>&lt;&gt;"

[Killed] AssignmentOperator
src/utils/escapeHtml.js:48:7
 
     if (lastIndex !== index) {
       // eslint-disable-next-line unicorn/prefer-string-slice
-      html += str.substring(lastIndex, index);
+      html -= str.substring(lastIndex, index);
     }
 
killedBy: escapeHtml should work
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "&quot;&amp;&#39;test&lt;&gt;"
Received: "NaN&lt;&gt;"

[Killed] ArithmeticOperator
src/utils/escapeHtml.js:51:17
       html += str.substring(lastIndex, index);
     }
 
-    lastIndex = index + 1;
+    lastIndex = index - 1;
     html += escape;
   }
killedBy: escapeHtml should work
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "&quot;&amp;&#39;&lt;&gt;test"
Received: "&quot;\"&amp;\"&&#39;&'&lt;'<&gt;<>test"

[Killed] AssignmentOperator
src/utils/escapeHtml.js:52:5
     }
 
     lastIndex = index + 1;
-    html += escape;
+    html -= escape;
   }
 
killedBy: escapeHtml should work
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "&quot;&amp;&#39;&lt;&gt;test"
Received: "NaNtest"

[Killed] ArithmeticOperator
src/utils/escapeHtml.js:56:32
   }
 
   // eslint-disable-next-line unicorn/prefer-string-slice
-  return lastIndex !== index ? html + str.substring(lastIndex, index) : html;
+  return lastIndex !== index ? html - str.substring(lastIndex, index) : html;
 }
 
killedBy: escapeHtml should work
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "&quot;&amp;&#39;&lt;&gt;test"
Received: NaN

[Killed] EqualityOperator
src/utils/escapeHtml.js:56:10
   }
 
   // eslint-disable-next-line unicorn/prefer-string-slice
-  return lastIndex !== index ? html + str.substring(lastIndex, index) : html;
+  return lastIndex === index ? html + str.substring(lastIndex, index) : html;
 }
 
killedBy: escapeHtml should work
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "&quot;&amp;&#39;&lt;&gt;test"
Received: "&quot;&amp;&#39;&lt;&gt;"
