[Timeout] BlockStatement
src/utils/memorize.js:22:39
    * @param {any} arguments_ args
    * @returns {any} result
    */
-  const memoized = (...arguments_) => {
-    const [key] = arguments_;
-    const cacheItem = cache.get(key);
-
-    if (cacheItem) {
-      return cacheItem.data;
-    }
-
-    // @ts-expect-error
-    let result = fn.apply(this, arguments_);
-
-    if (callback) {
-      result = callback(result);
-    }
-
-    cache.set(key, {
-      data: result,
-    });
-
-    return result;
-  };
+  const memoized = (...arguments_) => {};
 
   cacheStore.set(memoized, cache);

[Timeout] ConditionalExpression
src/utils/memorize.js:26:9
     const [key] = arguments_;
     const cacheItem = cache.get(key);
 
-    if (cacheItem) {
+    if (false) {
       return cacheItem.data;
     }

[Timeout] BlockStatement
src/utils/memorize.js:26:20
     const [key] = arguments_;
     const cacheItem = cache.get(key);
 
-    if (cacheItem) {
-      return cacheItem.data;
-    }
+    if (cacheItem) {}
 
     // @ts-expect-error

[Timeout] ConditionalExpression
src/utils/memorize.js:33:9
     // @ts-expect-error
     let result = fn.apply(this, arguments_);
 
-    if (callback) {
+    if (true) {
       result = callback(result);
     }

[Timeout] ConditionalExpression
src/utils/memorize.js:33:9
     // @ts-expect-error
     let result = fn.apply(this, arguments_);
 
-    if (callback) {
+    if (false) {
       result = callback(result);
     }

[Timeout] ObjectLiteral
src/utils/memorize.js:37:20
       result = callback(result);
     }
 
-    cache.set(key, {
-      data: result,
-    });
+    cache.set(key, {});
 
     return result;
