[Timeout] BlockStatement
src/utils/ready.js:13:40
  * @param {Request=} req req
  * @returns {void}
  */
-function ready(context, callback, req) {
-  if (context.state) {
-    callback(context.stats);
-
-    return;
-  }
-
-  const name = (req && req.url) || callback.name;
-
-  context.logger.info(`wait until bundle finished${name ? `: ${name}` : ""}`);
-  context.callbacks.push(callback);
-}
+function ready(context, callback, req) {}
 
 module.exports = ready;

[Timeout] ConditionalExpression
src/utils/ready.js:14:7
  * @returns {void}
  */
 function ready(context, callback, req) {
-  if (context.state) {
+  if (false) {
     callback(context.stats);
 

[Timeout] ConditionalExpression
src/utils/ready.js:14:7
  * @returns {void}
  */
 function ready(context, callback, req) {
-  if (context.state) {
+  if (true) {
     callback(context.stats);
 

[Timeout] ConditionalExpression
src/utils/ready.js:20:16
     return;
   }
 
-  const name = (req && req.url) || callback.name;
+  const name = true;
 
   context.logger.info(`wait until bundle finished${name ? `: ${name}` : ""}`);

[Timeout] LogicalOperator
src/utils/ready.js:20:17
     return;
   }
 
-  const name = (req && req.url) || callback.name;
+  const name = (req || req.url) || callback.name;
 
   context.logger.info(`wait until bundle finished${name ? `: ${name}` : ""}`);

[Timeout] StringLiteral
src/utils/ready.js:22:73
 
   const name = (req && req.url) || callback.name;
 
-  context.logger.info(`wait until bundle finished${name ? `: ${name}` : ""}`);
+  context.logger.info(`wait until bundle finished${name ? `: ${name}` : "Stryker was here!"}`);
   context.callbacks.push(callback);
 }
