[Timeout] ConditionalExpression
src/utils/setupOutputFileSystem.js:15:7
 function setupOutputFileSystem(context) {
   let outputFileSystem;
 
-  if (context.options.outputFileSystem) {
+  if (false) {
     const { outputFileSystem: outputFileSystemFromOptions } = context.options;
 

[Timeout] ConditionalExpression
src/utils/setupOutputFileSystem.js:15:7
 function setupOutputFileSystem(context) {
   let outputFileSystem;
 
-  if (context.options.outputFileSystem) {
+  if (true) {
     const { outputFileSystem: outputFileSystemFromOptions } = context.options;
 

[Timeout] ConditionalExpression
src/utils/setupOutputFileSystem.js:21:12
     outputFileSystem = outputFileSystemFromOptions;
   }
   // Don't use `memfs` when developer wants to write everything to a disk, because it doesn't make sense.
-  else if (context.options.writeToDisk !== true) {
+  else if (true) {
     outputFileSystem = memfs.createFsFromVolume(new memfs.Volume());
   } else {

[Timeout] BooleanLiteral
src/utils/setupOutputFileSystem.js:21:44
     outputFileSystem = outputFileSystemFromOptions;
   }
   // Don't use `memfs` when developer wants to write everything to a disk, because it doesn't make sense.
-  else if (context.options.writeToDisk !== true) {
+  else if (context.options.writeToDisk !== false) {
     outputFileSystem = memfs.createFsFromVolume(new memfs.Volume());
   } else {

[Timeout] BlockStatement
src/utils/setupOutputFileSystem.js:23:10
   // Don't use `memfs` when developer wants to write everything to a disk, because it doesn't make sense.
   else if (context.options.writeToDisk !== true) {
     outputFileSystem = memfs.createFsFromVolume(new memfs.Volume());
-  } else {
-    const isMultiCompiler =
-      /** @type {MultiCompiler} */
-      (context.compiler).compilers;
-
-    if (isMultiCompiler) {
-      // Prefer compiler with `devServer` option or fallback on the first
-      // TODO we need to support webpack-dev-server as a plugin or revisit it
-      const compiler =
-        /** @type {MultiCompiler} */
-        (context.compiler).compilers.find(
-          (item) =>
-            Object.hasOwn(item.options, "devServer") &&
-            item.options.devServer !== false,
-        );
-
-      ({ outputFileSystem } =
-        compiler ||
-        /** @type {MultiCompiler} */
-        (context.compiler).compilers[0]);
-    } else {
-      ({ outputFileSystem } = context.compiler);
-    }
-  }
+  } else {}
 
   const compilers =

[Timeout] ConditionalExpression
src/utils/setupOutputFileSystem.js:28:9
       /** @type {MultiCompiler} */
       (context.compiler).compilers;
 
-    if (isMultiCompiler) {
+    if (false) {
       // Prefer compiler with `devServer` option or fallback on the first
       // TODO we need to support webpack-dev-server as a plugin or revisit it

[Timeout] BlockStatement
src/utils/setupOutputFileSystem.js:28:26
       /** @type {MultiCompiler} */
       (context.compiler).compilers;
 
-    if (isMultiCompiler) {
-      // Prefer compiler with `devServer` option or fallback on the first
-      // TODO we need to support webpack-dev-server as a plugin or revisit it
-      const compiler =
-        /** @type {MultiCompiler} */
-        (context.compiler).compilers.find(
-          (item) =>
-            Object.hasOwn(item.options, "devServer") &&
-            item.options.devServer !== false,
-        );
-
-      ({ outputFileSystem } =
-        compiler ||
-        /** @type {MultiCompiler} */
-        (context.compiler).compilers[0]);
-    } else {
+    if (isMultiCompiler) {} else {
       ({ outputFileSystem } = context.compiler);
     }

[Timeout] ArrowFunction
src/utils/setupOutputFileSystem.js:34:11
       const compiler =
         /** @type {MultiCompiler} */
         (context.compiler).compilers.find(
-          (item) =>
-            Object.hasOwn(item.options, "devServer") &&
-            item.options.devServer !== false,
+          () => undefined,
         );
 

[Timeout] ConditionalExpression
src/utils/setupOutputFileSystem.js:35:13
         /** @type {MultiCompiler} */
         (context.compiler).compilers.find(
           (item) =>
-            Object.hasOwn(item.options, "devServer") &&
-            item.options.devServer !== false,
+            true,
         );
 

[Timeout] LogicalOperator
src/utils/setupOutputFileSystem.js:35:13
         /** @type {MultiCompiler} */
         (context.compiler).compilers.find(
           (item) =>
-            Object.hasOwn(item.options, "devServer") &&
-            item.options.devServer !== false,
+            Object.hasOwn(item.options, "devServer") || item.options.devServer !== false,
         );
 

[Timeout] EqualityOperator
src/utils/setupOutputFileSystem.js:36:13
         (context.compiler).compilers.find(
           (item) =>
             Object.hasOwn(item.options, "devServer") &&
-            item.options.devServer !== false,
+            item.options.devServer === false,
         );
 

[Timeout] BooleanLiteral
src/utils/setupOutputFileSystem.js:36:40
         (context.compiler).compilers.find(
           (item) =>
             Object.hasOwn(item.options, "devServer") &&
-            item.options.devServer !== false,
+            item.options.devServer !== true,
         );
 

[Timeout] ConditionalExpression
src/utils/setupOutputFileSystem.js:40:9
         );
 
       ({ outputFileSystem } =
-        compiler ||
-        /** @type {MultiCompiler} */
-        (context.compiler).compilers[0]);
+        false);
     } else {
       ({ outputFileSystem } = context.compiler);

[Timeout] ConditionalExpression
src/utils/setupOutputFileSystem.js:40:9
         );
 
       ({ outputFileSystem } =
-        compiler ||
-        /** @type {MultiCompiler} */
-        (context.compiler).compilers[0]);
+        true);
     } else {
       ({ outputFileSystem } = context.compiler);

[Timeout] BlockStatement
src/utils/setupOutputFileSystem.js:43:12
         compiler ||
         /** @type {MultiCompiler} */
         (context.compiler).compilers[0]);
-    } else {
-      ({ outputFileSystem } = context.compiler);
-    }
+    } else {}
   }
 

[Timeout] ConditionalExpression
src/utils/setupOutputFileSystem.js:50:5
 
   const compilers =
     /** @type {MultiCompiler} */
-    (context.compiler).compilers || [context.compiler];
+    true;
 
   for (const compiler of compilers) {

[Timeout] BlockStatement
src/utils/setupOutputFileSystem.js:52:37
     /** @type {MultiCompiler} */
     (context.compiler).compilers || [context.compiler];
 
-  for (const compiler of compilers) {
-    if (compiler.options.devServer === false) {
-      continue;
-    }
-
-    // @ts-expect-error
-    compiler.outputFileSystem = outputFileSystem;
-  }
+  for (const compiler of compilers) {}
 
   // @ts-expect-error

[Timeout] BooleanLiteral
src/utils/setupOutputFileSystem.js:53:40
     (context.compiler).compilers || [context.compiler];
 
   for (const compiler of compilers) {
-    if (compiler.options.devServer === false) {
+    if (compiler.options.devServer === true) {
       continue;
     }
